{"track": [{"idTrack": "32882668", "idAlbum": "2122877", "idArtist": "112090", "idLyric": "292265", "idIMVDB": "2147483647", "strTrack": "Bleeding Love", "strAlbum": "Spirit", "strArtist": "Leona Lewis", "strArtistAlternate": "Leona Louise Lewis", "intCD": null, "intDuration": "263640", "strGenre": "Pop", "strMood": "In Love", "strStyle": "Manufactured Pop", "strTheme": "...", "strDescriptionEN": "\"Bleeding Love\" is a song performed by British singer Leona Lewis, who released it from her 2007 debut studio album, Spirit. Jointly written and composed by American singers and songwriters Jesse McCartney and Ryan Tedder, and produced by Tedder, the song is the album's lead single; officially, it was Lewis's official second single, and followed \"A Moment Like This.\" It was released in the United Kingdom and Ireland in October 2007. Debuting at number one on the UK Singles Chart, \"Bleeding Love\" became the best-selling single of 2007 in the United Kingdom. After the single's release, it became a major international hit, and was the best-selling single of 2008 worldwide. The single has reached number one in 35 countries, including Ireland, Japan, Germany and the United States, making it only the second song in history to achieve this feat, Elton John's \"Candle in the Wind 1997\" being the first. The video first aired on 17 October 2007, and was uploaded to YouTube on the same day, on which it now has over 138 million views.\n\n\"Bleeding Love\" has sold more than one million copies in the United Kingdom, and over 4 million digital downloads in the U.S., where it was the best-selling digital song there in 2008. It was named the 17th most successful song in the US from 2000–2009, on the Billboard Hot 100 Songs of the Decade. The song achieved a similar feat in the United Kingdom where it was the best-selling single of 2007, selling 788,000 copies. \"Bleeding Love\" has charted on the UK Singles Chart in three different years: in 2007 it peaked at number one; 2008 at number 76; and 2009 at number 97. \"Bleeding Love\" was nominated for Record of the Year and Best Female Pop Vocal Performance at the 51st Grammy Awards. At the 2008 Brit Awards it was nominated for Best British Single. It is Lewis's biggest hit in the US to date, is still her only single to reach the top ten of the Billboard Hot 100 and remains her most successful single worldwide.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/syxspv1484317125.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=7_weSk0BonM", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "146983963", "intMusicVidLikes": "274300", "intMusicVidDislikes": "5832", "intMusicVidFavorites": "0", "intMusicVidComments": "11502", "intTrackNumber": "1", "intLoved": "6", "intScore": "9.57143", "intScoreVotes": "7", "intTotalListeners": "871356", "intTotalPlays": "5170677", "strMusicBrainzID": "4a607ce9-031b-4fa8-9793-32f9a71a8ae7", "strMusicBrainzAlbumID": "9f5df671-c5f4-3431-874c-37fec2635ee6", "strMusicBrainzArtistID": "8d552dfc-648f-401f-90de-e925013ca537", "strLocked": "Unlocked"}]}