{"track": [{"idTrack": "33014350", "idAlbum": "2133701", "idArtist": "111305", "idLyric": "417604", "idIMVDB": null, "strTrack": "Don't Stop the Music", "strAlbum": "Good Girl Gone Bad", "strArtist": "Rihanna", "strArtistAlternate": "Robyn Rihanna Fenty", "intCD": null, "intDuration": "267000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Don't Stop the Music\" is a song by Barbadian recording artist Rihanna recorded for her third studio album Good Girl Gone Bad (2007). It was written by Tawanna Dabney, Michael Jackson, Mikkel S. Eriksen and Tor Erik Hermansen, and produced by the latter two under their stage-name StarGate. The song was released as the album's fourth single on September 7, 2007 worldwide. \"Don't Stop the Music\" is a dance-pop and techno song that features a wide variety of rhythmic devices used mainly in hip hop music. The song samples the line, \"Mama-say, mama-sa, ma-ma-ko-ssa\" which is taken from Jackson's 1983 single \"Wanna Be Startin' Somethin'\". For using the line, both Rihanna and Jackson faced a lawsuit from the Cameroonian musician Manu Dibango, who claimed that the hook is originally from his 1972 song \"Soul Makossa\".\n\n\"Don't Stop the Music\" received generally positive reviews from contemporary music critics with many of them praising the interpolation of the \"Mama-say, mama-sa, ma-ma-ko-ssa\" hook into the song. It was nominated for several accolades, eventually winning the award for Best International Song at the 2008 NRJ Music Awards. \"Don't Stop the Music\" was commercial success, reaching number-one in over ten countries worldwide including Australia, Austria, France, Germany and Switzerland. The single peaked at number three on the US Billboard Hot 100 chart and at number one on the US Hot Dance Club Songs chart. The song was certified triple platinum by the Recording Industry Association of America (RIAA) for selling more than 3 million copies in the US.\n\nAnthony Mandler shot the music video for the song in Prague, the Czech Republic. It features Rihanna together with two of her friends sneaking into the back of a candy store where there is a secret club. Other scenes include Rihanna partying with the people in the club. Since its release, \"Don't Stop the Music\" has become a staple in Rihanna's live performances. It was part of the set lists of her three major tours, Good Girl Gone Bad (2007–09), Last Girl on Earth (2010–11) and the Loud Tour (2011). English recording artist Jamie Cullum recorded a jazz version of the song for his 2009 studio album The Pursuit.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qqwrwv1359565258.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=yd8jh9QYfEs", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "219253014", "intMusicVidLikes": "242702", "intMusicVidDislikes": "9478", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "3", "intLoved": "0", "intScore": "9.8", "intScoreVotes": "5", "intTotalListeners": "920668", "intTotalPlays": "4601764", "strMusicBrainzID": "4c0566be-d3d9-42b2-964d-cf349972123b", "strMusicBrainzAlbumID": "7e48f018-b774-32e6-a68b-b42db04535c0", "strMusicBrainzArtistID": "73e5e69d-3554-40d8-8516-00cb38737a1c", "strLocked": "Unlocked"}]}