{"track": [{"idTrack": "32780496", "idAlbum": "2114804", "idArtist": "111827", "idLyric": "270269", "idIMVDB": "2147483647", "strTrack": "Hot N Cold", "strAlbum": "One of the Boys", "strArtist": "Katy Perry", "strArtistAlternate": "Katy Hudson", "intCD": null, "intDuration": "220226", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Hot n Cold\" is a song by American singer Katy Perry. The song was written and composed by Dr. Luke, Max Martin, and Perry for her major mainstream debut album, One of the Boys. The track was released as the album's second single. Its chorus features a series of binary opposites (such as hot/cold, yes/no, in/out, up/down, wrong/right, black/white) to emphasize the unstable nature of the characters' relationship. It reached number three on the Billboard Hot 100, making it Perry's second consecutive top three single, after her previous worldwide hit \"I Kissed a Girl\". The single has also become Perry's second top five single in the United Kingdom, Australia, Ireland and New Zealand, and topped the charts in Finland, Germany, Canada, Norway, Spain and Denmark, and has topped the charts in 15 countries. As of September 2011, \"Hot n Cold\" has sold over five million digital downloads.\n\nBlender magazine calls the track a \"spunky, climate-controlled kiss-off.\" The song went for ads on the North American radios on September 9 and remained the song with one of the biggest bullets of the entire mediabase for weeks. Perry made the live television premiere performance of \"Hot n Cold\" on NBC's Today show outdoor concert series on August 29. Perry revealed in an interview with Radio 1 that \"Hot n Cold\" would in fact be the follow-up single to her number one hit \"I Kissed a Girl\" in the United Kingdom and Australia. There are currently four radio edits: in one, \"bitch\" is replaced with the word \"chick\", (\"You PMS, like a chick, I would know\"); in the second, mostly used on radio program Open House Party, this version uses \"girl\" instead of \"bitch\" or \"chick\" (in a version once played on Ryan Seacrest's American Top 40 radio show, the lyrics are \"You PMS, I would know\"); in another edit, the lyrics first line of the song was repeated after the line was sung in full (\"You change your mind, like a girl, I would know\"), this edit can be heard in theme parks; finally, the radio edit that is used on UK music channels cuts out the word altogether. Perry performed the song live at the MTV EMAs in Liverpool, which she hosted, on November 6, 2008, to close the show after opening it with \"I Kissed a Girl\". A remixed version of the track has also been released for play in the iPhone OS game Tap Tap Revenge. The song was also performed as the opener at the first annual 2008 YouTube Live on November 22, 2008.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xryxwv1359423032.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=kTHNpusq654", "strMusicVidDirector": "Alan Ferguson", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "948656313", "intMusicVidLikes": "3434421", "intMusicVidDislikes": "188936", "intMusicVidFavorites": "0", "intMusicVidComments": "153559", "intTrackNumber": "7", "intLoved": "2", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "1006089", "intTotalPlays": "6482862", "strMusicBrainzID": "82214173-a7e5-4abc-938e-03031d9241b3", "strMusicBrainzAlbumID": "88f14b0b-f8d1-31b4-87ab-199145fc12d3", "strMusicBrainzArtistID": "122d63fc-8671-43e4-9752-34e846d62a9c", "strLocked": "Unlocked"}]}