{"track": [{"idTrack": "32801191", "idAlbum": "2116554", "idArtist": "112158", "idLyric": "0", "idIMVDB": "0", "strTrack": "Low", "strAlbum": "Mail on Sunday", "strArtist": "Flo Rida", "strArtistAlternate": "Tramar Dillard", "intCD": null, "intDuration": "230000", "strGenre": "Hip-Hop", "strMood": "Angry", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Low\" is the debut single by American rapper Flo Rida, featured on his debut studio album Mail on Sunday and also featured on the soundtrack to the 2008 film Step Up 2: The Streets. The song features and was co-written by fellow American rapper T-Pain. There is also a remix in which the hook is sung by Flo Rida rather than T-Pain. An official remix was made which features Pitbull and T-Pain. With its catchy, up-tempo and club-oriented Southern hip hop rhythms, the song peaked at the summit of the U.S. Billboard Hot 100.\n\nThe song was a massive success worldwide and was the longest-running number-one single of 2008 in the United States, spending ten consecutive weeks atop the Billboard Hot 100. With over six million digital downloads, it has been certified 8× Platinum by the RIAA, and was the most downloaded single of the 2000s decade, measured by paid digital downloads. The song was named third on the Billboard Hot 100 Songs of the Decade.\n\nSeveral of T-Pain's stylistic effects are present in this song, including Auto-Tune and call and answer during the chorus. It contains electronic elements featuring 808-style drums and an arpeggiated note sequence instead of a chord progression. Flo Rida has sexually charged (but not explicit) lyrics, for example he refers to a woman's buttocks as \"birthday cakes\" which \"stole the show\". T-Pain also relies heavily on synthesizers. The song is written in the key of E♭ minor. A Harmonic minor melody is played over the E♭ minor, and at different times different instrumentation cycles, i.e. sometimes only the synthesizer plays, sometimes only the bass, sometimes only the vocals. Flo Rida uses a style that is common in 1990s hip-hop party music. \"Low\" is written in common time with a moderate tempo of 120 beats per minute while T-Pain's vocal range spans nearly two to three octaves from B♭1 to F♯3.\n\nThe song makes references to a \"Shawty\" in a club who is wearing Apple Bottom jeans and boots with fur. \"Shawty\" also wears baggy sweat pants and Reeboks with the straps. The lyrics repeatedly suggest that Shawty is extremely attractive and possesses great skill in dancing provocatively. In particular, the song describes one of her more memorable dance sequences as giving her buttocks (colloquially referred to as a booty) a smack prior to \"getting low\".\n\nThe music video of \"Low\" was directed by Bernard Gourley and contains certain clips from Step Up 2: The Streets. It also contains cameos from Rick Ross, DJ Khaled, Cool & Dre, Briana Evigan, Torch and Gunplay of Triple C's and Jermaine Dupri. Also, T-Pain and Flo Rida are in a nightclub in a few scenes. The music video reached the number one spot on 106 & Park for five days and 22 days on TRL. The music video was also nominated at the 2008 MTV Video Music Awards for Best Male Video and Best Hip-Hop Video, but lost to Chris Brown's \"With You\" (Best Male Video) and Lil Wayne's \"Lollipop\" (Best Hip-Hop Video) music videos.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=UDAaevTq51I", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "65781821", "intMusicVidLikes": "222203", "intMusicVidDislikes": "6439", "intMusicVidFavorites": "0", "intMusicVidComments": "15445", "intTrackNumber": "5", "intLoved": "2", "intScore": "10", "intScoreVotes": "6", "intTotalListeners": "420917", "intTotalPlays": "1537685", "strMusicBrainzID": "b8d0bf15-7cf6-45d0-92b4-f6eb64e497ae", "strMusicBrainzAlbumID": "128a479e-576b-312e-92fb-a3b1908155e8", "strMusicBrainzArtistID": "4593d49a-7f67-46ba-9ec0-126bd676286f", "strLocked": "Unlocked"}]}