{"track": [{"idTrack": "32959289", "idAlbum": "2129184", "idArtist": "114138", "idLyric": "309102", "idIMVDB": null, "strTrack": "Paper Planes", "strAlbum": "Kala", "strArtist": "M.I.A.", "strArtistAlternate": null, "intCD": null, "intDuration": "205000", "strGenre": "UK Garage", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Paper Planes\" is a song by British musician M.I.A. from her second studio album, Kala (2007). The song was written by M.I.A. and Diplo. The song's backing track is a sample of the 1982 song \"Straight to Hell\" by The Clash, and the members of The Clash are credited as co-writers of the song. The chorus of \"Paper Planes\" was widely speculated to be based on the chorus to the 1992 song \"Rump Shaker\" by Wreckx-N-Effect, although that song's writers are not credited. It was produced by Diplo with additional production by Switch. \"Paper Planes\" was released for download in August 2007 and as the album's third single by XL Recordings and Interscope Records on February 11, 2008.\n\n\"Paper Planes\" is a downtempo rap ballad, with a folk style melody considered less dance-influenced than the other songs on the album. The song ignited wide acclaim upon release, and contemporary critics complimented its music direction and the subversive, unconventional subject matter of the piece, citing its chorus and its lyrical humour in the promotion of globalization. Rolling Stone, Rockdelux, Stylus, NME and The Guardian ranked \"Paper Planes\" highly in their lists of the best songs of the year, the 2000s decade and in some cases of all-time. The song won the Indie Award for Favourite International Single at the 2009 Canadian Independent Music Awards and the American Society of Composers, Authors, and Publishers (ASCAP) recognized the song as one of the most performed ones of 2008 at the ASCAP Pop Music Awards. Several artists have covered the song and released their own remixes.\n\nThe single peaked in the top twenty in Belgium, Denmark, Canada, the United Kingdom and the United States. M.I.A.'s first top twenty single in the UK and her next top ten charting song in Canada following \"Boyz\" (2007), it reached the top ten of seven Billboard charts and peaked at number four on the Billboard Hot 100 in the US. The single reached two positions higher than \"Boyz\" to top the Billboard Hot Dance Singles Sales chart. The song became XL Recordings' best selling single, is certified triple-platinum by the Music Canada (CRIA) in Canada and the Recording Industry Association of America in the US, where it is ranked the fifty-ninth most downloaded song in the digital era, and is certified Gold by the Recording Industry Association of New Zealand in New Zealand. The song has sold 3.6 million copies in the US, becoming the seventh best-selling song by a British artist in the digital era and one of the biggest crossover hits in the country by a solo artist.\n\nThe song was nominated for the Record of the Year for the 51st Grammy Awards in 2008. \"Paper Planes\" was sampled in rappers T.I. and Jay-Z's single \"Swagga Like Us\". The single's accompanying music video, filmed in New York City, showed M.I.A. walking and dancing with friends along the streets of the city, selling sandwiches to local people and paper planes flying overhead. The song has regularly featured on M.I.A.'s concert tours since 2007.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xsupvw1359766324.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=ewRjZoRtu0Y", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/yuvxuq1536485111.jpg", "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "53760586", "intMusicVidLikes": "248794", "intMusicVidDislikes": "9626", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "11", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "1164225", "intTotalPlays": "10021417", "strMusicBrainzID": "09f03130-4b30-46d8-a2cd-81f8ef9bb97b", "strMusicBrainzAlbumID": "44261ea6-06cf-3fd3-a05c-42dee49c295a", "strMusicBrainzArtistID": "7cf0ea9d-86b9-4dad-ba9e-2355a64899ea", "strLocked": "Unlocked"}]}