{"track": [{"idTrack": "32826634", "idAlbum": "2118559", "idArtist": "111282", "idLyric": "71629", "idIMVDB": null, "strTrack": "Piece of Me", "strAlbum": "Blackout", "strArtist": "Britney Spears", "strArtistAlternate": "Britney", "intCD": null, "intDuration": "212106", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Piece of Me\" is a song recorded by American singer Britney Spears for her fifth studio album, Blackout (2007). It was released on November 27, 2007 by Jive Records as the second single from the album. The song was written and produced by Swedish producers Bloodshy & Avant and Klas Åhlund as a response to the media scrutiny and sensationalism of Spears' private life, which they had seen by working with her over the years. \"Piece of Me\" was the last song to be recorded for Blackout. The self-manifesto song's lyrics are written like a biography retelling her mishaps. Musically, \"Piece of Me\" is an electro song that runs through a down-tempo dance beat. Spears' voice is heavily synthesized, and constantly shifts in pitch. Backing vocals are provided by Bloodshy & Avant and Robyn.\nThe song has received general critical acclaim, praising its production and defiant lyrics, while citing it as one of the highlights from Blackout. Rolling Stone ranked the song at number fifteen on their list of the 100 Best Songs of 2007. It was also commercially successful, peaking at number one in Ireland and reaching top ten positions in Australia, Austria, Canada, Denmark, Finland, New Zealand, Sweden and the United Kingdom. In the United States, it became the second single from the album to have peaked at the top of the Billboard Hot Dance Club Play chart.\nThe music video, directed by Wayne Isham, portrayed Spears' life at the time and showed her with her friends disguising themselves in order to confuse the paparazzi. Isham's concept was to have Spears confidently parodying her situation. It received mixed reviews from critics, most arguing her body was digitally altered. The video was nominated in three categories at the 2008 MTV Video Music Awards and won all of them, including Video of the Year. \"Piece of Me\" was performed at The Circus Starring Britney Spears (2009) and the Femme Fatale Tour (2011). The song also shares a title with Spears' Las Vegas residency show, Britney: Piece of Me, where it is also performed.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xwswvw1531149246.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=u4FF6MpcsRw", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "66103373", "intMusicVidLikes": "116677", "intMusicVidDislikes": "4528", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "0", "intScore": "9", "intScoreVotes": "5", "intTotalListeners": "528831", "intTotalPlays": "5059918", "strMusicBrainzID": "dd7cd19f-6c32-4a6d-bd97-cc7b5862c957", "strMusicBrainzAlbumID": "0b8e14e1-d44d-3770-8617-5c6137a444a8", "strMusicBrainzArtistID": "45a663b5-b1cb-4a91-bff6-2bef7bbfdd76", "strLocked": "Unlocked"}]}