{"track": [{"idTrack": "32760191", "idAlbum": "2113152", "idArtist": "111520", "idLyric": "353766", "idIMVDB": "0", "strTrack": "Pocketful of Sunshine", "strAlbum": "Pocketful of Sunshine", "strArtist": "Natasha Bedingfield", "strArtistAlternate": null, "intCD": null, "intDuration": "185000", "strGenre": "Pop", "strMood": "...", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Pocketful of Sunshine\" is a song performed by British singer and songwriter Natasha Bedingfield, released as the second single from her second North American studio album of the same name (2008). Bedingfield co-wrote the song together with American songwriter Danielle Brisebois and American musician and songwriter John Shanks; Shanks also produced the track as well as performing on most of the instruments present. Epic Records serviced the song to mainstream radios on 11 February 2008 in the United States. It received an international release in spring 2011 to promote the release of Strip Me Away (2011).\n\nBedingfield noted \"Pocketful of Sunshine\" as her favorite, stating that it centers on escaping from one's troubles. It adapts dance-pop and adult contemporary styles, differing from her previous recordings. Lyrically, the song discusses escapism and finding a peaceful place in difficult situations. The message is amplified by the melancholic tone of the lyrics mixing with the exuberance displayed in Bedingfield's voice. \"Pocketful of Sunshine\" was well received by contemporary music critics; the majority of them named it as one of the album's highlights. Several critics also praised it as a bright and lively summer tune.\n\n\"Pocketful of Sunshine\" experienced commercial success in North America, peaking at number five in the United States on the Billboard Hot 100. The song was certified double platinum by the Recording Industry Association of America (RIAA) and sold three million downloads, becoming her most successful single there. It also charted in Canada, peaking at #3 and receiving the platinum certification. It however did not replicate the success in North America as it charted moderately in several countries, reaching the top thirty in international territories.\n\nThe music video for \"Pocketful of Sunshine\" was released in spring 2008 and features Bedingfield escaping from a stressful situation and dancing on a roof with other background dancers. The video also portrays scenes of other people escaping their troubles, coming to Bedingfield for comfort. The single has been used widely in the media, being featured in movies and television series like Easy A, Degrassi: The Next Generation and The Ugly Truth.\n\n\"Pocketful of Sunshine\" was written and produced by John Shanks, while additional writing was provided by Bedingfield and Danielle Brisebois. The aforementioned songwriters were also involved in performing the background vocals present on the track. Shanks, a musician as well as a writer and producer, performed several instruments that make up the song, which include the guitar, bass and keyboards. The latter instrument was also played by Charlie Judge while Wendy Melvain performed on guitar. Jeff Rothschild was the engineer behind the recording process of \"Pocketful of Sunshine\", which took place at Starstruck Studios in Nashville, Tennessee and Henson Recording Studios in Hollywood, California. He received assistance from engineers Aaron Kasdorf and Jared Robbins in recording the song. Rothschild was involved in programming the song as well as playing the drums. It was then edited through the use of ProTools technology by Lars Fox and mixed by Manny Marroquin at Larrabee Studios in Los Angeles, California. In an interview with OK! Magazine, Bedingfield the song as one of her favorites on the album, stating \"Its about going to a familiar place when you're in that situation that you want to escape from finding a peaceful place within.\"\n\n\"Pocketful of Sunshine\" is the second single taken from Pocketful of Sunshine (2008), a repackaged version of N.B. released in North American territories. Epic Records serviced the song to contemporary hit radios on 11 February 2008. On 29 July 2008, an extended play of \"Pocketful of Sunshine\" was released via iTunes in North American territories. The EP features remixes by StoneBridge and American disc jockey Johnny Vicious. Following the release of Strip Me in international territories in spring 2011, the song was selected to be released as the international single. \"Pocketful of Sunshine\" was released for digital download on 15 April 2011 in Germany and 22 April 2011 in France.\n\n\"Pocketful of Sunshine\" is a pop song that incorporates styles of dance-pop and runs for three minutes and twenty three seconds. The song is built on an electro beat. According to the digital music sheet published at Musicnotes.com by EMI Music Publishing, it is written in a key of A minor. The song is set in common time and to a moderate groove with a tempo of 110 beats per minute. Bedingfield's vocals range from a high register of A3 to a low register of D5 while the song follows a chord progression of Am-Gsus2-F-Dm. Lyrically, \"Pocketful of Sunshine\" is written about finding refuge and escape in love and the small triumphs of life. The message is amplified by the contrast between the melancholic tone of the lyrics and the exuberance of Bedingfield's vocals.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/tppvqs1487960735.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=gte3BoXKwP0", "strMusicVidDirector": "Alan Ferguson", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "34163545", "intMusicVidLikes": "201157", "intMusicVidDislikes": "3799", "intMusicVidFavorites": "0", "intMusicVidComments": "12897", "intTrackNumber": "2", "intLoved": "1", "intScore": "9.8", "intScoreVotes": "5", "intTotalListeners": "344099", "intTotalPlays": "1884555", "strMusicBrainzID": "965b64c7-51e5-422c-8c00-77f3fce2711f", "strMusicBrainzAlbumID": "5999f031-6b96-3a09-a692-2136a1983430", "strMusicBrainzArtistID": "8b477559-946e-4ef2-9fe1-446cff8fdd79", "strLocked": "Unlocked"}]}