{"track": [{"idTrack": "32741758", "idAlbum": "2111329", "idArtist": "111358", "idLyric": "297443", "idIMVDB": null, "strTrack": "Shadow of the Day", "strAlbum": "Minutes to Midnight", "strArtist": "Linkin Park", "strArtistAlternate": null, "intCD": null, "intDuration": "292000", "strGenre": "Metal", "strMood": "Angry", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Shadow of the Day\" is a song by American rock band Linkin Park. The song was released as the third single from their third studio album, Minutes to Midnight, on October 16, 2007. The first public performance of Shadow of the Day was during the Projekt Revolution tour in Auburn, Washington, on July 25, 2007. On September 4, 2012, \"Shadow of the Day\", along with \"Breaking the Habit\", \"New Divide\", and \"Burn It Down\", was released in the \"Linkin Park Pack 02\" as downloadable content for the music rhythm video game, Rock Band 3.\n\nSong structure and background information\n\nChester Bennington performing at Smirnoff Music Centre in Dallas, Texas during the Projekt Revolution tour, 2007\nThe band experimented with several different versions of the keyboard loop, before deciding on the one used in the final version. Lead singer Chester Bennington explained that they used over 60 different beats for this song until they found the suitable one. They also used different types of instruments like banjos at first, experimenting with different styles until they came up with something that would fit the track.\n\nLike \"Breaking the Habit\", \"Shadow of the Day\" uses samples of live string ensemble recordings, played by Mike Shinoda. The song is written in the key of B major, the first major key the band has ever used. The chorus is based on the very common I–V–vi–IV progression (B, F♯, G♯m, E in the key of B major). On the verses, the chord progression is the less common vi–V–IV–IV (G♯m, F♯/A♯, E, E). The end of the album version of the song, which is an instrumental piece, crossfades into the start of \"What I've Done\". It is the second-longest track on the album. Mike Shinoda sings only the lines \"Sometimes beginnings aren't so simple, sometimes goodbye's the only way\" and the last three choruses \"And the shadow of the day will embrace the world in grey, and the sun will set for you\" with a different voice tone but with the same note of Chester's part.\n\nDuring the Projekt Revolution tour, Chester Bennington was playing the guitar while also singing the lyrics at the end of the song. These occasions are very rare for the band, since Brad Delson is the lead guitarist, and Mike Shinoda generally plays the second guitar part, but Shinoda usually played keyboards instead. However, this is not the first song on which Bennington plays guitar, since \"It's Goin' Down\" was also performed with Bennington playing the guitar. Later, Bennington would also play rhythm guitar on live performances of \"Iridescent\". Bennington would also play rhythm guitar on live performances of a few songs from the album One More Light before his death in July 2017.\n\nThe song was remastered for iTunes in 2013, with a new arrangement of strings.\n\nMusic video\nThe music video was directed by Joe Hahn. It takes place during a large scale civil unrest in what appears to be the United States. The video was shot in Los Angeles at 20th Century Fox. The action was set up by stunt coordinator Steven Ho.\n\nThe music video was released to the internet on October 15, 2007. The video shows Chester Bennington waking up. His alarm clock reads 11:55, the then Doomsday Clock time, referencing the album title Minutes to Midnight and the song which is the fifth song on the album. The video is over four minutes long, meaning that the time at the end would be 11:59 PM, or one minute to midnight. Bennington then watches the news, washes up, gets dressed, and goes outside. The video takes place in a war-torn world, where mass chaos is ensuing on the streets of the city. There is a lot of violence going on with many police and gunshots. Plumes of smoke can be seen in the sky. Soldiers and riot police can be seen forcefully detaining civilians. Near the end of the video, a car is set on fire and bursts into flames as several people taking place in the riot throw molotov cocktails at police resulting in the Police Riot Control and SWAT teams opening fire and advancing while the mob of people retreat. A man suddenly throws a bottle of alcohol on a car and the car takes fire. Bennington then stands in front of the burning car, while looking at the carnage that surrounds him. He then turns towards the flames, and the video fades to black. The electronic/synth outro of the song is excluded on the video to make it a more appropriate finish. If listened to carefully towards the middle of the video, the mob is shouting 'we want freedom'.\n\nThis is the only band video with Bennington appearing without the other band members. The video features no performance footage other than Bennington's singing. Sound effects taking place in the video can be heard along with the music.\n\nThere are also three different edits of the video:\n\nA director's cut which is available at Joe Hahn's section of the Linkin Park website. In this version there are several scenes not in other versions. Bennington is seen carrying a bag which he drops on the ground around 3:18 into the song. A few seconds later it returns to Bennington's house and zooms in on a table containing many wires and other electronics. There are also several blueprints and video monitors for security cameras displaying a certain building. After about 30 seconds there is a giant explosion destroying the building that the video monitors were displaying.\nAn alternate ending to the video, which shows Bennington begin to walk away from the flames. The police open fire, and the video ends with a shot of Bennington's bag falling to the ground. The alternate ending is only shown on MTV Europe music channels.\nMTV Overdrive contains a version which scenes with gunfire and bottle smashing are cut and replaced with different riot scenes.\nAs of February 2022, the song has 58 million views on YouTube.\n\nThe video won Best Rock Video at the 2008 MTV Video Music Awards and was also nominated for Best Direction in a Video. The video was placed at number 37 of the year by VH1's Top 40 Videos of the Year. The song was also featured in the 2008 Beijing Olympics during Tyson Gay's highlight reel just prior to the 100m final.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/z4jxgs1664267938.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=n1PCW0C1aiM", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "59147348", "intMusicVidLikes": "391478", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "20169", "intTrackNumber": "5", "intLoved": "0", "intScore": "10", "intScoreVotes": "2", "intTotalListeners": "657952", "intTotalPlays": "4993846", "strMusicBrainzID": "efae128c-cd78-4b38-b61c-6f8956379cd3", "strMusicBrainzAlbumID": "a4201f5c-f0d7-319c-ba9d-ba0bac38da7a", "strMusicBrainzArtistID": "f59c5520-5f46-4d2c-b2c4-822eabf53419", "strLocked": "Unlocked"}]}