{"track": [{"idTrack": "33520089", "idAlbum": "2174990", "idArtist": "111961", "idLyric": "0", "idIMVDB": "0", "strTrack": "When I Grow Up", "strAlbum": "Doll Domination", "strArtist": "Pussycat Dolls", "strArtistAlternate": null, "intCD": null, "intDuration": "246000", "strGenre": "Pop", "strMood": "Energetic", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "The song's music video was shot from May 23 to 24, 2008 on Hollywood Boulevard in Los Angeles, with director Joseph Khan. American recording artist Britney Spears filmed a cameo appearance for the video on June 4 at the Warner Bros. lot in Los Angeles. An on set \"insider\" said that Spears' scene was short, only consisting of her driving in a passing car and waving to the other girls. On June 12, 2008 it was announced by MTV News that the cameo had been cut from the final video. Scherzinger was asked why Spears got cut from the video. She said: \"I honestly am not so sure. You shoot a lot of things when you do a video. Some things stay in but other things don't make the cut and Britney just didn't make it. I've seen a little clip of her performance and she looked adorable so I really wish she was in it! Hopefully we'll work together in the future.\" A short clip of the music video was released online on June 12, 2008; a day before the video's premiere on June 13, 2008 on FNMTV.\n\nIn the video the Pussycat Dolls are shown sitting in a car in the middle of a traffic jam, where Scherzinger flashes a ring that says \"famous\". They sing the introduction of the song in the car before jumping out. When the chorus kicks in, the women leave the car and stand on the roofs of the other cars and start dancing a routine. Then they walk down a street of Hollywood stars with bubbles floating all around them. As they walk down the street, they also stop to sing on a bench. As the second chorus starts, the Dolls climb scaffolding and begin to dance. During Scherzinger's solo, she stands in a small area with the Pussycat Dolls logo to the left and a mirror to the right, with lights flashing. The Dolls then dance in the breakdown section with the logo behind them and the camera zooms out to reveal filming equipment and playback screens.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wwwspw1483976416.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=K0K46C82v9o", "strMusicVidDirector": "Joseph Khan", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "164732273", "intMusicVidLikes": "326240", "intMusicVidDislikes": "13220", "intMusicVidFavorites": "0", "intMusicVidComments": "25256", "intTrackNumber": "1", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "08da5285-641f-485e-8182-3fbcb0e04cb2", "strMusicBrainzAlbumID": "930202e7-58d9-3476-b1fa-7c7faf07ec9b", "strMusicBrainzArtistID": "1fda852b-92e9-4562-82fa-c52820a77b23", "strLocked": "Unlocked"}]}