{"track": [{"idTrack": "32826645", "idAlbum": "2118560", "idArtist": "111282", "idLyric": "71631", "idIMVDB": "0", "strTrack": "Womanizer", "strAlbum": "Circus", "strArtist": "Britney Spears", "strArtistAlternate": "Britney", "intCD": null, "intDuration": "224400", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Womanizer\" is a song by American recording artist Britney Spears from her sixth studio album, Circus. It was released on September 26, 2008 by Jive Records as the lead single of the album. Produced and co-written by Nikesha Briscoe and Rafael Akinyemi of The Outsyders, the song had to be re-recorded after a snippet was leaked onto the web. \"Womanizer\" is an uptempo earworm electropop song with characteristic sirens and a repetitive hook. Described by Spears as a girl anthem, the song's lyrics recall a womanizing man, while the protagonist of the song makes clear she knows who he really is. \"Womanizer\" was well received by contemporary critics, with reviewers praising its hook, melody and empowering lyrics. Critics also observed it was a stand-out track from its album and also deemed it as a comeback single for Spears.\n\n\"Womanizer\" was a commercial success, peaking atop of the charts in Belgium, Canada, Denmark, Finland, France, Norway, Sweden and the United States. It also reached the top ten in every country it charted in also receiving several certifications from several countries. In the United States, \"Womanizer\" was her first single to reach number-one since \"...Baby One More Time\" in 1999. The song broke the record for the highest jump to number one at a time which was later broken by Kelly Clarkson's \"My Life Would Suck Without You\" in 2009. It is also her best-selling digital song in the country, having sold over 3.3 million copies, and over 6 million copies around the globe, making it one of the best-selling singles worldwide.\n\nThe music video, directed by Joseph Kahn, was created by Spears as a sequel to the music video of \"Toxic\". It portrays Spears as a woman who disguises herself in different costumes and follows her boyfriend through his daily activities to expose him in the end. The video also contains interspersed scenes of Spears naked in a steam room, as a response to the attacks she had received over the years about her weight. It received positive reviews and was considered as a return to form for Spears. The video was also nominated for two categories at the 2009 MTV Video Music Awards, and went on to win Best Pop Video.\n\nThe song has been covered by a number of artists from different genres, including Lily Allen, Franz Ferdinand and Girls Aloud. Spears performed \"Womanizer\" on several television shows including The X Factor and Good Morning America, as well as award shows such as the 2008 Bambi Awards. She has also performed the song at The Circus Starring Britney Spears (2009) and the Femme Fatale Tour (2011), incorporating police-inspired costumes and imagery. \"Womanizer\" received a Grammy nomination in 2010 in the Best Dance Recording category, but lost to Lady Gaga's \"Poker Face\".", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/sytrqs1359595862.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=rMqayQ-U74s", "strMusicVidDirector": "Joseph Kahn", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "119734067", "intMusicVidLikes": "138355", "intMusicVidDislikes": "5403", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "1", "intScore": "9.33333", "intScoreVotes": "6", "intTotalListeners": "767584", "intTotalPlays": "6955355", "strMusicBrainzID": "bb2d1754-0d93-41a1-8346-e95dacab304d", "strMusicBrainzAlbumID": "1e5f92e0-913c-3202-a72c-b068b9f34ce1", "strMusicBrainzArtistID": "45a663b5-b1cb-4a91-bff6-2bef7bbfdd76", "strLocked": "Unlocked"}]}