{"track": [{"idTrack": "32885265", "idAlbum": "2123086", "idArtist": "113168", "idLyric": "446889", "idIMVDB": null, "strTrack": "All I Wanna Do", "strAlbum": "Tuesday Night Music Club", "strArtist": "Sheryl Crow", "strArtistAlternate": null, "intCD": null, "intDuration": "273893", "strGenre": "Country", "strMood": "Happy", "strStyle": "Country", "strTheme": "...", "strDescriptionEN": "\"All I Wanna Do\" is a song performed by Sheryl Crow and written by Wyn Cooper, Sheryl Crow, David Baerwald, Bill Bottrell and Kevin Gilbert. It was Crow's breakthrough hit from her 1993 debut album, Tuesday Night Music Club. The song was the winner of the 1995 Grammy Record of the Year and Best Female Pop Vocal Performance and was nominated for Song of the Year. The song is her biggest US hit, peaking at #2 on the Billboard Hot 100 for six weeks behind \"I'll Make Love to You\" by Boyz II Men. In addition to this it also peaked at number one on the Adult Contemporary charts in both the US and Canada, as well as the pop charts in Canada and at #4 on the UK Singles Chart.\n\nCrow performed the song on her live album Sheryl Crow and Friends: Live from Central Park.\n\nThe lyrics for the song are based on the poem \"Fun\" by Wyn Cooper. Crow's producer (Bottrell) discovered Cooper's poetry book \"The Country of Here Below\" in a Pasadena, California used bookstore. Crow adapted \"Fun\" into the lyrics for her song – earning Cooper considerable royalties, and helping to promote his book, originally published in a run of only 500 copies in 1987, into multiple reprints.\n\nThe opening spoken line, \"This ain't no disco\", is a reference to the song \"Life During Wartime\" by Talking Heads. When played at live performances, the line is also commonly changed to refer to the local listening area (such as \"This is VA\" instead of \"This is LA\").\n\nThe video was directed by David Hogan, who also directed her debut video for \"Leaving Las Vegas\". It features Crow and her band performing the song on the street, with notable characters flying through the air. The video was filmed in front of the Roxy Theatre at the corner of Franklin Street and North 1st Street in Clarksville, Tennessee.\n\nTwo versions of the music video exist. For unknown reasons, the original video, which featured the character mentioned in the song \"Billy\", played by actor Gregory Sporleder, was changed and he was edited out of the video. However, at the 1:03 mark in the edited version, \"Billy\"'s shadow can be seen on the brick wall as he is walking up the street to where Crow is performing, from 1:12–1:14 (and again from 3:33–3:36), the arm of his jacket can be seen as he is watching her, from 1:30–1:34 he walks back and forth in front of her, from 1:40–1:45 he is standing nearby, from 2:02–2:03 \"Billy\"'s head can be seen behind the flying woman's head, and from 2:52–2:53 \"Billy\" and his shadow are visible below.\n\nThe edited version appears on her Greatest Hits DVD collection of her music videos.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/ywsrwu1486379925.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=ClbmWkbocoY", "strMusicVidDirector": "David Hogan", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "2412293", "intMusicVidLikes": "30559", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "982", "intTrackNumber": "9", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "329438", "intTotalPlays": "1250962", "strMusicBrainzID": "17d4381d-6d7b-4912-ac5a-72b89f39dc61", "strMusicBrainzAlbumID": "0f0ecd4f-1d20-34b9-9f67-5aaa785c7f11", "strMusicBrainzArtistID": "80ccfede-c258-4575-a7ad-c982e9932e0f", "strLocked": "Unlocked"}]}