{"track": [{"idTrack": "32728167", "idAlbum": "2110034", "idArtist": "111268", "idLyric": "6269", "idIMVDB": "0", "strTrack": "Crazy", "strAlbum": "Get a Grip", "strArtist": "Aerosmith", "strArtistAlternate": null, "intCD": null, "intDuration": "316826", "strGenre": "Hard Rock", "strMood": "Philosophical", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "Crazy is a power ballad performed by American hard rock band Aerosmith and written by Steven Tyler, Joe Perry, and Desmond Child. It was the final single from their massively successful 1993 album Get a Grip. It was released as a single in 1994 and peaked at #17 on the Billboard Hot 100, #7 on the Mainstream Rock Tracks chart, and #3 in Canada. In the United Kingdom, it was released as a double-A side with Blind Man, which reached #23.\n\nThe songs lyrics are about a woman who comes and goes, and whose crazy ways drive the narrator crazy.\n\nThe video for the song was directed by Marty Callner and received heavy rotation on MTV. It was one of the most requested videos of 1994. It featured the third appearance of Alicia Silverstone in the bands videos, and was the career debut of Stevens then-teenaged daughter Liv Tyler. The decision to cast Liv in the video for Crazy was based on the videos creators having seen her in a Pantene commercial, with absolutely no knowledge her father was in the band.\n\nThe video is film-like and depicts the two as schoolgirls who skip class and run away, driving off in a black Ford Mustang convertible in a manner similar to the 1991 hit film Thelma & Louise. The two use their good looks to take advantage of a service station clerk, and needing money, enter an amateur pole-dancing competition. The video is noteworthy for its risque and sexually suggestive scenes. The video is edited to show the similarities in stage moves of Steven Tyler and daughter Liv. The girls win the dance competition, then spend the night in a motel. They continue their joyride the following day, where they encounter a young sweaty and shirtless farmer (played by model Dean Kelly) aboard a tractor tilling land in the countryside. They persuade him to join them in their journey, where they all go skinny dipping in a lake. The girls take off with his clothes and leave him behind at the lake. Naked, he chases after them, and rejoins them in the convertible. The final seconds of the video show the word Crazy spelled out in cursive in the cropland by the still-running tractor.\n\nJason London makes a short cameo at the end in a tag scene, reprising his character from the Amazing video.\n\nA longer directors cut of the video appears on the compilation Big Ones You Can Look At. This version features a few more provocative clips, and a longer, more risque version of the pole-dancing competition scene. It also removes the scene in which the girls abandon the farmer after skinny-dipping with him. Both versions of the video include an extra reprise of the chorus which is not included on the album and radio versions.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qwrvwt1489580064.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=NMNgbISmF4I", "strMusicVidDirector": "Marty Callner", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "280007748", "intMusicVidLikes": "701553", "intMusicVidDislikes": "27864", "intMusicVidFavorites": "0", "intMusicVidComments": "20808", "intTrackNumber": "11", "intLoved": "1", "intScore": "9.57143", "intScoreVotes": "7", "intTotalListeners": "651643", "intTotalPlays": "3473236", "strMusicBrainzID": "48ade205-8866-49ab-aeee-1de90b25e688", "strMusicBrainzAlbumID": "73c6a7b0-1dc2-3ddc-a720-c29505271711", "strMusicBrainzArtistID": "3d2b98e5-556f-4451-a3ff-c50ea18d57cb", "strLocked": "Unlocked"}]}