{"track": [{"idTrack": "32770221", "idAlbum": "2113981", "idArtist": "111657", "idLyric": "46078", "idIMVDB": "0", "strTrack": "Loser", "strAlbum": "Mellow Gold", "strArtist": "Beck", "strArtistAlternate": null, "intCD": null, "intDuration": "235533", "strGenre": "Alternative Rock", "strMood": "Happy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Loser\" is a song by American musician Beck. It was written by Beck and record producer Karl Stephenson, who both produced the song with Tom Rothrock. \"Loser\" was initially released as Beck's second single by independent record label Bong Load Custom Records on 12\" vinyl format with catalogue number BL5 on March 8, 1993.\n\nWhen it was first released independently, \"Loser\" began receiving airplay on various modern rock stations, and the song's popularity eventually led to a major-label record deal with Geffen Records-subsidiary DGC Records. After the song's re-release under DGC, the song peaked at number 10 on the United States Billboard Hot 100 in April 1994, becoming Beck's first single to hit a major chart. The song was subsequently released on the 1994 album Mellow Gold.\n\nIn the late 1980s and early 1990s, Beck was a homeless musician in the New York City anti-folk scene. He returned to his hometown of Los Angeles in early 1991, due to his financial struggles. Described by biographer Julian Palacios as having \"no opportunities whatsoever\", Beck worked low-wage jobs to survive, but still found time to perform his songs at local coffeehouses and clubs. In order to keep indifferent audiences engaged in his music, Beck would play in a spontaneous, joking manner. \"I'd be banging away on a Son House tune and the whole audience would be talking, so maybe out of desperation or boredom, or the audience's boredom, I'd make up these ridiculous songs just to see if people were listening. 'Loser' was an extension of that.\" Tom Rothrock, co-owner of independent record label Bong Load, expressed interest in Beck's music and introduced him to Karl Stephenson, a record producer for Rap-A-Lot Records.\n\n\"Loser\" was written and recorded by Beck while he was visiting Stephenson's home. Although the song was created spontaneously, Beck has claimed to have had the idea for the song since the late 1980s; he once said, \"I don't think I would have been able to go in and do 'Loser' in a six-hour shot without having been somewhat prepared. It was accidental, but it was something that I'd been working toward for a long time.\" Beck played some of his songs for Stephenson; Stephenson enjoyed the songs, but was unimpressed by Beck's rapping. Stephenson recorded a brief guitar part from one of Beck's songs onto an 8-track, looped it, and added a drum track to it. Stephenson then added his own sitar playing and other samples. At that point, Beck began writing and improvising lyrics for the recording. For the song's vocals, Beck attempted to emulate the rapping style of Public Enemy's Chuck D. According to Beck, the line that became the song's chorus originated because \"When  played it back, I thought, 'Man, I'm the worst rapper in the world, I'm just a loser.' So I started singing 'I'm a loser baby, so why don't you kill me.'\" According to Rothrock, the song was largely finished in six and a half hours, with two minor overdubs several months later.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/tyqrrs1486737141.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=YgSPaXgAdzE", "strMusicVidDirector": "Steve Hanft", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "69129622", "intMusicVidLikes": "309995", "intMusicVidDislikes": "12423", "intMusicVidFavorites": "0", "intMusicVidComments": "24476", "intTrackNumber": "1", "intLoved": "1", "intScore": "9.66667", "intScoreVotes": "6", "intTotalListeners": "988632", "intTotalPlays": "5275216", "strMusicBrainzID": "9d9e92f9-695e-4fca-af9d-0ecda1c6de43", "strMusicBrainzAlbumID": "4f8bb33f-9e2d-34dc-8852-5d591cc104d8", "strMusicBrainzArtistID": "309c62ba-7a22-4277-9f67-4a162526d18a", "strLocked": "Unlocked"}]}