{"track": [{"idTrack": "33041556", "idAlbum": "2135887", "idArtist": "115268", "idLyric": "108072", "idIMVDB": null, "strTrack": "Mmm Mmm Mmm Mmm", "strAlbum": "God Shuffled His Feet", "strArtist": "Crash Test Dummies", "strArtistAlternate": null, "intCD": null, "intDuration": "233400", "strGenre": "Alternative Rock", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Mmm Mmm Mmm Mmm\" is a single by the Canadian folk rock group Crash Test Dummies, featured on their 1993 album God Shuffled His Feet. Each verse describes the isolation and suffering of a child, two of whom have a physical abnormality; a boy whose hair has prematurely whitened from shock and a girl covered in birthmarks. The third child is a boy whose parents take him with them to their church, where they 'shake and lurch' on the floor. His situation is said to be worse than the other children's.\nAn alternative version sometimes performed at live concerts replaced the third verse with one concerning a boy whose mother disposed of his tonsils after a tonsillectomy, thus depriving him of the possibility of bringing them to show and tell. The associated music video sets the song's lyrics as the script for a series of one-act plays performed by school children. Throughout, the scenes of the performance are intercut with scenes of the Crash Test Dummies performing the song at stage side.\nThe first act, set at a city intersection, tells the story of a young boy who was involved in a car crash. His hair turned white due to the force of the crash.\nThe second act tells the story of a girl that never used to \"change with the girls in the change room\", until one day the other girls (portrayed in the act as three inquisitive detectives) force her to change with them, only to discover that her body was covered in birthmarks.\nThe final act tells of a boy that lives under the strict discipline of his austere parents and how his family attends a church, where church-goers shake and lurch during the services. During the verse, the \"boy\" nervously looks into the audience at a couple who seem uneasy with the subject, implying that the three are the family being sung about.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uppxpx1360402286.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=vIbcqgXh5-4", "strMusicVidDirector": "Dale Heslip", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "9017776", "intMusicVidLikes": "41833", "intMusicVidDislikes": "1115", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "3", "intLoved": "2", "intScore": "9.83333", "intScoreVotes": "6", "intTotalListeners": "381943", "intTotalPlays": "2034709", "strMusicBrainzID": "fe000493-3c96-413c-a6c7-d1add7dd8b8e", "strMusicBrainzAlbumID": "a91073c7-5e05-331a-8fc3-4107d79de398", "strMusicBrainzArtistID": "afb8f901-d846-4c70-a898-59bc183d1da7", "strLocked": "Unlocked"}]}