{"track": [{"idTrack": "32802625", "idAlbum": "2116674", "idArtist": "111289", "idLyric": "73694", "idIMVDB": "0", "strTrack": "Please Forgive Me", "strAlbum": "Anthology", "strArtist": "Bryan Adams", "strArtistAlternate": null, "intCD": "2", "intDuration": "355706", "strGenre": "Rock", "strMood": "Good Natured", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Please Forgive Me\" is a song by Canadian rock musician Bryan Adams. It was released in October 1993 as the only single and bonus track from his greatest hits compilation album So Far So Good. It is his only Australian number-one single not written for a motion picture. The single also reached number 7 on the U.S. Billboard Hot 100 and number 2 on the UK Singles Chart.\n\n\"Please Forgive Me\" is a slow power ballad written by Adams himself and Robert Lange. The song has an instrumental intro, which is only found on the album version of the song. Adams told Songfacts that it was one of the first songs that he agreed to use a modulation in. The single reached number two in the UK, number seven in the US and number one in Australia. The song was praised by critics upon its release, and has given Adams one of his best chart performances to date, his most highly successful being the 1991 international chart-topping hit \"(Everything I Do) I Do It For You\". The song helped So Far So Good reach no. 1 on the UK Albums Chart. The music video for this song also received a huge amount of TV airplay. The studio band, who also appear in the video which was filmed live during the tracking dates, included keyboard players David Paich and Robbie Buchanan, guitarist Shane Fontayne, bassist James \"Hutch\" Hutchinson, guitarist Keith Scott, drummer Mickey Curry and producer Mutt Lange.\n\nThe song was co-written and produced by Mutt Lange. It was a massive radio hit all over the world, and became an instant hit amongst Adams fans. The single has sold over 3 million copies worldwide.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=7x8wPt8xarE", "strMusicVidDirector": "Andrew Catlin", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "39227609", "intMusicVidLikes": "166905", "intMusicVidDislikes": "5126", "intMusicVidFavorites": "0", "intMusicVidComments": "6474", "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "234336", "intTotalPlays": "1080959", "strMusicBrainzID": "6a8d8c95-7c11-4ba0-90ff-e1cd72377bae", "strMusicBrainzAlbumID": "3a589572-250f-304a-80a7-033589cea456", "strMusicBrainzArtistID": "4dbf5678-7a31-406a-abbe-232f8ac2cd63", "strLocked": "Unlocked"}]}