{"track": [{"idTrack": "33393822", "idAlbum": "2164683", "idArtist": "114753", "idLyric": "525230", "idIMVDB": "2147483647", "strTrack": "Regulate", "strAlbum": "Regulate... G Funk Era", "strArtist": "Warren G", "strArtistAlternate": null, "intCD": null, "intDuration": "248693", "strGenre": "Hip-Hop", "strMood": "Confrontational", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Regulate\" is a song performed by Warren G and Nate Dogg. Released in the summer of 1994, the track appears on the soundtrack to the film Above the Rim and later Warren G.'s album Regulate...G Funk Era. The song reached #2 on the Billboard Hot 100 chart and #8 on the R&B/Hip-Hop chart. It is considered the breakout single for both artists.\n\nThe track makes heavy use of a four-bar sample of the rhythm of Michael McDonald's song \"I Keep Forgettin' (Every Time You're Near)\". It also samples \"Sign of the Times\" by Bob James and \"Let Me Ride\" by Dr. Dre. One mix of the song is referred to as \"I Keep Forgettin' to Regulate\".\n\nThe song also starts with a quote sampled from the film Young Guns. The music video featured scenes from Above the Rim, including an appearance by Tupac Shakur.\n\nIt was number 98 on VH1's 100 Greatest Songs of Hip Hop and number 108 on Pitchfork Media's Top 200 Tracks of the 90s.\n\nWarren G is driving alone through Eastside, Long Beach, California at night, looking for women. He finds a group of men playing dice and tries to join them, but they pull out their guns and rob him instead. Thinking he's about to die, Warren G sings out, \"if I had wings I would fly\"; one critic describes this moment as \"the hook\" of the song.\n\nMeanwhile, Nate Dogg is looking for Warren G. He passes a car full of women, who are so fixated on him that they crash their car. He finds Warren G and shoots at the robbers, dispersing them. The two friends then return to the women and ride away with them.\n\nIn the third verse, Warren and Nate explain their G-funk musical style; the song \"constructs itself as inaugurating a new era\".\n\n\"Regulate\" became Def Jam's biggest single.\n\nDuring much of the summer of 1994, the video stayed number one on the MTV charts. In the video as played on MTV, the lyrics are censored with the word \"cold\" being blanked from the line \"Nate Dogg is about to make some bodies turn cold\"; an action that Spin equated with racism because more explicit songs by white artists like Johnny Cash were not being censored. The video contained \"everyday footage\" from the film Above the Rim, as well as new footage, although guest vocalist Nate Dogg did not appear due to conflict between Suge Knight and Def Jam.\n\nThe lyrics have been described as \"a surreal pastiche of half-sung lyrics about fighting and fucking\". Craig Marks recommended \"Regulate\" for its \"lite rock synth lines and rippling bass\" but thought that Warren G's rapping abilities were \"average\".\n\nThe mockumentary series Yacht Rock featured Regulate in its episode #7, where Michael McDonald and Kenny Loggins make a bet about the popularity of the song, \"I Keep Forgettin' (Every Time You're Near)\". Ten years later, the Long Beach-based rappers accidentally hit McDonald with their car and kidnap him back to their house, where they sample McDonald's smooth keyboard groove.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xuvyux1484833340.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=1plPyJdXKIY", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/srwtyy1582027022.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/wsvurp1582027036.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/xspusu1582027044.jpg", "intMusicVidViews": "96657805", "intMusicVidLikes": "440392", "intMusicVidDislikes": "20302", "intMusicVidFavorites": "0", "intMusicVidComments": "28464", "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "472790", "intTotalPlays": "2048891", "strMusicBrainzID": "d439491d-8a6c-4aa5-ac29-937127059941", "strMusicBrainzAlbumID": "7d2ec03f-4abb-3fef-b7e5-465334a47b54", "strMusicBrainzArtistID": "85d7666c-d3ce-4e2c-8b1b-f20db7cdae4f", "strLocked": "Unlocked"}]}