{"track": [{"idTrack": "32826646", "idAlbum": "2118560", "idArtist": "111282", "idLyric": "71626", "idIMVDB": "2147483647", "strTrack": "Circus", "strAlbum": "Circus", "strArtist": "Britney Spears", "strArtistAlternate": "Britney", "intCD": null, "intDuration": "192360", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Circus\" is a song by American recording artist Britney Spears from her sixth studio album, Circus (2008). It was released on December 2, 2008, by Jive Records as the second single from the album. Written by Dr. Luke, Claude Kelly and Benny Blanco, \"Circus\" is a metaphor for the public's perception of Spears' life. After she listened to the track for the first time, she felt inspired to create an album and a tour with a circus theme. \"Circus\" is an uptempo dance-pop song with elements of pop rock and \"half-rapped\" vocals. The song's lyrics talk about being an entertainer and putting on shows.\n\n\"Circus\" was well received by contemporary critics, with reviewers complimenting Spears' confident persona, while praising its electronic production. \"Circus\" was a commercial success, peaking inside the top-ten in Australia, Canada, Denmark, New Zealand, and Sweden, while reaching top-twenty positions in many European countries. In the United States, \"Circus\" reached number three on the Billboard Hot 100 and number one on Pop Songs and is her second best-selling digital song in the country, having sold over 3 million copies. The track is among the best-selling singles of all time, having sold 5.5 million copies worldwide.\n\nThe music video, directed by Francis Lawrence, was released on December 4, 2008. It portrays Spears as the ringmaster of a circus accompanied by different performers, and it is interspersed with scenes of Spears in different circus settings. The video received positive reviews from critics, but was criticized by PETA for featuring \"cruelly trained animals\". However, the exhibitors denied these claims. Spears performed the song on Good Morning America on December 2, 2008. It was also the opening number of The Circus Starring Britney Spears (2009), where she was dressed in a ringleader outfit, designed to represent a metamorphosis.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wtqutv1359596132.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=lVhJ_A8XUgc", "strMusicVidDirector": "Francis Lawrence", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "102158626", "intMusicVidLikes": "141450", "intMusicVidDislikes": "5159", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "0", "intScore": "7.5", "intScoreVotes": "2", "intTotalListeners": "531967", "intTotalPlays": "5215035", "strMusicBrainzID": "2b9241b3-a7c4-4866-a15d-17344cf44541", "strMusicBrainzAlbumID": "1e5f92e0-913c-3202-a72c-b068b9f34ce1", "strMusicBrainzArtistID": "45a663b5-b1cb-4a91-bff6-2bef7bbfdd76", "strLocked": "Unlocked"}]}