{"track": [{"idTrack": "32986591", "idAlbum": "2131376", "idArtist": "114472", "idLyric": "0", "idIMVDB": null, "strTrack": "Down", "strAlbum": "All or Nothing", "strArtist": "Jay Sean", "strArtistAlternate": null, "intCD": null, "intDuration": "212000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Down\" is an R&B-electropop song by British artist Jay Sean. The song was released in North America as his debut single from his first album there, All or Nothing. In other markets, including the UK, the song serves as Jay Sean's lead single from his third studio album. The single features American rapper and label mate Lil Wayne and is produced by J remy and Bobby Bass. \"Down\" is the seventh-best selling single of 2009, having sold more than three million digital copies in the United States alone, and has been certified Platinum in several countries. The song went on to sell four million copies in the United States and six million copies worldwide, and also received a large airplay of two billion listener impressions on radio worldwide.\n\nThe track was released to US radio on 31 May 2009, and digital retailers on 30 June 2009. \"Down\" hit number one on the Billboard Hot 100 chart in the issue dated 17 October 2009, knocking The Black Eyed Peas off the top of the chart after their 26 week reign at number one. This made Jay Sean the first British act to score a Billboard Hot 100 number-one single since Coldplay's \"Viva la Vida\" in 2008, and the fourth British act overall this decade. The song has also made him \"the first UK Urban act ever to top Billboard's Hot 100\", the ninth (second British) male solo performer to top the US charts with his debut single in the US, and the first British act to have reached No. 1 in the US and not in the UK with a song since Seal's \"Kiss From a Rose\" in 1995. It is also the best-selling single by a British/European male artist in North America since Elton John's \"Candle in the Wind\" in 1997, and the first by a British Asian artist since Freddie Mercury in 1980.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vustvs1359311788.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=oUbpGmR1-QM", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "144972972", "intMusicVidLikes": "249605", "intMusicVidDislikes": "9078", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "1", "intScore": "9.6", "intScoreVotes": "5", "intTotalListeners": "322899", "intTotalPlays": "1649287", "strMusicBrainzID": "28b6402c-7fce-4861-bc37-81a6a9e1bdfb", "strMusicBrainzAlbumID": "6cf5cd4c-2992-4777-839c-3ffae45f46c8", "strMusicBrainzArtistID": "e03cf5b6-d2ec-4465-adee-226b518bcfcd", "strLocked": "Unlocked"}]}