{"track": [{"idTrack": "33517341", "idAlbum": "2174760", "idArtist": "111718", "idLyric": "0", "idIMVDB": "2147483647", "strTrack": "Forever", "strAlbum": "Heartbreak Drake", "strArtist": "Drake", "strArtistAlternate": null, "intCD": null, "intDuration": "0", "strGenre": "Hip-Hop", "strMood": "Passionate", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Forever\" is a single by rappers Drake, Kanye West, Lil Wayne, and Eminem. The song is released as a single from the soundtrack to LeBron James's More Than a Game documentary. The song was also placed on the re-release of Eminem's album Relapse, entitled Relapse: Refill. Eminem performed his verse of the song at the American Music Awards of 2009. Drake performed the song with Lil Wayne, Eminem, and Travis Barker at the 52nd Grammy Awards\n\nBackground\nThe track was produced by Boi-1da and originally used by Kardinal Offishall featuring Rock City in early 2008, as \"Bring It Back\". Kardinal did not use the song for his album and it was later re-sold to Drake, who released it in late 2008 as \"I Want This Forever\" featuring Lil Wayne and Nut da Kidd. In an interview, Kardinal stated that his version was a leaked demo which was supposed to appear on his album, Not 4 Sale, as well as a soundtrack. The 2009 version of \"Forever\" features Kanye West, Lil Wayne, and Eminem. Rapper Jay-Z called it the best posse cut of the year. The song title is derived from the last line of the chorus; I want this shit forever man.\n\nMusic video\nThe music video was shot in Fontainebleau Hotel in Miami, Florida in early September 2009. However, Eminem's part in the video was shot in Detroit due to scheduling conflicts and not being able to be in Miami. The music video was shot and directed by Hype Williams. It premiered on September 22, 2009 on BET's musical program 106 & Park. LeBron James appears in the opening of the music video in the back seat of a Maybach playing online poker on PokerStars on his customized Beats by Dr. Dre's laptop. Except for during dissolves, there is not a single frame in the video where more than one of the rappers is featured. Throughout the video, there are clips and pictures from the documentary about James, More Than a Game, and of him as a kid playing basketball. Also The Alchemist, Trick-Trick, Mr. Porter and Slaughterhouse all make cameo appearances in Eminem's verse of the video behind him as he raps his verse. Birdman makes a cameo appearances in the video on Lil Wayne's verse, sitting next to him in the VIP section of the club. The music video was produced alongside the video for \"Money to Blow\".\n\nCritical reception\nJason Thurston of Allmusic.com marked the song as one of the standout tracks of the album, writing: \"The record hits a high point early on the six-minute epic 'Forever,' a convention of rap's wordsmiths as Kanye West, Drake, Lil Wayne, and Eminem pass the baton over a dark, soulful, slightly mournful beat, separated by an echoing modern R&B Auto-Tune hook.\" Stephen Thomas Erlewine of Allmusic.com also highlighted the song, and commented: \" is none too coincidentally the one track in the entirety of Eminem's 2009 comeback that feels utterly modern.\" Entertainment Weekly was positive: \"Those who frequent hip-hop blogs will already be acquainted with the strongest material, like Drake's Forever — where the rookie teams with all-stars Lil Wayne, Kanye West, and Eminem\" and it was also on Download This list.\n\nChart performance\n\"Forever\" entered the U.S. Billboard Hot R&B/Hip-Hop Songs at number fifty-eight on September 3, 2009, peaking at #2. The song become the most downloaded song for the week ending September 15, 2009. On the week of September 24, the song debuted at #8 on the Billboard Hot 100, making it Drake's highest debut on the chart as well as his third top-ten single. it also topped the rap songs chart making it Drake's second number one on that chart. It was the tenth consecutive top 40 single for Eminem. The song has sold 3,265,000 digital copies in the US as of April 2013.\n\n\"Forever\" failed to enter the Top 40 on the UK Singles Chart, but did manage to peak at number 43 after strong downloads. The song then began to drop out of the UK Singles Chart, but on January 10, 2010, \"Forever\" climbed 7 places from number 49 to 42, marking its highest peak to date. 'Forever' has since become the highest selling single ever that has missed the top 40, with sales over 150,000. On February 7, 2010, \"Forever\" entered the Irish Singles Chart, reaching a current peak of number 41.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vtyrpv1533211100.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=eDuRoPIOBjE", "strMusicVidDirector": "Hype Williams", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "215226910", "intMusicVidLikes": "912191", "intMusicVidDislikes": "45792", "intMusicVidFavorites": "0", "intMusicVidComments": "148127", "intTrackNumber": "16", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "692945", "intTotalPlays": "1857692", "strMusicBrainzID": "3c66e72a-5e2b-441d-be6a-96cdca0e077d", "strMusicBrainzAlbumID": "55362bb1-468e-3da8-8ae9-b3d30fff670d", "strMusicBrainzArtistID": "9fff2f8a-21e6-47de-a2b8-7f449929d43f", "strLocked": "Unlocked"}]}