{"track": [{"idTrack": "32826650", "idAlbum": "2118560", "idArtist": "111282", "idLyric": "71628", "idIMVDB": null, "strTrack": "If U Seek Amy", "strAlbum": "Circus", "strArtist": "Britney Spears", "strArtistAlternate": "Britney", "intCD": null, "intDuration": "216520", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"If U Seek Amy\" is a song by American recording artist Britney Spears from her sixth studio album, Circus. It was released on March 13, 2009 by Jive Records as the third single of the album, and was chosen by a poll on Spears's official website. \"If U Seek Amy\" was co-written and produced by Max Martin, who also wrote previous hits for her first three albums and marked as Spears's comeback song to Martin since 2001. In the song, Spears is looking for a woman named Amy in a club, and although it appears to be about sex, it is actually about how society perceives her life. The song's title features a homophonic name that can be interpreted as \"F-U-C-K me\". Musically, \"If U Seek Amy\" is a pop song with influences of electropop and usage of instruments such as synthesizers and timpani.\n\n\"If U Seek Amy\" was generally well received by contemporary critics, who praised Spears's confident vocals and frequently cited it as the highlight of the album. After its release, \"If U Seek Amy\" caused controversy in English-speaking countries for the double entendre and lyrical content, with the Parents Television Council (PTC) threatening to file indecency complaints against any radio station that played the song during daytime. An edited version of the song titled \"If U See Amy\" was released in some regions, including in stations owned by Clear Channel Radio and Austereo Radio Network. \"If U Seek Amy\" was a moderate success, reaching the top twenty in Australia, the United States, Canada, Ireland, the United Kingdom and many other countries worldwide. It was also her third single from Circus to reach the top twenty in the United States.\n\nThe music video for \"If U Seek Amy\" begins with a parody of an America's Newsroom report by Megyn Kelly and portrays Spears at a sex party that takes place at her house. Towards the end, she changes into conservative housewife clothes and opens the front door with her family while paparazzi take pictures of them. It references some of her previous music videos such as \"...Baby One More Time\" and \"Piece of Me\". Critics noted the similarities with her past work and also compared it to the film Eyes Wide Shut. \"If U Seek Amy\" was performed at The Circus Starring Britney Spears (2009) and the Femme Fatale Tour (2011).", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xvuvpy1359595976.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=0aEnnH6t8Ts", "strMusicVidDirector": "Anthony Mandler", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "41569571", "intMusicVidLikes": "85823", "intMusicVidDislikes": "3060", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "6", "intLoved": "1", "intScore": "5", "intScoreVotes": "1", "intTotalListeners": "452652", "intTotalPlays": "4222222", "strMusicBrainzID": "258bc802-8111-4d16-b081-fae0ea6aecba", "strMusicBrainzAlbumID": "1e5f92e0-913c-3202-a72c-b068b9f34ce1", "strMusicBrainzArtistID": "45a663b5-b1cb-4a91-bff6-2bef7bbfdd76", "strLocked": "Unlocked"}]}