{"track": [{"idTrack": "32723961", "idAlbum": "2109595", "idArtist": "111236", "idLyric": "0", "idIMVDB": "0", "strTrack": "Just Dance", "strAlbum": "The Fame", "strArtist": "Lady Gaga", "strArtistAlternate": null, "intCD": null, "intDuration": "244000", "strGenre": "Pop", "strMood": "Quirky", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Just Dance\" is the debut single by American recording artist Lady Gaga. The song was produced by RedOne and co-written by RedOne, Gaga and Akon (who also provides additional vocals), while also featuring labelmate Colby O'Donis. It was released in 2008 as the lead single from Gaga's debut studio album The Fame. The song was written by Gaga in ten minutes as \"a happy record\". \"Just Dance\" also has influences of R&B and lyrically speaks about being intoxicated at a club.\n\nThe song has been critically appreciated, with reviewers complimenting its club anthem-like nature and the synthpop associated with it. The song has also achieved commercial success by topping charts in the United States, Australia, Canada, the Republic of Ireland, the Netherlands and the United Kingdom, as well as reaching the top ten in many other countries. In the United States, \"Just Dance\" was a sleeper hit, spending almost five months on the Billboard Hot 100 before finally reaching the summit of the chart in January 2009, after being released in April 2008. It scored the third-biggest single-week sum of all time selling 419,000 downloads in just one week and went to become the second best-selling digital song of all time in the U.S. The single is among the best-selling singles of all time, having sold over 7.7 million copies.\n\nThe music video of the song portrayed Lady Gaga appearing in a party where she plays the song, prompting party-goers to start dancing in enjoyment. Gaga compared her experience of shooting the video with being on a Martin Scorsese set. \"Just Dance\" was performed by Gaga in a number of live appearances including her first headlining The Fame Ball Tour and the second worldwide tour Monster Ball. In 2009, the song received a Grammy nomination in the Best Dance Recording category but lost to electronic duo Daft Punk for their song \"Harder, Better, Faster, Stronger (Alive 2007)\".", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rsswsq1359181766.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=2Abk1jAONjw", "strMusicVidDirector": "Melina Matsoukas", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/vqsurx1383999564.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/qvtxtv1383999573.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/xxtpyt1383999583.jpg", "intMusicVidViews": "242747762", "intMusicVidLikes": "554773", "intMusicVidDislikes": "25239", "intMusicVidFavorites": "0", "intMusicVidComments": "52714", "intTrackNumber": "1", "intLoved": "0", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "1055627", "intTotalPlays": "8804545", "strMusicBrainzID": "0810268f-2e52-4f89-86be-42762ea3f6d4", "strMusicBrainzAlbumID": "e5495719-b3ad-3eea-a533-fb70af43c23d", "strMusicBrainzArtistID": "650e7db6-b795-4eb5-a702-5ea2fc46c848", "strLocked": "Unlocked"}]}