{"track": [{"idTrack": "32801261", "idAlbum": "2116560", "idArtist": "111352", "idLyric": "485085", "idIMVDB": null, "strTrack": "Love Story", "strAlbum": "Fearless", "strArtist": "Taylor Swift", "strArtistAlternate": null, "intCD": null, "intDuration": "236000", "strGenre": "Country", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Love Story\" is a country pop song performed by American singer-songwriter Taylor Swift. The song was written by Swift and produced by Nathan Chapman, alongside Swift. It was released on September 12, 2008 by Big Machine Records, as the lead single from Swift's second studio album Fearless. The song was written about a love interest of Swift's who was not popular among Swift's family and friends. Because of the scenario, Swift related to the plot of William Shakespeare's Romeo and Juliet (1597) and used it as a source of inspiration to compose the song. However, she replaced Romeo and Juliet's original tragic conclusion with a happy ending. It is a midtempo song with a dreamy tenor, while the melody continually builds up. The lyrics are from the perspective of Juliet.\n\nThe song was a critical success with critics complimenting Swift's writing style and the song's plot. It was also a commercial success, selling over 7.8 million copies worldwide, therefore establishing itself among the best-selling singles of all time. In the United States, the song peaked at number four on the Billboard Hot 100 and sold over 5,387,000 paid digital downloads, becoming Swift's best-selling single to date and the best-selling download by a female country solo artist. It was also deemed one of the best-selling singles in the United States and was once the best-selling country single of all time. The single was certified quintuple platinum by the Recording Industry Association of America (RIAA). Internationally, \"Love Story\" became Swift's first number one single in Australia, followed by \"We Are Never Ever Getting Back Together\" in 2012. The song has been certified triple platinum by the Australian Recording Industry Association (ARIA).\n\nThe song's accompanying music video was directed by Trey Fanjoy, who directed the majority of Swift's prior videos. The video is a period piece that drew influences from the Medieval, Renaissance, and British Regency (1813) eras. It follows Swift and model Justin Gaston as they meet in a university campus and imagine themselves in a prior era. \"Love Story\" was promoted through numerous live performances. The song was included on Swift's first and second headlining tours, the Fearless Tour (2009–10) and the Speak Now World Tour (2011–12), respectively; the song was used as the final performance on the latter. \"Love Story\" has been covered by several artists, including Joe McElderry and Forever the Sickest Kids.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wwtytu1359417688.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=8xg3vE8Ie_E", "strMusicVidDirector": "Trey Fanjoy", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "188178147", "intMusicVidLikes": "546044", "intMusicVidDislikes": "20238", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "3", "intLoved": "6", "intScore": "9.16667", "intScoreVotes": "6", "intTotalListeners": "642132", "intTotalPlays": "5702009", "strMusicBrainzID": "9086b742-358b-4f73-9a14-84cb1a9ce4ce", "strMusicBrainzAlbumID": "63eba062-847c-3b73-8b0f-6baf27bba6fa", "strMusicBrainzArtistID": "20244d07-534f-4eff-b4d4-930878889970", "strLocked": "Unlocked"}]}