{"track": [{"idTrack": "32780567", "idAlbum": "2114810", "idArtist": "111828", "idLyric": "271709", "idIMVDB": null, "strTrack": "My Life Would Suck Without You", "strAlbum": "All I Ever Wanted", "strArtist": "Kelly Clarkson", "strArtistAlternate": null, "intCD": null, "intDuration": "212000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"My Life Would Suck Without You\" is a song performed by American recording artist Kelly Clarkson from her fourth studio album, All I Ever Wanted (2009). The song features songwriting credits from Max Martin, Lukasz Gottwald, and Claude Kelly and production credits from Martin and Gottwald under his production moniker, Dr. Luke. \"My life Would Suck Without You\" was released as the lead single from the album and premiered on January 13, 2009, in the United States on the Z100 radio station and was made available to download three days later. The song has met with positive reviews from music critics, who praised the song's composition, which incorporates rock and dance music.\n\nThe song reached number one in its second week on the Billboard Hot 100 when it moved up the chart 96 places from number 97. The song's chart climbing gave Clarkson the record for a solo artist to have a single have the furthest jump on the Billboard Hot 100 after achieving the feat with her 2002 single \"A Moment Like This\". The song has also peaked at number 16 on US Adult Contemporary chart. Elsewhere, \"My Life Would Suck Without You\" peaked at number one in Canada, Hungary and the United Kingdom, and has attained top-five positions in Australia, Ireland, the Netherlands, Belgium, Sweden and Switzerland. The song is also her first number-one in the United Kingdom, giving her the distinction as the only American Idol contestant to have a song reach number one there.\n\nThe accompanying music video was directed by Wayne Isham and presents Clarkson's relationship with her fictional boyfriend as being fluctuating and tumultuous as the two are depicted arguing and throwing out each other's belongings whilst mirroring the sentiments of the song and the positive influence each has on the other. The video was nominated for an MTV Video Music Award in the Best Female Video category in 2009.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qqusus1383081171.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=cRM70Jw7F4M", "strMusicVidDirector": "Wayne Isham ", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "42649609", "intMusicVidLikes": "105488", "intMusicVidDislikes": "1542", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "447134", "intTotalPlays": "3306481", "strMusicBrainzID": "83267cbd-e245-4ccd-b981-45eac5f197a2", "strMusicBrainzAlbumID": "50e5e68b-626a-3bde-904d-5649163ebecd", "strMusicBrainzArtistID": "d339efbb-77b9-4147-ba9e-59f2f24550b2", "strLocked": "Unlocked"}]}