{"track": [{"idTrack": "32723963", "idAlbum": "2109595", "idArtist": "111236", "idLyric": "286365", "idIMVDB": null, "strTrack": "Paparazzi", "strAlbum": "The Fame", "strArtist": "Lady Gaga", "strArtistAlternate": null, "intCD": null, "intDuration": "210000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Paparazzi\" is a song by American recording artist Lady Gaga. It was released as the final single from her debut album The Fame (2008). Written by Rob Fusari and Gaga, the song portrays Gaga's struggles in her quest for fame, as well as balancing success and love. Musically, it is an up-tempo dance song whose lyrics describe a stalker following somebody to grab attention and fame.\n\nIt was the album's third single in Ireland, Italy and the United Kingdom, the fourth in Canada and the United States and the fifth in Australia, France and New Zealand. Although released on July 6, 2009, in the United Kingdom and four days later in Australia, \"LoveGame\" initially had been planned as the third single release in the United Kingdom but deeming its lyrics and music video potentially controversial, it was decided that \"Paparazzi\" would be released instead. \"Paparazzi\" was critically acclaimed for its fun-filled, club-friendly nature while and also became commercially successful when it reached top-ten positions in the music charts of Australia, Canada, Ireland, the United Kingdom and the United States while reaching number one in the Czech Republic and Germany.\n\nThe accompanying music video portrays Gaga as a doomed starlet, hounded by photographers, who is almost killed by her boyfriend. It shows her survival, comeback, revenge on her boyfriend, and experiences on the way to fame. The video won two MTV Video Music Awards in 2009 for Best Art Direction and Best Special Effects. Gaga also performed the song at the 2009 MTV Video Music Awards in a performance art piece symbolizing the negative effect of fame leading to death. Additional live performances of the song include on The Fame Ball Tour, where it was the opening song, on an October 2009 episode of Saturday Night Live and on The Monster Ball Tour. On the first leg of the tour, she appeared as a Rapunzel-like character; from the second leg onwards, she performed the song alongside a giant anglerfish (\"The Fame Monster\") who, attempting to devour her, was killed after her leotard shot sparks into the creature.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qusqqx1359181858.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=d2smz_1L2_0", "strMusicVidDirector": "Jonas Akerlund", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/wwuqyr1384000637.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/ruysuv1384000644.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/tpxqvv1384000653.jpg", "intMusicVidViews": "121354128", "intMusicVidLikes": "255948", "intMusicVidDislikes": "26875", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "3", "intLoved": "0", "intScore": "9.16667", "intScoreVotes": "6", "intTotalListeners": "1088486", "intTotalPlays": "9640992", "strMusicBrainzID": "7a1040dc-bac0-479c-9921-f43797ed0b81", "strMusicBrainzAlbumID": "e5495719-b3ad-3eea-a533-fb70af43c23d", "strMusicBrainzArtistID": "650e7db6-b795-4eb5-a702-5ea2fc46c848", "strLocked": "Unlocked"}]}