{"track": [{"idTrack": "34789339", "idAlbum": "2279375", "idArtist": "114357", "idLyric": null, "idIMVDB": "2147483647", "strTrack": "HUMBLE.", "strAlbum": "DAMN.", "strArtist": "Kendrick Lamar", "strArtistAlternate": null, "intCD": null, "intDuration": "177000", "strGenre": "Hip-Hop", "strMood": "Gritty", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Humble\" (stylized as \"HUMBLE.\") is a song by American rapper Kendrick Lamar. It was released on March 30, 2017, by Top Dawg Entertainment, Aftermath Entertainment and Interscope Records. The song, produced by Mike Will Made It., was serviced to rhythmic contemporary radio as the lead single from Lamar's fourth studio album, Damn, released on April 14, 2017. The single debuted at number two on the US Billboard Hot 100.\n\nThe song's accompanying music video was released on March 30, 2017 on Kendrick Lamar's Vevo account. The video was directed by Dave Meyers and The Little Homies. The video starts with Lamar dressed like the pope in a cope, the scene then shows Lamar in all black lying on a table of money, \"ignorantly\" shooting loads of bills from a cash cannon. It also features a reenactment of Leonardo da Vinci's 15th-century painting, the Last Supper. Lamar sits in Jesus' chair as his disciples \"unappreciatively\" gorge on wine and bread. He is also seen teeing off on top of a car, passing mustard between cars mimicking a Grey Poupon commercial and at one point the top of his head is in flames. Fellow TDE rapper Jay Rock and producer Sounwave appear in the video alongside other TDE members.\n\nReviewing it, Billboard editor Brad Wete thought it \"is a poignant exercise in irony and is also filled with messaging that could be perceived as anti-conformist.\" He concluded saying \"His raps are filterless; he tells it like it is. So it’s no surprise that this dynamic video is essentially what Lamar is as an artist: balanced with a clear message.\" Althea Legaspi of Rolling Stone described it as \"richly symbolic.\" For Harriet Gibson of The Guardian, \"the brilliantly cinematic video, with its fish-eye lens and cartoonish stylising, recalls classic Hype Williams, and leads the viewer through these passages of assignation, fleshing out Lamar’s ideas.\" Matt Miller of Esquire opined about the rapper's videography, \"in recent years, Kendrick Lamar has revived the music video as a powerful form of social commentary.\"", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rywqrr1492897857.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=tvTRZJ-4EyI", "strMusicVidDirector": "Dave Meyers", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "97046227", "intMusicVidLikes": "1374679", "intMusicVidDislikes": "74681", "intMusicVidFavorites": "0", "intMusicVidComments": "96316", "intTrackNumber": "8", "intLoved": "0", "intScore": "9.8", "intScoreVotes": "5", "intTotalListeners": "434002", "intTotalPlays": "4789080", "strMusicBrainzID": "398bf241-7d57-4993-860b-1f9ef496c97f", "strMusicBrainzAlbumID": "fb1deaa0-9ba8-442a-ba19-bb7818eb8aaa", "strMusicBrainzArtistID": "381086ea-f511-4aba-bdf9-71c753dc5077", "strLocked": "Unlocked"}]}