{"track": [{"idTrack": "32776996", "idAlbum": "2114549", "idArtist": "111758", "idLyric": "482110", "idIMVDB": null, "strTrack": "Back for Good", "strAlbum": "Nobody Else", "strArtist": "Take That", "strArtistAlternate": null, "intCD": null, "intDuration": "243733", "strGenre": "Pop", "strMood": "Good Natured", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Back for Good\" is a song by British band Take That from their third studio album, Nobody Else (1995). It was written by lead singer Gary Barlow, who also co-produced it with Chris Porter. The song topped the UK Singles Chart whilst also charting at number one in 31 countries, as well as reaching the top 10 in many others (including the United States, making it their only hit in that country). At the 1996 Brit Awards, \"Back for Good\" won the Brit Award for British Single of the Year. In 2003, Q Magazine ranked the song at number 910 in their list of the \"1001 Best Songs Ever\" and in a UK poll in 2012, it was voted number 11 on the ITV special The Nation's Favourite Number One Single.\n\nThe accompanying music video to the song was shot in black and white on 27 February 1995 and directed by Vaughan Arnell and Anthea Benton. It shows the band walking and dancing in the rain as well as the band performing the song in a shelter. Most of the external footage was shot at the backlot of Pinewood Studios. It was also the last music video to feature Robbie Williams in the present day until he rejoined the band in 2010. A 1958 Chevrolet Impala and a 1951 Mercury Custom, both customised in the styles of the 1950s/early 1960s feature in the video. Due to spending so long in cold and wet conditions, several of the band became ill afterwards with flu.\n\nThe video has often been an influence in the band performing the song live as they often make use of artificial rain when performing it. It also appears on the DVD release, Never Forget: The Ultimate Collection and was published on Take That's official YouTube channel in October 2009. The video has amassed more than 73 million views as of September 2021.\n\nThe music video was also paid homage to by The Wanted in the music video to \"Walks Like Rihanna\". The video was based on three classic boy band singles and their videos, with \"Back for Good\" being one of them. New Kids on the Block also paid homage to both Take That and this music video in their video to single, Boys in the Band (Boy Band Anthem).", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qpxwst1363524175.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=N2ICtCO8TCw", "strMusicVidDirector": "Vaughan Arnell", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "88342290", "intMusicVidLikes": "562332", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "21621", "intTrackNumber": "2", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "147786", "intTotalPlays": "716151", "strMusicBrainzID": "e346a999-7834-4f14-a513-65a1dc2bf797", "strMusicBrainzAlbumID": "6fda0d8e-3e76-3b99-a119-c3876189cca8", "strMusicBrainzArtistID": "24d2505b-388c-46cc-8a64-48223ea6d78d", "strLocked": "Unlocked"}]}