{"track": [{"idTrack": "32796298", "idAlbum": "2116123", "idArtist": "112064", "idLyric": "439307", "idIMVDB": "0", "strTrack": "Kiss From a Rose", "strAlbum": "Seal II", "strArtist": "Seal", "strArtistAlternate": null, "intCD": null, "intDuration": "287973", "strGenre": "Soul", "strMood": "...", "strStyle": "Urban/R&B", "strTheme": null, "strDescriptionEN": "\"Kiss from a Rose\" is a song from Seal's second eponymous album. The song was first released as a single in July 1994. Re-released in 1995, it was included on the Batman Forever film soundtrack, helping it top the charts in the U.S. and Australia. At the 1996 Grammy Awards, it won awards for Record of the Year, Song of the Year, and Best Male Pop Vocal Performance.\n\n\"Kiss from a Rose\" was written in 1987, several years prior to the release of Seal's eponymous debut album from 1991. After writing the song Seal felt \"embarrassed by it\" and \"threw the tape in the corner\". Seal did not present it to producer Trevor Horn until the recording sessions for Seal II. In 2015, Seal said of the song: \"To be honest, I was never really that proud of it, though I like what Trevor did with the recording. He turned that tape from my corner into another 8 million record sales and my name became a household name.\"\n\n\"Kiss from a Rose\" was the second single taken from the Batman Forever film soundtrack, and topped the U.S. Billboard Hot 100 for one week in August 1995. It also went to number four on the UK Singles Chart. The single originally made it to #20 in 1994, but upon being re-released after being featured in the film, it reached the top position. It also won the MTV Movie Award for Best Song from a Movie in the 1996 edition. Seal talked about the long, strange journey that the song went through on The Brian McKnight Show season finale that aired 30 May 2010. He described how the song initially dropped out of the charts shortly after its release. Joel Schumacher subsequently called Seal, and requested use of the song to play over a love scene between the characters played by Nicole Kidman and Val Kilmer in Batman Forever. Although the song was eventually not incorporated into this scene, it was instead used to play over the end credits; Seal believes this change contributed to the song's eventual popularity.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=yivLt9cTaio", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "1505416", "intMusicVidLikes": "7891", "intMusicVidDislikes": "127", "intMusicVidFavorites": "0", "intMusicVidComments": "1029", "intTrackNumber": "6", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "560366", "intTotalPlays": "3070105", "strMusicBrainzID": "246eb953-0e29-4e09-b1c0-eb695593f0ac", "strMusicBrainzAlbumID": "3bb226b7-db0b-3288-bea4-e2fecbe20c20", "strMusicBrainzArtistID": "f053ae01-dae6-4aae-9883-e8c279fdbef4", "strLocked": "Unlocked"}]}