{"track": [{"idTrack": "32978191", "idAlbum": "2130737", "idArtist": "114353", "idLyric": "496878", "idIMVDB": null, "strTrack": "Waterfalls", "strAlbum": "CrazySexyCool", "strArtist": "TLC", "strArtistAlternate": null, "intCD": null, "intDuration": "279506", "strGenre": "R&B", "strMood": "...", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Waterfalls\" is a song by American hip hop group TLC. It was written by Marqueze Etheridge and Organized Noize along with a verse written by group member Lisa \"Left Eye\" Lopes for TLC's second album, CrazySexyCool (1994), with production also by Organized Noize. The song was released as the third single from the album on May 29, 1995, in the United States, followed by a United Kingdom release on August 5, 1995.\n\nOften considered the group's signature song, \"Waterfalls\" was an international hit, topping the charts in many different territories. The song spent seven weeks at No. 1 on the Billboard Hot 100, giving the group their second US No. 1. The song was the No. 2 song of the year on the Billboard 1995 year-end chart. \"Waterfalls\" also peaked at No. 1 in New Zealand and Switzerland while reaching the top ten in many other countries. \"Waterfalls\" received critical acclaim, earning two Grammy nominations at the 38th Annual Grammy Awards in 1996 for Record of the Year and Best Pop Performance by a Duo or Group with Vocal.\n\nThe song tackled issues of the illegal drug trade, promiscuity and HIV/AIDS. Jarett E. Nolan of BMG noted that \"Waterfalls\" was the first number one song ever to refer to AIDS in one of its verses. The accompanying music video for the song reflected its socially conscious lyrics. With a million-dollar budget, the video was an MTV staple credited for giving the single much of its success. It stayed atop the MTV Video Monitor chart for over a month, making TLC the first act to ever achieve this feat. The video won four MTV Video Music Awards in 1995, including top honors for Video of the Year. TLC was the first African-American act to ever receive the trophy.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/8oljcm1616243706.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=8WEtxJ4-sh4", "strMusicVidDirector": "F. Gary Gray", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "123262887", "intMusicVidLikes": "680428", "intMusicVidDislikes": "27681", "intMusicVidFavorites": "0", "intMusicVidComments": "30304", "intTrackNumber": "8", "intLoved": "1", "intScore": "9.83333", "intScoreVotes": "6", "intTotalListeners": "513062", "intTotalPlays": "1961969", "strMusicBrainzID": "3335a649-26c9-42f6-8dde-62c58c5232e2", "strMusicBrainzAlbumID": "3d886c06-a4c7-3431-be87-2b2940f07acd", "strMusicBrainzArtistID": "99790314-885a-4975-8614-9c5bc890364d", "strLocked": "Unlocked"}]}