{"track": [{"idTrack": "33899812", "idAlbum": "2205903", "idArtist": "111239", "idLyric": "0", "idIMVDB": "0", "strTrack": "A Sky Full of Stars", "strAlbum": "Ghost Stories", "strArtist": "Coldplay", "strArtistAlternate": null, "intCD": null, "intDuration": "0", "strGenre": "Pop-Rock", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"A Sky Full of Stars\" is a song recorded by British alternative rock band Coldplay, released on 2 May 2014 as the second single from their sixth studio album, Ghost Stories (2014). The band co-wrote and co-produced the song with Swedish DJ Avicii, with production assistance from Paul Epworth, Daniel Green, and Rik Simpson. It was recorded at The Bakery and The Beehive in North London, England.\n\nUpon its release, \"A Sky Full of Stars\" garnered mostly positive reviews from music critics and have charted inside the top 10 in over 16 countries such as Australia, Canada, Europe, Japan, Mexico, the United Kingdom and United States. A music video for the song was directed by Mat Whitecross and was released on 19 June 2014. The song is used as the theme song for Godzilla.\n\"A Sky Full of Stars\" marks the band's first dance track, being outlined as an EDM track with house influences. A piano-centric song which is written in the key of E♭ minor, the track opens as a piano ballad, with progressive house-influenced electronic music that plays out in between verses. According to the sheet music published at Musicnotes.com, the song follows a chord progression of E♭m7–C♭maj9–G♭–B♭m(♭6) with a tempo of 125 beats per minute, and the vocals span from A♭4 to G♭6. The track has been described as \" in line with the synth-heavy soundscapes of 'Midnight', but with more danceable flavor\".\n\"A Sky Full of Stars\" was recorded during the sessions for the band's sixth studio album, at their purpose-built studios The Bakery and The Beehive in North London, England. The studios were both originally constructed for work on their two previous studio albums, 2008's Viva la Vida or Death and All His Friends and 2011's Mylo Xyloto.\n\nSwedish record producer Avicii was invited by the band to collaborate on \"A Sky Full of Stars\". In addition to producing the track, he was also asked by lead singer Chris Martin to play and record the piano parts. However, Martin later stated in a BBC Radio 1 interview with Zane Lowe that he felt that he had \"cheated\" on the band by asking Avicii to play the piano instead of him.\nThe single art for \"A Sky Full of Stars\" was etched by UK-based, Czech etching artist Mila Fürstová. The artwork continues the motif of artworks in the Ghost Stories album cycle, which feature a scene occurring in a larger, enclosed body. Multiple figures such as angels with wings like of the Ghost Stories artwork, buildings such as a church, and objects such as a maze and a chair, also alluding to those in the Ghost Stories artwork, are depicted encased in a three-dimensional star chart. The artwork is reminiscent of Fürstová's earlier work, Other Skies, which also features various figures, buildings and objects imposed onto a star map.\nThe official music video was directed by Mat Whitecross and the shooting took place on King Street in Newtown, a suburb of Sydney, on 17 June 2014. It was released on 19 June. At the beginning of the video, Coldplay's lead singer, Chris Martin, walks through Sydney's streets dressed as a one-man band, singing the first verse of the song. Then he reaches the other members of the band (also dressed as one-man bands) and, together, they play the instrumental refrain. Martin is then seen walking through the street, without the other members, while he sings the second verse. At the end of the video the band reunites in a square, singing and playing the final part of the song with a crowd of fans. While Martin is singing the final part, many paper-made stars are blown into the square.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/ypvruy1414417701.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=VPRjCeoBqrI", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "55649298", "intMusicVidLikes": "368388", "intMusicVidDislikes": "7788", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "8", "intLoved": "0", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "c12bd871-5ae2-449a-918b-1fdffda3b6c8", "strMusicBrainzAlbumID": "9c5aa9d2-068b-4626-b352-ae6f4f4e0b15", "strMusicBrainzArtistID": "cc197bad-dc9c-440d-a5b5-d52ba2e14234", "strLocked": "Unlocked"}]}