{"track": [{"idTrack": "33558520", "idAlbum": "2178120", "idArtist": "114290", "idLyric": "0", "idIMVDB": "0", "strTrack": "All of Me", "strAlbum": "Love in the Future", "strArtist": "John Legend", "strArtistAlternate": null, "intCD": null, "intDuration": "269557", "strGenre": "R&B", "strMood": "Smooth", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"All of Me\" is a hit song by American singer John Legend from his fourth studio album Love in the Future (2013). It is dedicated to Legend's wife Chrissy Teigen. \"All of Me\" first aired on American mainstream urban radio as the album's third single on August 12, 2013.\n\nOn the week ending May 16, 2014, it peaked at number one on the Billboard Hot 100 becoming his first number-one single in the United States. It knocked off \"Happy\" by Pharrell Williams, which had spent 10 weeks at number one. The song peaked at number two in the United Kingdom, South Africa and New Zealand and topped the charts in Australia, Canada, Ireland, Portugal, Sweden, Switzerland and the Netherlands. It became the second best-selling song of 2014 in the United States with 4.67 million copies sold for the year, as well as the third best-selling song in the United Kingdom. \"All of Me\" was the third best-selling song of 2014 with 12.3 million equivalent-units worldwide (sales plus streaming), according to the IFPI.\n\nA remix of the song (Tiësto's Birthday Treatment remix), featuring EDM artist Tiësto, was released in January 2014 and won the 2015 Grammy Award for Best Remixed Recording, Non-Classical, while another remix was done in March of that year by trance artist Dash Berlin. A live version of the song was nominated for Best Pop Solo Performance, losing to Williams' \"Happy\".\n\nBackground and composition\n\"All of Me\" is a tender piano ballad, which was inspired by his then-fiancée, now wife, model Chrissy Teigen. The couple met in 2007 on the set of his video for \"Stereo\". They were then married on September 14, 2013. The song was produced by Dave Tozer and Legend himself. It is a simple, modest proposal set against delicate keys.\n\nMusically, according to the sheet music published at Musicnotes.com by Gad Songs and John Legend Publishing, \"All of Me\" is written in the key of A♭ major with a slow tempo of 63 beats per minute. Legend's vocals span from F3 to B♭4.\n\nRelease and promotion\nIn June 2013, Legend premiered \"All of Me\" during a performance on Oprah Winfrey's Oprah's Next Chapter. On August 6, 2013, the full song was premiered as it was released to iTunes along with the pre-order for Love in the Future. \"All of Me\" impacted American mainstream urban radio as the third single from Love in the Future on August 12, 2013.\n\nDutch electronic producer Tiësto released a remix of the song in January 2014. A country-influenced duet version of \"All of Me\" with Jennifer Nettles, featuring Hunter Hayes on guitar, was released in June 2014.\n\nCommercial performance\nAfter being stationary at number two for six weeks, \"All of Me\" finally reached number one on the US Billboard Hot 100 on the chart dated May 17, 2014. This was Legend's first Hot 100 number one single, almost 10 years since his first appearance on the chart. That was the longest wait for an artist's first number-one song from their first chart appearance since Snoop Dogg waited 10 years and 10 months for his. \"All of Me\" became the second best-selling song of 2014 in the United States with 4.67 million copies sold for the year. The song spent three weeks at number one before being dethroned by Iggy Azalea's \"Fancy\" featuring Charli XCX. Additionally, \"All of Me\" spent 23 consecutive weeks in the Billboard Hot 100's top 10 and spent an overall 59 non-consecutive weeks on the Billboard Hot 100 chart. As of April 2016, \"All of Me\" has sold 5,878,000 copies cumulatively in the United States.\n\nIn the United Kingdom, \"All of Me\" peaked at number two on the UK Singles Chart, and it became the third best-selling song of 2014 in the UK. As of February 2016, the song has sold 1.18 million copies in the UK.\n\nCritical reception\n\"All of Me\" was met with generally positive reviews from music critics. Ken Capobianco of The Boston Globe named the song the album's \"essential track\". Ryan Patrick of Exclaim! said the song, shows \"Legend's current commercially friendly, sentimental sound.\" Jon Dolan of Rolling Stone called the song a \"mountainous piano crusher\". Julia Leconte of NOW stated that Legend's voice shines in the song. Molloy Woodcraft of The Guardian also praised Legend's vocal talents on the song. A live rendition of the song was nominated for Grammy Award for Best Pop Solo Performance at the 57th Annual Grammy Awards.\n\nLive performances\nOn August 20, 2013, Legend performed the song live on the Late Show with David Letterman. On August 27, 2013, Legend performed the song at The Box in New York City. On September 2, 2013, Legend performed the song on Jimmy Kimmel Live! along with the album's second single \"Made to Love\". On October 10, 2013, Legend performed the song during his appearance on The Wendy Williams Show. The song was performed by Legend at the 56th Grammy Awards on January 26, 2014.\n\nThe song was also performed as a duet with Taylor Swift during her 1989 World Tour.\n\nMusic video\nThe song's music video was shot in Italy just days before Legend's wedding, featuring his fiancée, model Chrissy Teigen. The video ends with footage from their actual wedding in Lake Como, Italy. On September 12, 2013, the first image from the music video was released. On October 2, 2013, the full version of the Nabil Elderkin-directed black and white music video for \"All of Me\" was released. The video was meant to bring the relationship full circle, as he chose the man who originally introduced them to each other, Elderkin, to direct it.\n\nA duet version of the song with accompanying music video was filmed with violinist Lindsey Stirling and released on YouTube on October 26, 2013.\n\nIn November 2015, the YouTube video's title mysteriously changed from 'All of Me' to 'One Last Time' and then changed back. The same happened on Spotify and Google Play. There has been no explanation for this incident.\n\nAs of January 2020, the music video has received over 1.6 billion views and 8.3 million likes on YouTube.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/swustt1414415054.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "www.youtube.com/watch?v=450p7goxZqg", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "1619807396", "intMusicVidLikes": "8429497", "intMusicVidDislikes": "269281", "intMusicVidFavorites": "0", "intMusicVidComments": "194821", "intTrackNumber": "6", "intLoved": "1", "intScore": "9.83333", "intScoreVotes": "6", "intTotalListeners": "542912", "intTotalPlays": "4422059", "strMusicBrainzID": "d5548b1d-63db-4aa7-b3d5-3f864f248eee", "strMusicBrainzAlbumID": "56c54ef0-e424-452e-9094-13c7ca755f7b", "strMusicBrainzArtistID": "75a72702-a5ef-4513-bca5-c5b944903546", "strLocked": "Unlocked"}]}