{"track": [{"idTrack": "33840420", "idAlbum": "2200896", "idArtist": "125422", "idLyric": "0", "idIMVDB": "2147483647", "strTrack": "Black Widow", "strAlbum": "The New Classic", "strArtist": "Iggy Azalea", "strArtistAlternate": null, "intCD": null, "intDuration": "209000", "strGenre": "Electronic", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Black Widow\" is a song by Australian rapper Iggy Azalea, from her debut studio album The New Classic (2014). The song's hook is sung by British recording artist Rita Ora, and its lyrics chronicle subjects of revenge and feminism in a failed romantic relationship.\n\nMusic video:\n\nThe video starts with Rita Ora and her boyfriend, played by Michael Madsen, entering a diner. The man walks over a black widow spider, just before Iggy Azalea is shown as a waitress named Fox behind the diner counter. Azalea then approaches the couple and hands them the menu. The man orders a BLT sandwich \"dripping with melted cheese\" and just when Ora is about to order he interrupts her by saying \"she's gonna have the same damn thing\" causing Ora to look at him somewhat upset. As Azalea arrives with the order, the man starts complaining about the sandwich and refuses to eat it. Then, the owner of the diner, Big Wanda, jumps over the counter and asks if there is a problem. After hearing the man's complaint, Azalea tries to explain but to no avail when the owner says \"What did the Fox say? Nothing!\" and she is told to make another sandwich with more cheese. Ora is shocked when the owner begins to flirt with her boyfriend in front of her, and her boyfriend ignores her because the owner promises him a \"big, juicy BLT sandwich\" that is the menu's special. When Ora tries to speak up, she is verbally put down by the owner, who says her special order is \"nothing like the little sandwich\" Ora has. Ora continues to show disapproval towards the situation.\n\nThe song starts just when Azalea starts chopping the lettuce. Azalea's dream starts, in which she can be seen with Ora in a snowy scene, both dressed in similar jumpsuits with a \"Black Widow\" on each of their backs. When the scene changes, Azalea is training with an older Japanese man, followed by her intercepting a poison dart. She opens the dart to find an image of Madsen with the word \"Destroy\" written on it. Meanwhile Ora is playing poker in an underground casino alongside Paul Sorvino and rapper T.I. and wins a large amount of money. Following this Sorvino becomes upset and aggressive, and Ora kicks him to the ground. As Sorvino lies motionless on the ground, Ora receives a Wickr message with the image of her next target - Madsen. She and Azalea both ride motorcycles to Madsen's club. Azalea unsheathes her katana and strides towards Madsen as the terrified club patrons flee. Madsen summons his guards to attack Azalea but Ora arrives as her backup, and the pair defeat the guards. They then confront Madsen who draws a gun on them, but before he can shoot them he is bitten by a black widow spider and dies.\n\nThe scene snaps back to reality, revealing all the previous events were a dream sequence of Azalea's, who is actually still chopping lettuce with the owner of the diner screaming at her.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=vJDZzxuokQ4", "strMusicVidDirector": "Director X", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "2972672", "intMusicVidLikes": "13355", "intMusicVidDislikes": "672", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "10", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "273578", "intTotalPlays": "1895115", "strMusicBrainzID": "63b17be0-6cd2-4a3c-9609-860d44896c4b", "strMusicBrainzAlbumID": "8fc57341-635e-4638-a1d6-0c7094eaa9ca", "strMusicBrainzArtistID": "3a052c99-8c18-484a-8beb-9873b4fb3106", "strLocked": "Unlocked"}]}