{"track": [{"idTrack": "33583882", "idAlbum": "2241680", "idArtist": "111827", "idLyric": "0", "idIMVDB": "0", "strTrack": "Dark Horse", "strAlbum": "Prism", "strArtist": "Katy Perry", "strArtistAlternate": "Katy Hudson", "intCD": null, "intDuration": "297000", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Rock/Pop", "strTheme": "Party", "strDescriptionEN": "\"Dark Horse\" is a song recorded by American recording artist Katy Perry featuring rapper Juicy J. It was released on September 17, 2013 by Capitol Records as the first promotional single from Perry's fourth studio album, Prism (2013), following the lead single \"Roar\". Three months later, it was released as the third official single on December 17. Both artists co-wrote the song with its producers, Max Martin, Cirkut, and Dr. Luke, alongside Sarah Hudson. The song was originally conceived by Perry and Hudson during a writing session in Perry's hometown of Santa Barbara, California, and Juicy J, another artist on Dr. Luke's label Kemosabe Records, was later commissioned for a verse on the song.\n\"Dark Horse\" combines the genres of pop and trap music, creating what has been described as a \"Southern rap-techno mashup.\" The track features a minimal production, with Perry's vocals being sung in a \"seductive\" and \"mature\" tone, while Juicy J is featured on the song's intro and rapped-bridge. Perry, in interviews, said she wanted the song to have a \"witchy, spell-y kind of black magic-y idea\", so she wrote it from the perspective of a witch warning a man not to fall in love with her because if he does, she will be his last. The song was part of a competition sponsored by Pepsi in which fans could vote via Twitter on whether they would prefer \"Dark Horse\" or \"Walking on Air\" to be released as the first promotional single from Prism.\nUpon release, \"Dark Horse\" received mixed reviews from contemporary music critics, who praised its experimentation with urban music but were divided on Juicy J's contribution to the song. \"Dark Horse\" has been a commercial success, charting at number one on the US Billboard Hot 100, Canadian Hot 100, and the Netherlands Dutch Top 40 and Mega Single Top 100 charts. The song has also reached number two on the New Zealand Singles Chart, the Venezuela Pop Rock Chart, and the Swedish Sverigetopplistan Chart. The song is Perry's tenth song to top the Billboard Digital Songs chart. Perry first performed the song live at the 2013 iHeartRadio Music Festival in Las Vegas on September 20, 2013. The song's first major television performance was at the 56th Annual Grammy Awards on January 26, 2014. The next day, a remix featuring Pitbull leaked online. \"Dark Horse\" became Perry's ninth Billboard Hot 100 number one single on January 29, 2014. A music video was released on February 20, 2014.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uxqpvs1419977453.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=0KSOMA3QBU0", "strMusicVidDirector": "Mathew Cullen", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/qvqqvv1418388043.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/wstsrs1418388051.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/uqtyxq1418388059.jpg", "intMusicVidViews": "2734488517", "intMusicVidLikes": "9780612", "intMusicVidDislikes": "1117328", "intMusicVidFavorites": "0", "intMusicVidComments": "647273", "intTrackNumber": "6", "intLoved": "2", "intScore": "10", "intScoreVotes": "2", "intTotalListeners": "472532", "intTotalPlays": "3817278", "strMusicBrainzID": "df43f3a0-5e6c-4a68-a731-c9b8b53797b3", "strMusicBrainzAlbumID": "0d8b973c-fcff-4830-b645-a877b8a9a08f", "strMusicBrainzArtistID": "122d63fc-8671-43e4-9752-34e846d62a9c", "strLocked": "Unlocked"}]}