{"track": [{"idTrack": "33736517", "idAlbum": "2192644", "idArtist": "114364", "idLyric": "0", "idIMVDB": null, "strTrack": "Partition", "strAlbum": "Beyoncé", "strArtist": "Beyoncé", "strArtistAlternate": "Beyonce", "intCD": null, "intDuration": "319466", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Partition\" is a song recorded by American singer Beyoncé, for her self-titled fifth studio album (2013). It was composed by her, \"The Dream\", Justin Timberlake, Timbaland, Jerome Harmon, Dwane Weir, Mike Dean and Boots. It was sent to urban contemporary on February 25, 2014 as the third single from Beyoncé by Columbia Records.\nThe song consists of two parts, titled \"Yoncé\" and \"Partition\". A hip hop, dancehall and electro track, \"Partition\" also incorporates trap elements. Its production musically consists of a sparse synthesized arrangement, a thrusting bassline and a heavy drumbeat. Exploring the deeply sexual nature of Beyoncé, the first part of the song takes place in a club while the second part depicts sexual intercourse in the back of a limousine. The closing minute of the song features a French word interpolation similar to a quote by actress Julianne Moore in 1998 film The Big Lebowski.\n\"Partition\" was lauded by contemporary music critics, who commended Beyoncé's advocacy for freedom and confidence in the expression of female sexuality. They also praised the catchy lyrics and the Monica Lewinsky reference in second part of the song became known as one of the most memorable lines on the album. Knowles was complimented for her half-rapped vocal delivery and received comparisons to British recording artist M.I.A. Following the album's release, \"Partition\" gained some spins on United States urban contemporary radio stations. It has reached number 70 on the US Billboard Hot 100 chart and number 19 on the US Hot R&B/Hip-Hop Songs chart. Music videos for \"Yoncé\" and \"Partition\" were released on December 13, 2013, on Beyoncé. The former clip was directed by Ricky Saiz and filmed on the streets of Brooklyn, New York, while the latter clip was directed by Jake Nava and shot at the Parisian cabaret club, Crazy Horse.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/sxyutt1419973210.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=pZ12_E5R3qc", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "74131280", "intMusicVidLikes": "378584", "intMusicVidDislikes": "49677", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "6", "intLoved": "0", "intScore": "5", "intScoreVotes": "1", "intTotalListeners": "250884", "intTotalPlays": "3098301", "strMusicBrainzID": "db5082ae-a55d-4b91-9e22-130101a5becb", "strMusicBrainzAlbumID": "8596171e-23b2-4bdd-8f1c-11960df0ecbe", "strMusicBrainzArtistID": "859d0860-d480-4efd-970c-c05d5f1776b8", "strLocked": "Unlocked"}]}