{"track": [{"idTrack": "33930007", "idAlbum": "2208465", "idArtist": "122405", "idLyric": "0", "idIMVDB": null, "strTrack": "Problem", "strAlbum": "Problem", "strArtist": "Ariana Grande", "strArtistAlternate": null, "intCD": null, "intDuration": "193000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Problem\" is a song recorded by American recording artist Ariana Grande, featuring a guest appearance from Australian recording artist Iggy Azalea. The song was released by Republic Records on April 28, 2014, as the lead single from Grande's upcoming sophomore studio album. The song was written by Grande, Savan Kotecha, Azalea, Ilya and Max Martin, and produced by the latter two along with Shellback. \"Problem\" is an uptempo pop and R&B song which comprises a melody based on drums, saxophone loops and trumpets. The chorus features uncredited background vocals from American hip hop artist Big Sean. Lyrically, the song is about \"the feeling of being absolutely terrified to re-approach a relationship that's gone sour -- but you want to more than anything\".\n\n\"Problem\" received generally positive reviews from music critics; many appreciated its overall production for its inclusion of a saxophone loop, while others praised the song's throwback sound and 90's influence. The song debuted at number three on the Billboard Hot 100 selling 438,000 copies in its first week on sale, earning Grande her biggest digital song sales week ever. The song later peaked at number two, surpassing \"The Way\" as her biggest hit single in the United States. It also became Azalea's highest charting single in the US, after her own single \"Fancy\". \"Problem\" performed well internationally debuting atop the New Zealand Top 40 Singles Chart and, also reached the top five in most other territories, including Australia, Canada, Denmark, and Greece.\n\nTo promote the song, Grande performed at the 2014 Radio Disney Music Awards as the ceremony's opening, at the 2014 iHeartRadio Music Awards, on The Ellen DeGeneres Show and at the 2014 Billboard Music Awards. The song's accompanying music video was filmed the following day after its release with Nev Todorovic as the director and premiered on VEVO on May 30, 2014. The single has been certified Platinum by the Recording Industry Association of America (RIAA).\n\nThe song became Ariana's first No. 1 on an chart after debuting at #1 on the Digital Songs chart on its first week.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uswxpu1402393431.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=SoJ8s90NLc4", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "71668477", "intMusicVidLikes": "569720", "intMusicVidDislikes": "25808", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "1", "intScore": "8.57143", "intScoreVotes": "7", "intTotalListeners": "401992", "intTotalPlays": "2959648", "strMusicBrainzID": "48a46cba-5fbb-4a5e-b723-6077ed8a5847", "strMusicBrainzAlbumID": "72ed70a6-2883-4345-8372-f6f68e18eaf3", "strMusicBrainzArtistID": "f4fdbb4c-e4b7-47a0-b83b-d91bbfcfa387", "strLocked": "Unlocked"}]}