{"track": [{"idTrack": "33787651", "idAlbum": "2196690", "idArtist": "126846", "idLyric": "0", "idIMVDB": "212738340351", "strTrack": "Say Something", "strAlbum": "Is There Anybody Out There?", "strArtist": "A Great Big World", "strArtistAlternate": null, "intCD": null, "intDuration": "233000", "strGenre": "Indie", "strMood": "Happy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Say Something\" is a song by American pop duo A Great Big World, released as the lead-single from their debut album, Is There Anybody Out There? (2013). Originally being released as a solo single from band member Ian Axel's solo album This Is the New Year in 2011, the song was released as a single by the band on September 3, 2013, via Epic Records. Following its usage on American reality TV show So You Think You Can Dance, the track gained attention from singer Christina Aguilera, who wanted to be featured on the song. Quickly afterwards, Aguilera appeared on the re-recorded version of \"Say Something\", released on November 4, 2013.\nComposed by Ian Axel, Chad Vaccarino and Mike Campbell, \"Say Something\" is a downtempo indie pop piano ballad which talks about a breakup, where the lover is implored to make a statement that could potentially reverse plans, with the singers expressing humility, sadness and regret. In the single version with Aguilera, she plays a ghost of the lover to whom the song is addressed as she traces the steps of the lead vocal. The song was critically praised for its powerful lyrics, the emotional composition and Aguilera's vocal delivery.\n\"Say Something\" did not sell significantly until the re-recorded version was available; it debuted at number 16 on the Billboard Hot 100 chart after A Great Big World and Aguilera performed the song on The Voice, while eventually peaking at number 4. It also top the Australian charts, becoming their first number-one single (and Aguilera's third) and reached the top-ten in most countries. A music video was released on November 19, 2013. It features the trio singing as people \"act out the heartbreaking lyrics.\" To further promote \"Say Something\", A Great Big World performed the track on The Voice and at the American Music Awards of 2013 with Aguilera.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/yssxst1409354525.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=-2U0Ivkn2Ds", "strMusicVidDirector": "Christopher Sims", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "587530613", "intMusicVidLikes": "4217070", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "128910", "intTrackNumber": "5", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "374047", "intTotalPlays": "2678022", "strMusicBrainzID": "fcd9bec7-5a8f-48fb-a90f-bf8d22010f35", "strMusicBrainzAlbumID": "63f697ae-126b-4776-8ac9-0e550e996f5f", "strMusicBrainzArtistID": "6958e806-1e14-4844-a0a7-07a27756aa0f", "strLocked": "Unlocked"}]}