{"track": [{"idTrack": "33603393", "idAlbum": "2181844", "idArtist": "122606", "idLyric": "0", "idIMVDB": "2147483647", "strTrack": "Team", "strAlbum": "Pure Heroine", "strArtist": "Lorde", "strArtistAlternate": null, "intCD": null, "intDuration": "193040", "strGenre": "Pop", "strMood": "Relaxed", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Team\" is a song by New Zealand singer Lorde, taken from her debut studio album, Pure Heroine (2013). The song was released on 13 September 2013 as the album's third single in Australia and New Zealand by Universal Music New Zealand, and the second in the United States and the United Kingdom by Lava and Republic Records. The track was written by Lorde and Joel Little and produced by Little, with additional production from Lorde herself. \"Team\" is a hybrid of alternative pop and electro-hop featuring synthesiser, bass and snare drum instrumentation over a handclap-based beat. Lyrically, the track is a \"tribute to her friends and country\".\n\n\"Team\" was generally well received by most contemporary critics, who praised its musical style, lyrical content and Lorde's vocal delivery on the track. The single garnered success on charts internationally, peaking at number 6 on the US Billboard Hot 100 and at number 3 on the Canadian Hot 100 chart. In Oceania, it péaked at number 19 in Australia and debuting and debuted at number 3 in New Zealand. \"Team\" was certified platinum by both the Australian Recording Industry Association and Recorded Music NZ.\n\nA music video for the song was directed by Young Replicant and was released on 4 December 2013. Filmed in an abandoned building named Red Hook Grain Terminal in Red Hook, Brooklyn, the video's content was inspired by Lorde's dream of an own world for teenagers. Upon its release, the clip crashed Vevo's channel due to a high number of views. To promote \"Team\" and Pure Heroine, Lorde performed the song on several occasions, including on Late Show with David Letterman and at the ARIA Music Awards of 2013. It was later featured on a season 10 episode of Grey's Anatomy which aired in December 2013.\n\n\"Team\" was written by Lorde and Joel Little while Lorde was travelling the world. The track was recorded, produced and mixed by Little at his Golden Age Studios in Morningside, Auckland, with Lorde providing additional production. The song was produced using the software Pro Tools. On 13 September 2013 \"Team\" was leaked, justifying an earlier rush out release. Within hours the audio was uploaded on YouTube and Universal Music New Zealand released the digital download single for sale in Australia and New Zealand. On 19 November 2013, the track was sent to US contemporary hit radio by Lava and Republic Records. \"Team\" was sent to US rhythmic contemporary radio on 6 January 2014.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xwsyxv1484311669.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=f2JuxM-snGc", "strMusicVidDirector": "Young Replicant", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "140931257", "intMusicVidLikes": "779855", "intMusicVidDislikes": "30230", "intMusicVidFavorites": "0", "intMusicVidComments": "37116", "intTrackNumber": "6", "intLoved": "1", "intScore": "9.5", "intScoreVotes": "6", "intTotalListeners": "629899", "intTotalPlays": "6497612", "strMusicBrainzID": "02470653-177c-44a7-85a4-7c070a5153cd", "strMusicBrainzAlbumID": "8e8a1db7-1d43-44d3-9796-fd69f12730cb", "strMusicBrainzArtistID": "8e494408-8620-4c6a-82c2-c2ca4a1e4f12", "strLocked": "Unlocked"}]}