{"track": [{"idTrack": "33700185", "idAlbum": "2189695", "idArtist": "113324", "idLyric": "0", "idIMVDB": "2147483647", "strTrack": "Timber", "strAlbum": "Meltdown EP", "strArtist": "Pitbull", "strArtistAlternate": null, "intCD": null, "intDuration": "204000", "strGenre": "Hip-Hop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Timber\" is a song by American rapper Pitbull featuring American recording artist Kesha. The song was released on October 7, 2013, as the lead single from Pitbull's extended play (EP) Meltdown. The song was produced by Dr. Luke, Cirkut, and Sermstyle, with additional production by Nick Seeley. The song interpolates Lee Oskar's 1978 single \"San Francisco Bay\" and features harmonica player Paul Harrington, who plays through the entire song and was told to emulate Oskar.\n\nThe song peaked at number one on the Billboard Hot 100 for three consecutive weeks, and has also topped the charts in many other countries, including Canada (where it stood at number one for eight consecutive weeks), the United Kingdom, Germany, the Netherlands and Denmark.\nKesha had previously featured Pitbull on remixes of her songs \"Tik Tok\" and \"Crazy Kids\", and Pitbull has featured Kesha on a 2009 song, \"Girls\". In an interview in December 2013, Pitbull said that Rihanna was originally meant to be the featured artist on \"Timber\", but she had already been asked to be the featured artist on Shakira's \"Can't Remember to Forget You\" and did not have time to record \"Timber\".\n\nThe song contains country and folk influences. According to the sheet music published at Musicnotes.com by Kobalt Music Publishing, the song is set in common time with a moderately fast tempo of 130 beats per minute. The song is written in the key of G♯ minor and follows a chord sequence of G♯m–B–F♯–E. Kesha's vocals span from G♯3 to D♯5.\nKesha filmed her scenes on November 5, 2013 while Pitbull filmed his scenes one week later on November 12, 2013. The video also features a cameo by The Bloody Jug Band, an Orlando-Based Americana Group, who perform on stage as the bar's house band. The music video also features the Italian model Raffaella Modugno and first premiered on Pitbull's official Facebook page on November 24, 2013. As of October 2014 the video has received over 425 million views.\n\nThe beach scenes were filmed in Exuma islands, Bahamas.\nOn June 25, 2014, it was reported that songwriters Lee Oskar, Keri Oskar, and Greg Errico had filed a copyright infringement lawsuit against the makers of \"Timber\", which features a harmonica melody that Oskar claims is \"identical\" to the melody used in his 1978 song \"San Francisco Bay\". The songwriters are seeking $3 million in damages. The lawsuit alleges that while Sony Music may have obtained permission to use the sample, which is credited in the album notes for Meltdown, from a license holder, the label failed to obtain permission from the songwriters themselves.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/sspuwu1418735076.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=hHUbLv4ThOo", "strMusicVidDirector": "David Rousseau", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/ywqxrp1418734975.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/tpvsxq1418734982.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/qruvxp1418734989.jpg", "intMusicVidViews": "470214160", "intMusicVidLikes": "1228639", "intMusicVidDislikes": "83086", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "396449", "intTotalPlays": "2825774", "strMusicBrainzID": "f27e1d88-fb3c-4854-906e-ddede4306d8b", "strMusicBrainzAlbumID": "65f374b4-081f-44de-b5cb-4cc549619d2e", "strMusicBrainzArtistID": "d262ea27-3ffe-40f7-b922-85c42d625e67", "strLocked": "Unlocked"}]}