{"track": [{"idTrack": "33880256", "idAlbum": "2204133", "idArtist": "128439", "idLyric": "0", "idIMVDB": null, "strTrack": "Turn Down For What", "strAlbum": "Turn Down For What", "strArtist": "DJ Snake", "strArtistAlternate": null, "intCD": null, "intDuration": "213000", "strGenre": "Electronic", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Turn Down for What\" is a single by DJ Snake and Lil Jon. It was released at the end of 2013. An accompanying music video for \"Turn Down for What\" was directed by the filmmaking duo The Daniels (Daniel Kwan and Daniel Scheinert) and released on March 13, 2014. The clip stars one of the directors Daniel Kwan. He explained: \"For a while Daniel and I had been wanting to explore male sexuality in a really weird way. For some reason our brains came up with this image, and this other universe where dudes are so pumped up on their own dicks—and they’re so into their testosterone—that the way that they show that is by breaking shit with their dicks. So, whatever happens, that would just be a funny logical progression.\"\nJason Newman of Rolling Stone described the video as \"perfect insanity\" and added: \"It's hard to pinpoint specifically what makes the video for DJ Snake and Lil Jon's \"Turn Down for What\" so compelling and ripe for repeat viewings.\" Edwin Ortiz of Complex called it \"incredibly absurd and awesome\" and wrote: \"The hard-hitting EDM record delivers an undeniable vibe that listeners can't help but mosh out to, and that's clearly evident in the accompanying music video.\" Writing for Idolator, Robbie Daw said: the video \"takes things to a whole new level of WTF-ness not quite seen before.\" On April 26, 2014, the official remix featuring Juicy J, 2 Chainz and French Montana was released[14] followed by the second official remix on April 28, 2014, titled the Dancehall Remix, featuring Chi Ching Ching, Assassin and Konshens was released.[15] and a third release on May 7, 2014 titled the Lil Jon Remix, featuring Pitbull and Ludacris.[16]\nThe song was featured in a commercial for Sol Republic, a wireless speaker, which aired in October 2013.[17] In May 2014, Jimmy Fallon, Seth Rogen and Zac Efron danced dressed as girls on the song during an episode of The Tonight Show Starring Jimmy Fallon.[18]", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wtwsvy1402484203.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=HMUDVMiITOU", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "148304167", "intMusicVidLikes": "878521", "intMusicVidDislikes": "71153", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "200229", "intTotalPlays": "867922", "strMusicBrainzID": "a4c1efe1-7b27-4604-be35-097326ed1c5f", "strMusicBrainzAlbumID": "e6725195-40ce-46f9-b4a6-f25d4190fca7", "strMusicBrainzArtistID": "31445b1e-96f3-4c7f-84ec-dd02e647e690", "strLocked": "Unlocked"}]}