{"track": [{"idTrack": "32974170", "idAlbum": "2130430", "idArtist": "114306", "idLyric": "290072", "idIMVDB": "0", "strTrack": "Can't Fight the Moonlight", "strAlbum": "I Need You", "strArtist": "LeAnn Rimes", "strArtistAlternate": "Margaret LeAnn Rimes", "intCD": null, "intDuration": "215933", "strGenre": "Country", "strMood": "Good Natured", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Can't Fight the Moonlight\" is a song written by Diane Warren, recorded by country pop singer LeAnn Rimes. It appeared in the film Coyote Ugly and its soundtrack and was credited as the theme of the film. Released as a single on August 22, 2000 by Rimes, the song reached the top twenty in every country it charted in, and peaked at number eleven on the Billboard Hot 100. Internationally, the song topped the charts in eight countries, including Australia, Ireland and the United Kingdom. \"Can't Fight the Moonlight\" became Australia's best-selling single of 2001.\n\nThe song appeared on Rimes's I Need You (2002) compilation album and The Best of LeAnn Rimes (2004) with the Graham Stack Radio Edit of the song (known as the \"Latino Mix\" internationally) included as a bonus track on the I Need You album as well as on the sequel soundtrack to the film, More Music from Coyote Ugly (2003). The remix was also included on her Greatest Hits (2003) album as well as on the remix edition of her Best of album.\n\nA music video for the song was released in 2000 including clips taken from the Coyote Ugly film with Rimes performing at the \"Coyote Ugly\" bar.\n\nRimes originally auditioned for the 2000 film Coyote Ugly to sing \"Can't Fight the Moonlight\" at the ending with Piper Perabo but, once Rimes watched some cuts of the film, she decided to provide the singing voice for all the songs sung by Perabo (this would include \"But I Do Love You\", as well as two other tracks on the soundtrack).The vocals Rimes provided are altered in their pitch and vocal range in comparison to her natural vocal range; and, the closing scene, wherein she and Perabo's character sing, is effectively her duetting with herself. The song's lyrics were slightly changed for film.\n\n\"Can't Fight the Moonlight\" is a pop song of three minutes and thirty-five seconds. The song was written by American Grammy Award-winning songwriter, Diane Warren and performed by Rimes. The verses are written in the key of E-flat major with the first and second choruses in D-flat minor and the final chorus in D minor. The song is produced by Trevor Horn with executive production by Jerry Bruckheimer, Kathy Nelson and Mike Curb. Orchestral arrangements were done by David Campbell with engineering and mixing done by Steve MacMillan. Additional engineering was done by Tim Weidner, Greg Hunt, Gary Leach and Austin Deptula. According to Warren it is the first song she had written with so many key changes. A review by Billboard praised producer Trevor Horn by stating \"Oh-so creatively produced by Trevor Horn with guitars, lush layers of harmony, and a funky albeit delicate hip-hop track (no, really), this easy-flowing midtempo popper is a sassy number, demonstrating that Rimes has crossed the line to adult-leaning lyrics.\"", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vvypsv1486822921.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "David McNally", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": "0", "intMusicVidComments": "0", "intTrackNumber": "6", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "227978", "intTotalPlays": "1013830", "strMusicBrainzID": "d8cdb7db-d903-4394-a5f4-fd0778091e24", "strMusicBrainzAlbumID": "2e093129-eaec-309d-9513-7309d6c3118e", "strMusicBrainzArtistID": "9092d8e1-9b38-4372-a96d-000b8561a8bc", "strLocked": "Unlocked"}]}