{"track": [{"idTrack": "32925178", "idAlbum": "2126290", "idArtist": "111349", "idLyric": "160242", "idIMVDB": "0", "strTrack": "Escape", "strAlbum": "Escape", "strArtist": "Enrique Iglesias", "strArtistAlternate": null, "intCD": null, "intDuration": "210706", "strGenre": "Latin", "strMood": "Enlightened", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Escape\" is a song written by Kara DioGuardi, Enrique Iglesias, Steve Morales and David Siegel for Iglesias' 2001 album Escape. The song is the album's opening track, and was released as its second single in 2002 (see 2002 in music). The song reached number three in the UK and number twelve in the U.S. charts. There is a Spanish version of the song, also sung by Iglesias, titled \"Escapar\". The song sold 3.6 million copies in 2002.\n\n\"Escape\" composed in common time and in the key of B major, with the entire song consisting of a I–IV–vi–V chord progression loop. It is written in verse-chorus form, and its instrumentation comes from the electric guitar and keyboard. The song moves at a tempo of 126 beats per minute. Iglesias' vocals span from F♯4 to D♯6.\n\nThe song's music video was directed by Dave Meyers and filmed in the Long Beach Performing Arts Center and the CityWalk shopping area in Universal City, California. It features Iglesias and tennis-player Anna Kournikova as his love interest. The video opens with a sequence of Iglesias performing the song, backed by a live band, in front of a huge crowd in a theater. Throughout the video, there are sequences of Iglesias and Kournikova's relationship. The first sequence is of Iglesias driving through a busy city on a motorbike while Kournikova awaits his arrival. Once he arrives, he attempts to kiss her but she pushes him away.\n\nIn the next scene Iglesias follows Kournikova into the ladies room. She catches his eye in the mirror and turns around to kiss him. They continue kissing while sprawled across the bathroom sinks until two security guards pull them apart and take Iglesias away. The scene soon cuts to another scene where another security guard pulls up in a carpark and spots them kissing while lying across the front seats of a car. But, unlike the previous security guards, he leaves them undisturbed and drives away. The video closes with a scene of the theater being emptied, but Kournikova stands and waits in her seat until Iglesias comes over to her after the crowd has left.\n\n\"Escape\" premiered on MTV's top-ten chart program Total Request Live on 30 January 2002, where it reached number one. It was Iglesias's first video to retire from the chart at #1. After its 8 February debut on MuchMusic's Countdown, it reached number one for the week of 19 April.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/ysttyt1487184476.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "Dave Meyers", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": "0", "intMusicVidComments": "0", "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "178645", "intTotalPlays": "981927", "strMusicBrainzID": "e5041666-d3f7-40f0-a575-17680e5d6af8", "strMusicBrainzAlbumID": "43fd822c-5f5c-36fd-a401-ae92aeea1d45", "strMusicBrainzArtistID": "35f866dc-c061-48ba-8157-cf2e0eac4857", "strLocked": "Unlocked"}]}