{"track": [{"idTrack": "32814831", "idAlbum": "2117596", "idArtist": "112325", "idLyric": "264783", "idIMVDB": "0", "strTrack": "Like I Love You", "strAlbum": "Justified", "strArtist": "Justin Timberlake", "strArtistAlternate": null, "intCD": null, "intDuration": "282346", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Like I Love You\" is the debut single recorded by American singer Justin Timberlake for his debut studio album, Justified (2002). The song features American hip hop duo Clipse. It was co-written by Timberlake and The Neptunes (Chad Hugo and Pharrell Williams), who also produced it. The song was released on October 14, 2002 as Timberlake's debut solo single, following the break-up of 'NSYNC earlier that year. According to Williams, who came up with the music loop, the song's drums were an ode to the funk era.\n\nThe song peaked at number 11 on the US Billboard Hot 100 and number two in the United Kingdom. It was performed by Timberlake at the 2002 MTV Video Music Awards in New York City, on August 29, 2002. It also received a nomination at the Grammy Awards of 2003 for Best Rap/Sung Collaboration. The location of the music video is in Weston, Ontario, Canada.\n\nMTV News reported in July 2002 that Chad Hugo and Pharrell Williams (known collectively as Williams and Hugo) were working on multiple tracks for Justified. When the duo picked Timberlake up from his hotel in Virginia Beach, they listened to Earth, Wind & Fire albums during the car ride. The background of the songs was the feeling the duo wanted to implement into the musical content of the album. In response to this, Timberlake said: \"Nobody's ever heard anything like that before ... a white boy singing this kind of music.\" Hugo revealed that Timberlake \"didn't care what people would say.\" The production duo commented that despite not being content with sampling music, for inspiration, they listened to both Off the Wall and Thriller, albums by Michael Jackson. Hugo commented that \"We just wanted to re-create that sense of those timeless, classic songs, without any of the 'bling, bling, hit me on my two-way' style of the new R&B. It has elements of the old and the new.\"\n\n\"Like I Love You\" was the first song they recorded together and the first song Timberlake recorded for Justified. The song was written by Timberlake, Hugo and Williams, while the production was done by the latter two. The song features a rap verse by hip hop duo Clipse. \"Like I Love You\" was recorded at Master Sound Recording Studios and Windmark Recording both located in Virginia Beach with Andrew Coleman serving as a recording engineer. Serban Ghenea mixed the song at Windmark Recording, while Daniel Botancourt and Tim Roberts were additional engineers. John Hanes provided the additional pro tools engineering. All the instrumentation was delivered by Hugo and Williams, while the song's vocal arrangement was provided by Williams together with Timberlake.\n\n\"Like I Love You\" debuted on the US Billboard Hot 100 at number 67 for the issue dated September 7, 2002. The next week it climbed to number 46. It eventually reached a peak of number 11 and stayed on the chart for total of 36 weeks. The song was more successful on the US Pop Songs and Hot Dance Club Songs charts where it peaked at number four and one respectively. Additionally it charted on the US Hot R&B/Hip-Hop Songs chart where reached a peak of 53. The song was more successful in Oceania. On the Australian Singles Chart, the song debuted at number nine for the week dated October 27, 2002. The next week it fell to number 11, before eventually reaching its peak of number eight in its third week; the single stayed on its peak position for three consecutive weeks. \"Like I Love You\" stayed on the chart for a total of twelve weeks. The song was certified platinum by the Australian Recording Industry Association (ARIA) for shipments of 70,000 units. It debuted and peaked at number six on the New Zealand Singles Chart for the week dated November 10, 2002. The song stayed on the chart for twelve weeks.\n\nIn the United Kingdom, \"Like I Love You\" debuted at its peak of number two for the issue dated November 2, 2002. It stayed on the chart for total of 16 weeks, with its last appearance being on February 15, 2003 at number 57. The song debuted and peaked at number five on the Irish Singles Chart. \"Like I Love You\" debuted at its peak of number four on the Danish Singles Chart and managed to stay on the position for two consecutive weeks, before starting to fell on the chart. It stayed on the chart for total of 14 weeks. The single debuted at number 14 on the Norwegian Singles Chart for the week dated October 25, 2002. After three weeks, \"Like I Love You\" managed to reach its peak of number 10 on the chart. Additionally, the song charted and peaked at number 14 on the Swiss Singles Chart.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rpsxtx1484134055.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=FQ3slUz7Jo8", "strMusicVidDirector": "Bucky Chrome", "strMusicVidCompany": "Production League of America", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "55255291", "intMusicVidLikes": "124020", "intMusicVidDislikes": "3625", "intMusicVidFavorites": "0", "intMusicVidComments": "8810", "intTrackNumber": "2", "intLoved": "2", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": "349482", "intTotalPlays": "1565227", "strMusicBrainzID": "d8089ed7-eccc-4753-b70f-728f318f3b64", "strMusicBrainzAlbumID": "424620c6-e416-3ce8-bfcc-d5c59952456d", "strMusicBrainzArtistID": "596ffa74-3d08-44ef-b113-765d43d12738", "strLocked": "Unlocked"}]}