{"track": [{"idTrack": "32925676", "idAlbum": "2126328", "idArtist": "111304", "idLyric": "157978", "idIMVDB": null, "strTrack": "Lose Yourself", "strAlbum": "Curtain Call: The Hits", "strArtist": "Eminem", "strArtistAlternate": "Marshall Bruce Mathers III", "intCD": null, "intDuration": "326466", "strGenre": "Hip-Hop", "strMood": "Angry", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Lose Yourself\" is a song by the American hip-hop artist Eminem, released as the first single from the original soundtrack to the movie 8 Mile on October 22, 2002. It was written and produced by Eminem himself, along with longtime collaborator Jeff Bass, one half of the production duo Bass Brothers, along with brother Mark Bass. The song was largely written during the filming of 8 Mile, including several elements written entirely on set by Eminem. The song largely plays to the themes of the film, as it is largely based around, and written from the viewpoint of, the character of Jimmy \"B-Rabbit\" Smith, Jr., the role taken on by Eminem in the film, and the events of the film itself. Lose Yourself became the first rap song to win The Academy Award for Best Original Song.\n\n\"Lose Yourself\" is a mid-tempo hardcore hip-hop track, which incorporates several aggressive themes, largely dealing with the struggles dealt with by \"B-Rabbit\" during the film, and how he eventually overcomes his many problems and obstacles to gain the respect of other rappers, as this is his ambition, but he has constantly been held back by his own personal problems.\n\nThe song earned Eminem five Grammy nominations at the 46th Grammy Awards in 2004 and the Academy Award for Best Original Song in 2002, making it the first ever rap song to have received this accolade. In 2004, it was one of only three hip-hop songs from the twenty-first century to have been included on Rolling Stone magazine's list of the 500 Greatest Songs of All Time, and was also the highest ranking, at number 166. However, in a revised update for 2010, it was removed from the list. As of June 29, 2012, it has had over 5,000,000 downloads in the United States alone, and has been certified quintuple platinum by the Recording Industry Association of America for sales of 5,000,000 copies in the United States.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wquuyq1359160062.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=_Yhyp-_hX2s", "strMusicVidDirector": " Eminem", "strMusicVidCompany": "Geronimo Film Productions Inc.", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "1066184694", "intMusicVidLikes": "6612750", "intMusicVidDislikes": "187844", "intMusicVidFavorites": "0", "intMusicVidComments": "238342", "intTrackNumber": "6", "intLoved": "0", "intScore": "9.6", "intScoreVotes": "5", "intTotalListeners": "898862", "intTotalPlays": "5720560", "strMusicBrainzID": "a1a756cc-1694-437d-9bd2-ca9e5bb005a8", "strMusicBrainzAlbumID": "1a18928e-1d32-32f2-a10e-e1f76e86bc8b", "strMusicBrainzArtistID": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "strLocked": "Unlocked"}]}