{"track": [{"idTrack": "32761622", "idAlbum": "2113271", "idArtist": "111538", "idLyric": "36617", "idIMVDB": "0", "strTrack": "Sk8er Boi", "strAlbum": "Let Go", "strArtist": "Avril Lavigne", "strArtistAlternate": null, "intCD": null, "intDuration": "204000", "strGenre": "Pop", "strMood": "Intense", "strStyle": "Rock/Pop", "strTheme": "Teenagers", "strDescriptionEN": "\"Sk8er Boi\" (/ˈskeɪtər bɔɪ/, \"skater boy\") is a song by French-Canadian singer-songwriter Avril Lavigne, released as the second single from her debut album, Let Go (2002). It was written by Avril Lavigne and The Matrix (Scott Spock, Lauren Christy, and Graham Edwards), and produced by The Matrix. The song is a power pop and pop punk track, which lyrically, tells a story told from the singer's viewpoint about her rocker boyfriend and a girl he knew in high school who rejected him because he was a skateboarder and she was a snob.\n\nThe song received critical appreciation, with most commending its hook, calling the song \"funny\" and \"clever\". It also received a Grammy nomination for Best Female Rock Vocal Performance at the 2003 edition. Commercially, \"Sk8er Boi\" was a success, reaching the top-ten in more than ten countries, such as Australia, New Zealand, the United Kingdom and the United States (becoming Lavigne's second top ten single on the Billboard Hot 100 chart).\n\nThe music video for the song, directed by Francis Lawrence, features a concert on a city street with Lavigne singing on the hood of a car with a crowd rocking out around her. It was a success on TRL and was voted one of the best music videos of the decade by BT TV. The song was featured in all of the concerts and tours held by Lavigne, since her first, \"Try to Shut Me Up Tour\" (2002-2003) until her latest, \"The Avril Lavigne Tour\" (2013-2014).\n\nAfter being signed to Arista Records in November 2000 upon the authorization of the label's CEO, Antonio \"L.A.\" Reid, Lavigne moved to New York with the assistance of Reid. There, she began working on her debut album, Let Go, collaborating with a host of prime songwriters and producers. While being on the verge of getting dropped off Arista, after an unsuccessful year of writing, Lavigne came to the attention of the three-piece production team The Matrix, who later discovered that she wanted songs with punk rock inclinations. After writing \"Complicated\" together, L.A. Reid agreed with the musical direction Lavigne and The Matrix were taking, and sent Lavigne back to The Matrix to work with them on more songs.\n\nDuring the sessions, they wrote 10 songs, with \"Sk8er Boi\" being one of the six songs on the album's final track list. After the huge success of \"Complicated\", \"Sk8er Boi\" was selected as the album's second single, being the more controversial choice, according to L.A. Reid: \"Some people just really didn't get that. And with the first video, there was some concern that maybe because it's so young and so playful, it might alienate more serious music lovers.\"\n\n\"Sk8er Boi\" was written by Avril Lavigne, while the production team The Matrix (consisting of Lauren Christy, Graham Edwards and Scott Spock) co-wrote, arranged and produced the track. \"Sk8er Boi\" is a punk rock, pop punk and power pop song about a snobby girl who rejects a skateboarder who has a crush on her (despite returning his feelings), letting her friends' prejudices sway her decision-making. Later on, he becomes a superstar musician (playing guitar on MTV) while she ultimately ends up as a young single mom.\n\nThe song's lyrics, including the line \"He was a punk/She did ballet/What more can I say,\" were criticized. Christina Saraceno of Allmusic wrote that on \"Sk8er Boi\", \"she shows her lyrical shortcomings.\" A poll on the website MagPieMusic.com voted the song's lines \"He was a boy, she was a girl. Can I make it any more obvious?\" at fourth place, in its list of \"Worst Lyrics of All Time\".\n\nThe music video was directed by Francis Lawrence and premiered on 22 August 2002 on TRL. The video shot to number-one on TRL on its second day of the countdown. The video was considered the third 'Best music video of the decade' in the UK by BT Vision, while ET Canada ranked the video at number 2 on her \"Top 10 Best Music Videos\". The video centers around an impromptu concert held by Lavigne in a Los Angeles street intersection. It begins by showing multiple people of Lavigne's band promoting the concert in advance via graffiti, flyers, email and posters. Lavigne and her band arrive at the location and begin performing on the roof of their cars; a crowd quickly gathers. Towards the end of the song, police cars and a helicopter arrive to disperse the crowd, while Lavigne uses her guitar to break the car windscreen. Lavigne then throws the guitar onto the road and looks up at the helicopter, where a shot was taken for the single's artwork.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wpryxt1484134844.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=TIy3n2b7V9k", "strMusicVidDirector": "Francis Lawrence", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "91608177", "intMusicVidLikes": "437864", "intMusicVidDislikes": "11679", "intMusicVidFavorites": "0", "intMusicVidComments": "38130", "intTrackNumber": "3", "intLoved": "0", "intScore": "9.66667", "intScoreVotes": "3", "intTotalListeners": "536160", "intTotalPlays": "3058463", "strMusicBrainzID": "f06649e9-056a-4e73-9e97-91cd96efb3ba", "strMusicBrainzAlbumID": "0837aca2-319e-3f2f-a2d3-c525802068d6", "strMusicBrainzArtistID": "0103c1cc-4a09-4a5d-a344-56ad99a77193", "strLocked": "Unlocked"}]}