{"track": [{"idTrack": "32783472", "idAlbum": "2115043", "idArtist": "111882", "idLyric": "357370", "idIMVDB": "0", "strTrack": "Turn Off the Light", "strAlbum": "Whoa, Nelly!", "strArtist": "Nelly Furtado", "strArtistAlternate": null, "intCD": null, "intDuration": "276066", "strGenre": "Pop", "strMood": "Happy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Turn Off the Light\" is a song by Canadian singer-songwriter Nelly Furtado, taken from her debut studio album, Whoa, Nelly! (2000). Written by Furtado, and produced by Gerald Eaton, Brian West, and Furtado, the song was released as the album's second single in mid-2001 (see 2001 in music). Furtado, who cited a song by the Canadian band Big Sugar as the inspiration for \"Turn Off the Light\", has described it as \"a real song ... Though I may seem so independent and stuff, blah, blah, blah, when I turn out the light at night I can get lonely just like everybody else. Maybe that's why it's such a good song and everyone is responding to it – because it's real. Just a song with a fun, hooky chorus.\"\n\nThere were two music videos made for \"Turn Off the Light\": the yo kai version, and the normal version. The normal version was directed by Sophie Muller and located in Beijing, China. The music video for the normal version of \"Turn Off the Light\" begins in a swamp where Furtado is sitting on the edge of a log and people are swimming in the swamp. She begins to sing the first verse and when the chorus commences the people in the swamp pull her in and they start dancing in the swamp. The second verse starts and Furtado is seen at a temple singing while some dancers jump out and dance with Furtado. During the second part of the chorus, she is surrounded by a group at the temple and they dance around her while she sings. During the bridge she is shown at an old house singing and is sitting on a chair. The video ends with Furtado back at the temple eating noodles. The underground video features Furtado playing the guitar in a wooden shed, wearing a white top and jeans. She is also seen buying flowers. Behind the scenes footage of the photoshoot for the Whoa, Nelly! cover is interwoven through the video.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xqxuss1487962003.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=kOL7aeIDruA", "strMusicVidDirector": "Sophie Muller", "strMusicVidCompany": "Oil Factory", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "27831390", "intMusicVidLikes": "88326", "intMusicVidDislikes": "2486", "intMusicVidFavorites": "0", "intMusicVidComments": "4125", "intTrackNumber": "6", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": "298507", "intTotalPlays": "1308879", "strMusicBrainzID": "89c6e48b-2c7c-4705-b8fa-4d0a70b6fd7e", "strMusicBrainzAlbumID": "9713ae12-a4e5-3fbb-a660-d152390430ce", "strMusicBrainzArtistID": "13655113-cd16-4b43-9dca-cadbbf26ee05", "strLocked": "Unlocked"}]}