{"track": [{"idTrack": "35235714", "idAlbum": "2322795", "idArtist": "155911", "idLyric": null, "idIMVDB": null, "strTrack": "Baby Shark", "strAlbum": "Baby Shark Special", "strArtist": "Pinkfong", "strArtistAlternate": null, "intCD": null, "intDuration": "96329", "strGenre": "Children", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"Baby Shark\" is a children's song featuring a family of sharks. Popular as a campfire song, it has taken off since 2016, spreading through social media, online video, and radio.\n\nOrigins\n\"Baby Shark\" originated from a campfire song or chant by Eren Newton. Some sources have mentioned traditional myths as a basis, others camping origins in the early 20th century, and some see it as possibly developed by camp counselors inspired by the movie Jaws. It became a campfire song where each member of a family of sharks is introduced with different hand motions. Different versions of the song have the sharks hunting fish, eating a sailor, or killing people, who then go to heaven.\n\n\nVarious entities have copyrighted original videos and sound recordings of the song, and some have trademarked merchandise based on their versions; however, according to The New York Times, the underlying song and characters are believed to be in the public domain.\n\nAlemuel version\nA dance version of \"Baby Shark\" was popularized online in the 2007 YouTube video \"Kleiner Hai\" (German for Little Shark) and published by Alexandra Müller, also known by her stage name Alemuel. This version is set to the theme of Jaws and tells the story of a baby shark who grows up and eats a swimmer. The video quickly gained popularity and EMI offered Alemuel a record deal and published the song accompanied by disco beats on May 30, 2008. The single peaked at 25th on of the German charts and at 21 in the Austrian charts. Based on the single and the original video, the YouTube community created a popular music video. The German version of the song remains popular among German youth groups and multiple variations (also in different dialects of German) have been published.\n\nJohnny Only version\nJohnny Only, a children's entertainer based in Upstate New York, was a DJ at a kids camp, and the counselors would regularly perform the song with their campers, acting out the hand gestures and going through each verse. Only saw how engaged and animated the campers were when \"Baby Shark\" was performed, so when he became a full-time children's entertainer, he released his own version. That was in 2011, five years before another version of \"Baby Shark\" became a global phenomenon. However Eren Newton was known to be singing the song as early as 2003.\n\nPinkfong version\n\nA speaker during the 10th Bikol Wikipedia anniversary in 2017 doing the \"Baby Shark\" dance\n\nParticipants do the \"Baby Shark\" dance at the 10th Bikol Wikipedia Anniversary AdNU, Philippines, November 2017\nThe \"Baby Shark\" song was further popularized by a video produced by Pinkfong, an education brand within South Korean media startup SmartStudy. The original video for \"Baby Shark\" (Korean: 상어 가족; RR: Sang-eo Gajok; lit. shark family) was uploaded on November 26, 2015. All videos related to Pinkfong's song have garnered around 5 billion views as of January 2019, making it the most-viewed educational video phenomenon of all time.\n\nThis version of the song was performed by then-10-year-old Korean-American singer Hope Segoine. The music video featured two child actors, one of whom is child actress Elaine Johnston, a 9 year-old New Zealander of Korean–Scottish descent.\n\nThe song starts with bars from Antonín Dvořák's Symphony No. 9 to which music from the movie Jaws sounds similar. The song features a family of sharks which go hunt a school of fish which escape to safety. It became a viral video in Indonesia in 2017, and throughout the year it spread to many other Asian countries, particularly those in Southeast Asia. The related mobile app was among the top 10 most downloaded in the family apps category in South Korea, Bangladesh, Singapore, Hong Kong and Indonesia in 2017.\n\nAs of February 2020, the most popular video of the \"Baby Shark\" song (labeled as \"Baby Shark Dance\"), uploaded on June 17, 2016, has received over 4.6 billion views worldwide, making it the second most viewed video on YouTube. Due to a 2013 change that the Billboard Hot 100 music charts made to account for online viewership of YouTube videos, \"Baby Shark\" broke into the Billboard Hot 100 at number 32 during the week of January 7, 2019.\n\nDue to its popularity, this version of the song has spurred an online dance craze (sometimes referred to as Baby Shark Challenge) while being cited as \"the next big thing after the domination of Gangnam Style\". K-pop groups including Blackpink have been credited with further spreading the viral song through their coverage of the song and dance, specifically on their featured TV shows and concerts. The song began to go viral in the Western world in August 2018.\n\nIn 2019, it was announced that Baby Shark would be adapted into a Nickelodeon series set to premiere on Nickelodeon's Nick Jr. block and the Nick Jr. channel in 2020. Nickelodeon and SmartStudy (the company that owns the Pinkfong brand) would team up for an exclusive worldwide consumer products partnership.\n\nIn January 2020, Pinkfong Baby Shark was announced to have an exclusive one-day only takeover of the Nick Jr. on Nickelodeon block during the January 31st \"Underwater Adventures\" marathon leading up to a new episode of Nick Jr. series Blaze and the Monster Machines to celebrate the soon to be released Nick Jr. Baby Shark TV series adaptation. Nickelodeon also put their own parody of the song with Nick Jr. characters involved to promote the broadcast.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qqstsp1582928227.jpg", "strTrack3DCase": null, "strTrackLyrics": "Baby shark, doo, doo, doo, doo, doo, doo\nBaby shark, doo, doo, doo, doo, doo, doo\nBaby shark, doo, doo, doo, doo, doo, doo\nBaby shark\nMommy shark, doo, doo, doo, doo, doo, doo\nMommy shark, doo, doo, doo, doo, doo, doo\nMommy shark, doo, doo, doo, doo, doo, doo\nMommy shark\nDaddy shark, doo, doo, doo, doo, doo, doo\nDaddy shark, doo, doo, doo, doo, doo, doo\nDaddy shark, doo, doo, doo, doo, doo, doo\nDaddy shark\nGrandma shark, doo, doo, doo, doo, doo, doo\nGrandma shark, doo, doo, doo, doo, doo, doo\nGrandma shark, doo, doo, doo, doo, doo, doo\nGrandma shark\nGrandpa shark, doo, doo, doo, doo, doo, doo\nGrandpa shark, doo, doo, doo, doo, doo, doo\nGrandpa shark, doo, doo, doo, doo, doo, doo\nGrandpa shark\nLet's go hunt, doo, doo, doo, doo, doo, doo\nLet's go hunt, doo, doo,…", "strMusicVid": "https://www.youtube.com/watch?v=XqZsoesa55w", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/186drf1620292475.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/5idg1h1620292523.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/bufbng1620292573.jpg", "intMusicVidViews": "13317650993", "intMusicVidLikes": "41197146", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "3", "intScore": "10", "intScoreVotes": "3", "intTotalListeners": "47352", "intTotalPlays": "308942", "strMusicBrainzID": "4d19d9d5-9174-4037-9dec-21b6c2cbcbb9", "strMusicBrainzAlbumID": "4cb344b3-1efb-4e71-81ca-4e336e1e8087", "strMusicBrainzArtistID": "1af169ca-2cbd-4280-adcf-23963301448e", "strLocked": "Unlocked"}]}