{"track": [{"idTrack": "35127067", "idAlbum": "2313086", "idArtist": "152448", "idLyric": null, "idIMVDB": null, "strTrack": "bad guy", "strAlbum": "WHEN WE ALL FALL ASLEEP, WHERE DO WE GO?", "strArtist": "Billie Eilish", "strArtistAlternate": null, "intCD": null, "intDuration": "0", "strGenre": "Pop", "strMood": "...", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Bad Guy\" (stylized in all lowercase) is a song recorded by American singer-songwriter Billie Eilish. It was released on March 29, 2019, through Darkroom and Interscope Records, as the fifth single from Eilish's debut studio album, When We All Fall Asleep, Where Do We Go?. Eilish co-wrote \"Bad Guy\" with her brother, Finneas O'Connell, with the latter producing it and the former providing additional production. Another version of the song, a collaboration with Canadian singer Justin Bieber, was released on July 11, 2019. The song was described as electropop, dance-pop, pop-trap, and nu-goth pop in press reviews, for which synth bass, a kick drum, finger snaps and 808 bass provide minimalist instrumentation. In the song's lyrics, Eilish taunts her lover for being a bad guy while suggesting that she is more resilient than he is.\n\nUpon its release, \"Bad Guy\" received mainly positive reviews. It was also likened to music recorded by the White Stripes, Lorde, and Fiona Apple. \"Bad Guy\" was a commercial success, reaching number one on the US Billboard Hot 100; elsewhere, the song topped the charts in several other countries worldwide including Australia, Canada, Estonia, Finland, Greece, Hungary, Iceland, New Zealand, Norway, and Russia. In the United States, \"Bad Guy\" ended the record-breaking 19-week run of \"Old Town Road\" by Lil Nas X featuring Billy Ray Cyrus. \"Bad Guy\" also peaked at number two on the UK Singles Chart, among others. It has been awarded several certifications, notably a tenfold platinum award from the Australian Recording Industry Association (ARIA) and a sextuple one from the Recording Industry Association of America (RIAA). \"Bad Guy\" has received several awards, including Record and Song of the Year at the 62nd Annual Grammy Awards.\n\nDave Meyers directed the music video for \"Bad Guy\" which was uploaded onto Eilish's YouTube channel at the same time as the single's digital release. The video depicts Eilish being involved in several activities, including wild dancing, suffering a nosebleed and sitting on the back of a man doing push-ups. Reviewers noted the video for its camp elements and eccentric imagery. For promotional purposes, Eilish performed the song on several occasions and also included it on the set list for her When We All Fall Asleep Tour (2019) and Where Do We Go? World Tour (2020).", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rvvwtt1554109321.jpg", "strTrack3DCase": "https://www.theaudiodb.com/images/media/track/3dcase/stptvs1560338945.png", "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=DyDfgMOUjCI", "strMusicVidDirector": "Dave Meyers", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "1184569571", "intMusicVidLikes": "17497396", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "828739", "intTrackNumber": "2", "intLoved": "0", "intScore": "10", "intScoreVotes": "3", "intTotalListeners": "499318", "intTotalPlays": "6567892", "strMusicBrainzID": "694da04d-1ffc-435c-8b4b-59cc23ac8003", "strMusicBrainzAlbumID": "72375978-a9a1-4254-b957-85565c716b7e", "strMusicBrainzArtistID": "f4abc0b5-3f7a-4eff-8f78-ac078dbce533", "strLocked": "Unlocked"}]}