{"track": [{"idTrack": "35180732", "idAlbum": "2317918", "idArtist": "112907", "idLyric": null, "idIMVDB": "0", "strTrack": "Con calma", "strAlbum": "Con calma", "strArtist": "Daddy Yankee", "strArtistAlternate": null, "intCD": null, "intDuration": "192000", "strGenre": "Rap", "strMood": "Energetic", "strStyle": "Latin", "strTheme": "Party", "strDescriptionEN": "\"Con Calma\" (English: \"Calmly\") is a song by Puerto Rican rapper Daddy Yankee featuring Canadian rapper Snow. The single was released on January 24, 2019 by El Cartel Records alongside a music video directed by Marlon Peña and filmed in Los Angeles and Toronto, which features a Memoji (Animoji) of Daddy Yankee dancing with a crew. The track is a reimagination of Snow's 1992 single \"Informer\". The song was written by Daddy Yankee, Snow, and Juan \"Gaby Music\" Rivera, and was produced by American production duo Play-N-Skillz and co-produced by David \"Scott Summers\" Macias. A remix version featuring American singer Katy Perry was released on April 19, 2019. \nIt has been described as an uptempo reggaeton and dancehall song with lyrics about \"a woman who works her feminine charms and dances very well\". Commercially, the song topped the charts of 20 countries and reached the top 10 of 10 others. In the United States, it has topped the Hot Latin Songs chart for 11 weeks. Across Europe, the single peaked at number one in Czech Republic, Italy, the Netherlands, Slovenia, and Spain, and reached the top five in Belgium, Poland, and Switzerland. The song also became the longest-reigning number-one on the Argentina Hot 100, with 10 weeks. \nThe music video for \"Con Calma\" was directed by Dominican filmmaker and director Marlon Peña, who had previously worked with Daddy Yankee on clips including \"Mayor Que Yo\" (2005), \"Shaky Shaky\" (2016), and \"Hielo\" (2018), among others. Filming took place in Los Angeles and Toronto. The official music video on YouTube was released on Daddy Yankee's channel on January 24, 2019. It features an Animoji version of a younger Daddy Yankee named Sikiri. The character dances alongside a dancing crew from Chapkis Dance Family wearing sweatshirts and long pants throughout the entire music video, while Daddy Yankee and Snow have brief appearances during their respective verses. The dancers were choreographed by Greg Chapkis and Dylan Michael. \nAs of June 2019, the video has received over 1.1 billion views, making it the most viewed video released in 2019.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qwwusv1563218903.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://youtu.be/DiItGE3eAyQ", "strMusicVidDirector": "Marlon Peña", "strMusicVidCompany": "Capitol", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "1748942510", "intMusicVidLikes": "8358227", "intMusicVidDislikes": "595749", "intMusicVidFavorites": "0", "intMusicVidComments": "303556", "intTrackNumber": "1", "intLoved": "3", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "88242", "intTotalPlays": "550229", "strMusicBrainzID": "f7804162-6ca7-4f8e-8bdf-029b6636f29e", "strMusicBrainzAlbumID": "dfd2a3ec-c2db-428a-9451-65ed4794eb74", "strMusicBrainzArtistID": "2f522f5c-111c-4ce8-8bd0-d82e97c227ad", "strLocked": "Unlocked"}]}