{"track": [{"idTrack": "35082452", "idAlbum": "2308849", "idArtist": "111236", "idLyric": null, "idIMVDB": "0", "strTrack": "Shallow", "strAlbum": "A Star Is Born Soundtrack", "strArtist": "Lady Gaga", "strArtistAlternate": null, "intCD": null, "intDuration": "216000", "strGenre": "Pop", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"Shallow\" is a song performed by American singer Lady Gaga and American actor and filmmaker Bradley Cooper. It was released through Interscope Records on September 27, 2018 as the lead single from the soundtrack of the 2018 musical drama film, A Star Is Born. \"Shallow\" was written by Gaga with Andrew Wyatt, Anthony Rossomando and Mark Ronson, and produced by Gaga with Benjamin Rice. The song is heard three times throughout the film, most prominently during a sequence when Cooper's character Jackson Maine invites Gaga's character Ally to perform it onstage with him. The scene was filmed in front of a live audience at the Greek Theater in Los Angeles, California. \n\"Shallow\" is a pivotal moment in A Star Is Born, since it speaks about Ally and Jackson's conversations. Gaga wrote it from Ally's point of view with the self-aware lyrics asking each other if they are content being who they are. A rock power ballad, the song finds Gaga and Cooper trading verses and gradually moves toward the climactic final chorus with a vocal run by Gaga. The recording is interspersed with the sound of audience noise and applause. Gaga premiered it on DJ Zane Lowe's Beats 1 radio show while giving an interview about the film. An accompanying music video was also released, showing both Cooper and Gaga's characters singing \"Shallow\" together onstage, interspersed with scenes from A Star Is Born. \nThe track received acclaim from music critics who praised Gaga's vocals, the dramatic nature of the composition and the songwriting while feeling it worthy of award nominations. Commercially, the song topped the record charts in more than a dozen countries, and reached the top ten elsewhere. It received numerous accolades, including the Academy Award for Best Original Song, the Golden Globe Award for Best Original Song, the BAFTA Award for Best Film Music and the Critics' Choice Movie Award for Best Song. It garnered four Grammy Award nominations, including Record of the Year and Song of the Year while winning for Best Pop Duo/Group Performance and Best Song Written for Visual Media. The song was performed live at the 61st Annual Grammy Awards, the 91st Academy Awards, and serves as the encore to Gaga's Las Vegas residency show, Enigma.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/tpwsvy1562154253.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": "0", "intMusicVidComments": "0", "intTrackNumber": "12", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "ebfb2952-e857-4cd8-835d-587495552a49", "strMusicBrainzAlbumID": "86ada260-4985-4616-90e4-ee1c7e65d93b", "strMusicBrainzArtistID": "650e7db6-b795-4eb5-a702-5ea2fc46c848", "strLocked": "Unlocked"}]}