{"track": [{"idTrack": "35286934", "idAlbum": "2327295", "idArtist": "111352", "idLyric": null, "idIMVDB": "2147483647", "strTrack": "You Need to Calm Down", "strAlbum": "Lover", "strArtist": "Taylor Swift", "strArtistAlternate": null, "intCD": null, "intDuration": "171000", "strGenre": "Pop", "strMood": "Energetic", "strStyle": "...", "strTheme": "In Love", "strDescriptionEN": "\"You Need to Calm Down\" is a song by American singer-songwriter Taylor Swift. It was released on June 14, 2019, as the second single from her seventh studio album, Lover (2019). Swift wrote and produced the song with Joel Little, who also co-wrote and co-produced her previous single \"Me!\". Swift addresses homophobia and her critics in the song while at the same time giving her support for the LGBTQ+ community. Music critics were divided with \"You Need to Calm Down\"; while some critics stated this song as being mediocre, cynical, confusing, and lack of vulnerability, it received praise for an improvement over the lead single and pro-LGBT message.\n\nThe song debuted at number one in the charts in Scotland, while reaching the top five in Australia, Canada, Ireland, Malaysia, New Zealand, the United Kingdom and the United States.\n\nThe accompanying music video was directed by Swift and Drew Kirsch, and executive produced by Swift and Todrick Hall. It was released on June 17, 2019, after a premiere on Good Morning America. The video featured a large number of celebrity cameos, many of whom are LGBT. In order of appearance, the list includes dancer Dexter Mayfield, lesbian YouTuber Hannah Hart, transgender actress Laverne Cox, gay model Chester Lockhart, gay entertainer Todrick Hall, lesbian singer Hayley Kiyoko, gay actor Jesse Tyler Ferguson, lawyer Justin Mikita, singer Ciara, Netflix series Queer Eye's Fab Five (Tan France, Bobby Berk, Karamo Brown, Antoni Porowski, Jonathan Van Ness), gay figure skater Adam Rippon, gay singer Adam Lambert, lesbian television personality Ellen DeGeneres, gay entertainers Billy Porter and RuPaul, singer Katy Perry, and actor Ryan Reynolds. The appearance of Perry serves as an end to a dispute between her and Swift, although both artists had publicly ended the feud several months prior. A number of impersonators, most of whom are drag queens and past contestants on RuPaul's Drag Race, also appear in the video impersonating various female singers such as Ariana Grande and Lady Gaga. The video was shot on a set in Santa Clarita, California.\n\nThe video was nominated in nine categories at the 2019 MTV Video Music Awards, winning two awards, including Video of the Year, Swift's second award in the category.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/ypxxtp1566812618.jpg", "strTrack3DCase": "https://www.theaudiodb.com/images/media/track/3dcase/rxqsxt1566812652.png", "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=Dkk9gvTmCXY", "strMusicVidDirector": "Drew Kirsch|Taylor Swift", "strMusicVidCompany": "Happy Place", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "153038914", "intMusicVidLikes": "3313458", "intMusicVidDislikes": "278627", "intMusicVidFavorites": "0", "intMusicVidComments": "233895", "intTrackNumber": "14", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "b930f15a-86cb-4ea6-82a4-83b6006ef482", "strMusicBrainzAlbumID": "30e9785b-7b50-4d29-b3d1-96fb55e3397f", "strMusicBrainzArtistID": "20244d07-534f-4eff-b4d4-930878889970", "strLocked": "Unlocked"}]}