{"track": [{"idTrack": "32921476", "idAlbum": "2126013", "idArtist": "113659", "idLyric": "0", "idIMVDB": null, "strTrack": "Don't Wanna Go Home", "strAlbum": "Future History", "strArtist": "Jason Derulo", "strArtistAlternate": null, "intCD": null, "intDuration": "206000", "strGenre": "Hip-Hop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Don't Wanna Go Home\" is a song by American recording artist Jason Derülo, released as the lead single from his second studio album Future History on May 20, 2011. The song was written by Derülo, Chaz Mishan, David Delazyn, William Attaway, Irving Burgie, Allen George and Fred McFarlane. It was produced by The Fliptones, Tim Roberts and Heather Jeanette. Derülo explained that \"Don't Wanna Go Home\" is a feel-good song that he wrote so that people could escape their problems, their pain and their turmoil. Musically, \"Don't Wanna Go Home\" is an up-tempo electropop and dance-pop song that samples Robin S.' 1993 single, \"Show Me Love\" and incorporates an interpolation of Harry Belafonte's 1956 single, \"Day-O (The Banana Boat Song)\". Lyrically, the song finds Derülo at a club where he is having the time of his life and does not want to leave.\n\n\"Don't Wanna Go Home\" received mixed to positive reviews; some music critics praised its production and lyrics, while others observed its lack of originality. In the United States, \"Don't Wanna Go Home\" peaked at number 14 on the Billboard Hot 100 chart, and at number four on the Hot Dance Club Songs chart. It also attained top 10 positions in Australia, Austria, Canada, Hungary and Ireland, and reached the top 20 in Denmark, Germany, Netherlands, New Zealand, Slovakia, Spain and Switzerland. In the United Kingdom, \"Don't Wanna Go Home\" debuted at number one and became Derülo's second consecutive number-one single in that country, following \"In My Head\" (2010). The accompanying music video was directed by Rich Lee, and features Derülo in various dance sequences at an industrial warehouse, as well as a cameo appearance by Melody Thornton. To promote the song, Derülo performed \"Don't Wanna Go Home\" live on televised shows, including America's Got Talent, Live with Regis and Kelly and at the 2011 Teen Choice Awards.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/tpuxuy1359348376.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=2CGF_Z3yZAo", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "116904747", "intMusicVidLikes": "313501", "intMusicVidDislikes": "13386", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "1", "intScore": null, "intScoreVotes": null, "intTotalListeners": "150616", "intTotalPlays": "900871", "strMusicBrainzID": "2efbf2e9-41f6-45ac-bdc0-efb4c953316d", "strMusicBrainzAlbumID": "047885e0-3072-410e-8860-825235ab5d29", "strMusicBrainzArtistID": "6de0f914-3e60-4418-be3b-42e0feb6eb4d", "strLocked": "Unlocked"}]}