{"track": [{"idTrack": "32849941", "idAlbum": "2120401", "idArtist": "111827", "idLyric": "0", "idIMVDB": "0", "strTrack": "E.T.", "strAlbum": "Teenage Dream", "strArtist": "Katy Perry", "strArtistAlternate": "Katy Hudson", "intCD": null, "intDuration": "206000", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"E.T.\" is a song by American recording artist Katy Perry taken from her third studio album Teenage Dream (2010). The song was written by Perry, Lukasz Gottwald, Max Martin, and Joshua Coleman, while the production was handled by Gottwald under his stage name Dr. Luke, Martin and Ammo. \"E.T.\" was originally released as the album's third promotional single on August 17, 2010. However, on February 16, 2011, it was released as the fourth official single from Teenage Dream. The single version features additional rap verses by American rapper Kanye West, this version was included in the 2012 re-release of Teenage Dream, Teenage Dream: The Complete Confection.\n\nPlayed over a \"stomp-stomp-clap\" beat similar to Queen's \"We Will Rock You\" (1977), \"E.T.\" is an electronic and hip hop ballad influenced by drum n' bass, rave, techno, and dubstep, that tells of \"falling in love with a foreigner\". Extraterrestrial metaphors are used throughout the song's lyrics, and West's vocals make heavy use of Auto-Tune at times. The song is set in slow tempo with 75/150 beats per minute. Critics compared the song to several artists, including Rihanna, Evanescence, t.A.T.u. and Queen.\n\nThe song peaked at number one in the United States, Canada, New Zealand and Poland as well as within the top five in Australia, Ireland and the United Kingdom and the top 20 in ten other European countries. \"E.T\" received mixed reviews from music critics, some critics complimented Perry's vocals throughout the song, while West's rapping style received a mixed response.\n\nAn accompanying music video was directed by Floria Sigismondi. The video shows Perry and West singing in outer space. Upon its release on MTV.com on March 31, 2011 the video received positive reviews from critics. Perry performed the song during her California Dreams Tour (2011) and on some television appearances such as American Idol. Just like previous Teenage Dream singles, \"E.T.\" has been widely used as a cover song. On January 5, 2012, According to Nielsen Broadcast Data Systems was elected the fourth most played single on U.S. radio during 2011 with 526,000 plays.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rqysvv1359422836.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=t5Sd5c4o9UM", "strMusicVidDirector": "Floria Sigismondi", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "548821019", "intMusicVidLikes": "2592801", "intMusicVidDislikes": "190153", "intMusicVidFavorites": "0", "intMusicVidComments": "324013", "intTrackNumber": "8", "intLoved": "2", "intScore": null, "intScoreVotes": null, "intTotalListeners": "601979", "intTotalPlays": "5530921", "strMusicBrainzID": "958d65cf-fe3f-4cd5-b4a2-67429f23af6c", "strMusicBrainzAlbumID": "e6f683c9-fc85-412c-a352-d6e411fc2603", "strMusicBrainzArtistID": "122d63fc-8671-43e4-9752-34e846d62a9c", "strLocked": "Unlocked"}]}