{"track": [{"idTrack": "32730846", "idAlbum": "2110288", "idArtist": "111282", "idLyric": "71677", "idIMVDB": null, "strTrack": "Hold It Against Me", "strAlbum": "Femme Fatale", "strArtist": "Britney Spears", "strArtistAlternate": "Britney", "intCD": null, "intDuration": "228826", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Hold It Against Me\" is a song by American recording artist Britney Spears, released as the first single from her seventh studio album, Femme Fatale. It was written and produced by Max Martin, Dr. Luke and Billboard, with additional writing by Bonnie McKee. Luke explained that he wanted \"Hold It Against Me\" to sound unlike his previous productions. The song was going to be offered to Katy Perry, but Luke and Martin felt that it did not suit her. A demo version of the track by McKee was leaked on January 6, 2011, and the single became available for streaming on January 10, 2011. It was released the following day.\n\nMusically, \"Hold It Against Me\" blends pulsating industrial and trance beats with elements of grime. The chorus has lilting synths that lift her vocals and contrast them with the hard beats. The song features a dubstep-influenced breakdown, in which Spears moans and blows kisses, and the song ends with a final chorus with elements of rave. The lyrics portray the singer seducing someone on the dancefloor, and the chorus revolves around pick-up lines. After the song was released, The Bellamy Brothers criticized it for being similar to their 1979 hit \"If I Said You Had a Beautiful Body Would You Hold It Against Me\". They were sued by Martin, Luke, McKee and Billboard for defamation and libel, but the case was dismissed after The Bellamy Brothers apologized.\n\nMost reviewers praised \"Hold It Against Me\", although some criticized its lyrical content. The song debuted at number one in Belgium (Wallonia), Canada, Denmark, Finland and New Zealand, as well as on the US Billboard Hot 100, where it became her fourth chart topper. In the United States, \"Hold It Against Me\" made Spears the second artist in Billboard's history to debut at number one more than once, behind Mariah Carey. \"Hold It Against Me\" was Spears's second consecutive single to debut at number one. The feat also made her the third female artist to score number one singles in three consecutive decades, and the seventh artist overall. In 2012, it was voted the best song to reach the top position on the Hot 100 over the past two years. The single has also charted in the top five in countries such as Australia, Ireland, Italy, Scotland, Finland and Norway.\n\nThe accompanying music video for the song was directed by Jonas Åkerlund. It premiered on February 17, 2011, following a two-week promotional campaign of teasers. The video features Spears as a pop star who fell from space to find fame on Earth. There, she becomes overwhelmed by the pressures of being a celebrity and breaks down. The video received mixed to positive reviews; critics complimented its artistic concept and visuals, but dismissed the use of product placement. Spears performed \"Hold It Against Me\" at Rain Nightclub, Good Morning America and Jimmy Kimmel Live!. She has also performed it as the opening number of the Femme Fatale Tour (2011).", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/suvsqq1359595542.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=-Edv8Onsrgg", "strMusicVidDirector": "Jonas Akerlund", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "97361668", "intMusicVidLikes": "284560", "intMusicVidDislikes": "51056", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "2", "intScore": "8", "intScoreVotes": "3", "intTotalListeners": "336473", "intTotalPlays": "6117475", "strMusicBrainzID": "4b6ad952-257a-4f39-99bb-ed30e6036fd8", "strMusicBrainzAlbumID": "a7e9d7d2-3c60-472f-b2ba-829de5034179", "strMusicBrainzArtistID": "45a663b5-b1cb-4a91-bff6-2bef7bbfdd76", "strLocked": "Unlocked"}]}