{"track": [{"idTrack": "32730848", "idAlbum": "2110288", "idArtist": "111282", "idLyric": "71679", "idIMVDB": "0", "strTrack": "I Wanna Go", "strAlbum": "Femme Fatale", "strArtist": "Britney Spears", "strArtistAlternate": "Britney", "intCD": null, "intDuration": "210266", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"I Wanna Go\" is a song by American recording artist Britney Spears, released as the third single from her seventh studio album, Femme Fatale (2011). It was written and produced by Max Martin and Shellback, with additional writing by Savan Kotecha. Spears first posted on her Twitter account a link to a clip of the song in February 2011, prior to the album's release. Following a poll on her official website, \"I Wanna Go\" was chosen as the third single of the album, and Jive Records released it on June 13, 2011.\n\n\"I Wanna Go\" is a dance song that features a heavy bassline and drum fills reminiscent of English rock band New Order. The pre-chorus has a whistled hook that received comparisons to the music of Bob Sinclar and Frankie Knuckles. The lyrics of \"I Wanna Go\" feature Spears singing about losing inhibitions. The song received mixed to positive reviews from critics. Some praised it for being effective and highlighted its hook, while others dismissed the processed vocals. The song was treated with different remixes, including a Bollywood mix with guest vocals by Sonu Nigam and another one by DJ Frank E and Alex Dreamz.\n\nAfter the release of Femme Fatale, \"I Wanna Go\" charted due to digital sales in the lower end of the US Billboard Hot 100 and the Canadian Hot 100, and also topped the South Korean International chart. Following its release as a single, the song reached the top ten in several music markets, including Canada, France, Finland and the United States. However, it became one of her lowest peaking singles in countries such as Australia and New Zealand, and was the first single of her career that failed to chart inside the top 100 in the United Kingdom. In the United States, \"I Wanna Go\" made Femme Fatale the first album by Spears to have three top ten singles.\n\nAn accompanying music video for the song, directed by Chris Marrs Piliero, premiered on June 22, 2011. It depicts Spears daydreaming at a press conference about a series of events, including being chased by paparazzi cyborgs and being rescued by actor Guillermo Díaz. Piliero described the video as \"a ridiculous, exaggerated rumor about her life and career\". The video references films such as Half Baked, Crossroads, Terminator 2: Judgment Day and Michael Jackson's Thriller. It received positive reviews from critics, who praised its fun spirit. Spears has performed \"I Wanna Go\" on the Femme Fatale Tour (2011).", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/ypwwvy1359595740.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=T-sxSd1uwoU", "strMusicVidDirector": "Chris Marrs Piliero", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "174597080", "intMusicVidLikes": "531131", "intMusicVidDislikes": "42627", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "4", "intLoved": "2", "intScore": "8", "intScoreVotes": "3", "intTotalListeners": "332011", "intTotalPlays": "4043514", "strMusicBrainzID": "113b6fbc-8a9a-40f1-ae9f-538ba2a93ae7", "strMusicBrainzAlbumID": "a7e9d7d2-3c60-472f-b2ba-829de5034179", "strMusicBrainzArtistID": "45a663b5-b1cb-4a91-bff6-2bef7bbfdd76", "strLocked": "Unlocked"}]}