{"track": [{"idTrack": "32825756", "idAlbum": "2118429", "idArtist": "112461", "idLyric": "286348", "idIMVDB": null, "strTrack": "Just a Kiss", "strAlbum": "Own the Night", "strArtist": "Lady Antebellum", "strArtistAlternate": null, "intCD": null, "intDuration": "221000", "strGenre": "Rock", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Just a Kiss\" is a song by American country music group Lady Antebellum. It was released on May 2, 2011 by Capitol Records as the lead single from the band's third studio album, Own the Night (2011). Dallas Davidson collaborated with band members Hillary Scott, Charles Kelley and Dave Haywood to write the song, taking inspiration from the members' personal experiences. Produced by Paul Worley, \"Just a Kiss\" was among the last songs recorded for the album, and is a mid-tempo country ballad with lyrics that speak of a romantic relationship between two new couples. Professional reviews for \"Just a Kiss\" have been mostly positive, commending on the song's theme and musical arrangement and also praising Lady Antebellum's performance.\n\nIn the United States, the song debuted at number 28 on the Billboard Hot Country Songs chart and appeared at number seven on the Billboard Hot 100. It later topped the Country chart and was certified 2× Platinum by the Recording Industry Association of America (RIAA). The song peaked at number 13 in Canada, 22 in Japan and reached the top 80 in Australia and Slovakia. Shaun Silva directed a well-received music video for the song. It portrays the story of two young lovers against a backdrop of scenery of Europe. The band first performed the song on their Houston Rodeo show on March 11, 2011, and later at the Divas Nashvegas benefit show. Following the single's release, they performed it on US reality television show American Idol and at the Billboard Music Awards. The group's live performances have been praised by critics. The song was featured in the season 2 finale of Pretty Little Liars and in the season 1, episode 17 of Hart of Dixie.\n\nAfter the 53rd Grammy Awards, held in February 2011, band members Charles Kelley and Dave Haywood said in a backstage interview that work on the group's third album was almost complete. On May 2, 2011, the band digitally released \"Just a Kiss\", the lead single from the new project. In a blog entry on their website, the group said that \"Just a Kiss\" was among the last songs that were written for the album. Haywood commented, \"We were about six songs into recording and someone had this idea, so we sat down to write it.\" Hillary Scott, Kelley and Haywood wrote the song with Dallas Davidson. Davidson discussed the conception of the song with country music blog Taste of Country: \"I went out on the road with them, and we wrote a couple of things. We recorded one song called 'We Own the Night'. Charles called me as they were about done with the record. He said, 'Man, we want to write again.' So the band came over [to my office] one morning. We started writing this other song. We were trying to find Hillary a little uptempo girl song. We wrote this cool thing.\"\n\nThe next day, Davidson found Haywood in his office, playing the keyboard part which was later revived for the song's riff. \"When we got done with the other song, I kept going back, saying, 'Man, there's something about what you were playing earlier ... let's mess with that before we leave.' So he started playing it again,\" Davidson recalled. After the keyboard elements were completed, Scott and Kelley finished the song's music and lyrics at the studio. They discussed ideas for the song; Kelley put forward the basic melody and Scott followed up with her own contribution. After they wrote the lyrics, Davidson proposed that the song's title be \"Just a Kiss Goodnight\". It was later changed to \"Just a Kiss\" after Scott felt that \"it's cool to have 'just a kiss' goodnight rather than going all the way.\" Kelley told Country Weekly that the song was inspired by the band members' experiences: \"I remembered being out the first night with Cassie and thinking, 'This is different, and I don't want to give any wrong impression. I don't want to make the wrong move because this feels like something special.' We started talking about that and going back and forth with different experiences when we wrote the song.\" The song was recorded and mixed by Clarke Schleicher, with assistance from Joe Martino and Andrew Bazinet. The B-side track, \"Bottle Up Lightning\", was written by Kelley, Haywood, Tony Martin and Wendell Lee Mobley\n\nBobby Peacock of Roughstock gave \"Just a Kiss\" a rating of four stars out of five and called it \"another excellent song that plays up all of the band's strengths.\" Erik Ernst of Milwaukee Journal Sentinel observed that the track's \"lush melody\" shows \"new confidence for these musicians who have become bona fide stars.\" A Washington Post editor also gave a positive review, declaring \"Just a Kiss\" as \"one of the group's finest\". Daryl Addison, writing for Great American Country, commended the group's vocal chemistry in the song, adding that \"[t]he group's dynamic allows them to explore a wide range of emotions as they each add their own voice.\" Melinda Newman of HitFix suggested that \"Just a Kiss\" is \"a good summer song for young lovers.\" Robbie Daw of music website Idolator commented that the song \"deftly captures\" the state of nervousness that lovers experience during the early stages of the romance. Leah Greenblatt of Entertainment Weekly also praised \"Just a Kiss\" and noted that Lady Antebellum sing the song \"like they mean it\". He suggested that the song is \"classy and very sincere\". Stephen Hyden of The A.V. Club wrote that the song was \"painfully chaste\".\n\n\"Just a Kiss\" debuted on the US Billboard Hot Country Songs chart at number 28 on May 21, 2011. According to Nielsen BDS, the song opened with a first week audience of 6 million across 85 radio stations, becoming the group's highest debut to date. It marked the third highest debut on the chart among groups at the time, after Rascal Flatts's \"Take Me There\" and Sugarland's \"All I Want to Do\". The following week, the song ascended to number 20 on the chart, with the Greatest Gainer mark and soon became the band's fifth number-one hit. On the Billboard Hot 100, \"Just a Kiss\" debuted and peaked at number seven, setting a record for the highest debut on the chart for a country group. The song debuted at number three on the Hot Digital Songs chart due to sales of 211,000 downloads.\n\n\"Just a Kiss\" stayed on the Hot 100 for 42 weeks and was certified 2× Platinum by the Recording Industry Association of America (RIAA) for sales of two million digital units. The song has also charted and peaked at number 21 on the Pop Songs chart, number one on the Adult Contemporary chart and number six on the Adult Pop Songs chart. In Canada, the song debuted and peaked on the Canadian Hot 100 at number thirteen, selling 15,000 units in its first week. It has stayed on the chart for 24 weeks and was certified Platinum by Music Canada for downloads of 80,000 units. In Slovakia, \"Just a Kiss\" charted for three weeks on the Singles chart and peaked at number 73. In Japan, it peaked at number 21 on the Japan Hot 100. The song also charted and peaked in the United Kingdom and Australia, at number 78 and number 72, respectively, for one week, and at number 91 in the Netherlands.\n\nThe music video, directed by Shaun Silva, was filmed in Paris, London, and Murfreesboro, Tennessee.[38] The Union Station hotel is featured as a train station in the video.[37] Kelley explained that the director decided to shoot parts of the music video in Europe because he wanted the video to be \"as authentic as possible\".[37] The video begins with a young woman, Joy,[39] entering a train and looking at her iPad. The iPad has a video of her boyfriend writing French words on a paper that mean \"Don't forget about me\", and also some videos of the couple's travels to France and England, after which the couple bid each other farewell. A subsequent scene shows Joy's boyfriend finding her sitting on a train seat and they share a kiss. Joy then dreams about being together with a new boyfriend. A man, Brady, who looks like the new boyfriend in the dream[39] sits next to Joy, which awakens her from her sleep. Brady apologizes for waking her and asks if she minds if he sits next to her. Joy tells him about her strange dream,[38] and the two introduce each other. Brady then takes his case, seemingly an iPad, and smiles at her. Joy smiles back, flattered. The group members are seen singing at a Tennessee train station, and on the train itself.\n\nThe band released teaser trailers first, and the full video premiered on June 27, 2011, 1 pm (Eastern Time), on the band's website.Jon Blistein of Billboard commented that the video \"is sweet and will probably make you smile.\" AOL's The Boot also liked the video, writing, \"If the storyline itself doesn't make you fall head over heels, the gorgeous scenery surely will, as the clip was shot in various picturesque places around the world.\" Amy Sciarretto of Taste of Country noted that the video was \"heart-pinching\". The Tennessean wrote that the \"sweet sentimentality should score with fans of ... 'Need You Now'.\" However, Melinda Newman of HitFix deemed the video \"sugary\". Robbie Daw of Idolator wrote, \"Lady A's [...] \"Just A Kiss\" video got us choked up after one viewing. Clearly we need to get out more.\"", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uvuqss1359673759.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=v_yTphvyiPU", "strMusicVidDirector": "Shaun Silva", "strMusicVidCompany": "Tacklebox Films", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "42057530", "intMusicVidLikes": "226290", "intMusicVidDislikes": "2929", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "170060", "intTotalPlays": "1055918", "strMusicBrainzID": "ec736f39-9031-4bf4-b459-2711bce74757", "strMusicBrainzAlbumID": "6665318a-6c4a-4fec-80f4-d6a31ec2f57b", "strMusicBrainzArtistID": "0eedfc95-e79a-4fd9-832a-cd816a0b3fda", "strLocked": "Unlocked"}]}