{"track": [{"idTrack": "32849935", "idAlbum": "2120401", "idArtist": "111827", "idLyric": "270261", "idIMVDB": "0", "strTrack": "Last Friday Night (T.G.I.F.)", "strAlbum": "Teenage Dream", "strArtist": "Katy Perry", "strArtistAlternate": "Katy Hudson", "intCD": null, "intDuration": "230000", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Last Friday Night (T.G.I.F.)\" is a song by American recording artist Katy Perry. The song was produced by Lukasz Gottwald and Max Martin, who also co-wrote the song with Perry and Bonnie McKee at Playback Recording Studio for Perry's third studio album, Teenage Dream. Perry stated that she was inspired to write the track after a night of wild partying and streaking. It was released as the album's fifth single on June 6, 2011 through Capitol Records with a remix featuring American hip-hop recording artist Missy Elliott released to U.S. radio stations and digital retailers on August 8, 2011, this version was included in Teenage Dream: The Complete Confection edition. Musically, the song is a prominent disco, and NRG-pop song with dance-pop influences, while the lyrics are about drunken fun and debauchery. Some of the risque lyrics in the song are often censored in radio versions of the song.\n\nThe song received mixed to positive reviews from music critics, with some of them highlighting its playful and catchy nature. However, critics were divided regarding the song's lyrical content; some referred it to as funny and sexy, while others dismissed it as lifeless. The song had chart success in North America, reaching number one on the U.S. Billboard Hot 100 and Canadian Hot 100. It also topped U.S. charts like Hot Digital Songs, Pop Songs, Radio Songs, and Hot Dance Club charts, like all of her previous singles. It also reached number one in Slovakia and the Czech Republic and has attained top-ten positions in Austria, Ireland, Italy and Poland.\n\nWith \"Last Friday Night (T.G.I.F.)\", Perry set a record for a female solo artist, having amassed five number one singles on the Billboard Hot 100 off a single album. This makes Perry the second artist in the 53 year history of the chart to amass five number one singles from a single album—the first was Michael Jackson. The song became Perry's sixth number-one single on the Billboard Hot 100 chart, and her fifth consecutive number one single. The song joins the set's first four singles, all of which reached No. 1: \"California Gurls\", featuring Snoop Dogg; \"Teenage Dream', \"Firework\", and \"E.T.\", featuring Kanye West. After the song reached number 1 in the Pop Songs airplay chart, \"Teenage Dream\" became the only album in history to have 5 number 1's from the same album on that chart. Also, when the song reached number one in the Adult Pop Songs airplay chart, the album become the only album in history to have 4 number 1's from the same album on the chart. As of February 2012, the single has sold over 3,000,000 digital copies in the United States alone. On January 5, 2012, according to Nielsen Broadcast Data Systems, \"Last Friday Night (T.G.I.F)\" was elected the tenth most played single on U.S. radio during 2011 with 450,000 plays.\n\nThe song's accompanying music video was directed by Marc Klasfeld. The clip features Perry, as her 13-year-old alter-ego Kathy Beth Terry, at a house party filled with music and dancing. While at the party, Terry is made over by her friend and draws attention to herself as the life of the party. The video features appearances by notable music artists and actors, which includes Rebecca Black, Corey Feldman, Debbie Gibson, Kenny G, Hanson, and Kevin McHale and Darren Criss of Glee. According to the director, the inspiration behind the video was Sixteen Candles, works by American filmmaker John Hughes, and other 1980s high school films. The music video won Favorite Music Video award at the 38th People's Choice Awards.\n\nThe title \"T.G.I.F.\" is an acronym for Thank God It's Friday.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uwquvp1359422591.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=KlyXNRrsk4A", "strMusicVidDirector": "Marc Klasfeld", "strMusicVidCompany": "Rockhard Films", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/tsyyqv1364483771.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/qvstws1364483780.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/xuuppw1364483802.jpg", "intMusicVidViews": "1222468526", "intMusicVidLikes": "4730086", "intMusicVidDislikes": "363977", "intMusicVidFavorites": "0", "intMusicVidComments": "388452", "intTrackNumber": "2", "intLoved": "2", "intScore": null, "intScoreVotes": null, "intTotalListeners": "694528", "intTotalPlays": "5531855", "strMusicBrainzID": "a2b6d3f6-2ab5-4522-9a40-e589fb8f6e02", "strMusicBrainzAlbumID": "e6f683c9-fc85-412c-a352-d6e411fc2603", "strMusicBrainzArtistID": "122d63fc-8671-43e4-9752-34e846d62a9c", "strLocked": "Unlocked"}]}