{"track": [{"idTrack": "33010305", "idAlbum": "2133345", "idArtist": "112950", "idLyric": "0", "idIMVDB": null, "strTrack": "Lighters", "strAlbum": "Hell: The Sequel", "strArtist": "Bad Meets Evil", "strArtistAlternate": null, "intCD": null, "intDuration": "303000", "strGenre": "Hip-Hop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Lighters\" is a song by American hip hop duo Bad Meets Evil, a group composed of Royce da 5'9\" and Eminem, featuring R&B singer Bruno Mars. As the second single from their first EP, Hell: The Sequel, Shady Records serviced the song for mainstream radio airplay in the United States on July 5, 2011. The song features American singer-songwriter Bruno Mars, who was added after the original cut. The song was written and produced by Eminem, Battle Roy and The Smeezingtons. Eminem and Royce da 5'9\" took a different approach, wanting to break the typical album format that stereotypical hip hop artists use. It also made reference to T-Pain, Wendy Williams, Kwame Kilpatrick, and Marshall.\n\n\"Lighters\" is an alternative hip hop song which has been said by critics to incorporate soul music, as well as influences of synthpop. It is noted for being different in style from any other song on the EP. The song features bass, cymbals and keyboards with percussion used in most of the song. The song was met with mixed reviews; some critics praised the change in style, as a break from more hardcore and aggressive themes of the other tracks found in Hell: The Sequel, while others criticized it for the same reason. Despite the mixed reception, the song performed generally well commercially, reaching the top ten in New Zealand, Switzerland, the United Kingdom and the United States. \"Lighters\" was performed at the 2011 Bonnaroo Music & Arts Festival and the Lollapalooza music festival.\n\nThe accompanying music video was shot in July 2011 and was directed by Rich Lee. The two rappers guide themselves through an underground tunnel with pipelines as red highway flares illuminate the setting, to reach an event by night. The video was met with positive reception for its positive and inspirational message.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/twppwt1359521141.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=YWt4wmZ_EMI", "strMusicVidDirector": "Rich Lee", "strMusicVidCompany": "DNA", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "63771537", "intMusicVidLikes": "387574", "intMusicVidDislikes": "6819", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "7", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "169325", "intTotalPlays": "726773", "strMusicBrainzID": "0a2f926b-fc6c-4123-a3ab-a0493286eeab", "strMusicBrainzAlbumID": "9efeec82-2b28-4a43-99a3-d8907014b8f0", "strMusicBrainzArtistID": "87f27b14-cbd0-44ea-93a3-6fead5cb45e7", "strLocked": "Unlocked"}]}