{"track": [{"idTrack": "32724240", "idAlbum": "2109620", "idArtist": "111240", "idLyric": "244154", "idIMVDB": "0", "strTrack": "On the Floor", "strAlbum": "Love?", "strArtist": "Jennifer Lopez", "strArtistAlternate": null, "intCD": null, "intDuration": "284866", "strGenre": "Pop", "strMood": "In Love", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"On the Floor\" is a song recorded by American recording artist and actress Jennifer Lopez featuring American rapper Pitbull. It was released by Island Records on February 8, 2011 as the lead single from her seventh studio album Love? (2011). \"On the Floor\" was written by Bilal Hajji, Kinda Hamid, Gonzalo Hermosa, Ulises Hermosa, Achraf Janussi and Pitbull, along with the song's producer RedOne. Its release coincided with Lopez's appointment as a judge on the tenth season of US reality TV show American Idol, as well as several other product endorsement deals. American Idol also provided a platform to debut the single's music video, as well as the stage for Lopez's first live performance of the song.\n\n\"On the Floor\" is an up-tempo dance, electropop and electro house song, set in common time with a tempo of 130 beats per minute. Other elements of the song are borrowed from Eurodance, Latin American and techno music, including heavy synths and club beats. Its development was motivated by Lopez's Latin heritage and pays homage to her career-beginnings as a dancer. It interpolates recurrent elements of the 1982 composition \"Llorando se fue\" written by Gonzalo and Ulises Hermosa, a composition subsequently plagiarized by Kaoma in their 1989 single \"Lambada\". Taking account of the sample, and RedOne's production, Lopez described \"On the Floor\" as an evolution of her classic sound and as something which sounded very current.\n\nUpon release, \"On the Floor\" was met with a positive reception from music critics, with editors from BBC Music and Los Angeles Times drawing comparisons to Lopez's debut single, \"If You Had My Love\" (1999) and follow-up single \"Waiting for Tonight\" (1999). Critics complimented the exotic production, referring to the sound as \"vintage\" Lopez, but criticized RedOne's lack of originality. Commercially, \"On the Floor\" is Lopez's most successful single to date, topping more than twenty national single charts. In the United States, it was Lopez's first single in four years to garner airplay, and to date has sold over three million copies, earning a triple Platinum certification. The song was also certified triple Platinum in Australia and reached Platinum status in six other countries.\n\nAn accompanying music video was directed by TAJ Stansberry and choreographed by Frank Gatson, Jr, with fans being given the chance to vote for their preferred ending for the video. The completed clip premiered simultaneously on Vevo and during the March 3, 2011 episode of American Idol, watched by 25.26 million people. It depicts a Los Angeles underground club culture where Lopez portrays a \"queen of the nightclub\", amongst other characters. The video received critical acclaim for its expensive production, the styling and choreography, that critics felt best highlighted Lopez's abilities as a dancer.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qsyvxx1359237327.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=t4H_Zoh7G5A", "strMusicVidDirector": "TAJ Stansberry", "strMusicVidCompany": "Epic", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/qytuvt1418386892.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/swqrrt1418386899.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/swqsvr1418386905.jpg", "intMusicVidViews": "1505760841", "intMusicVidLikes": "5006767", "intMusicVidDislikes": "286337", "intMusicVidFavorites": "0", "intMusicVidComments": "368238", "intTrackNumber": "1", "intLoved": "0", "intScore": "9.5", "intScoreVotes": "2", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "d7898288-6c17-4e35-a1d1-c6d1d7e641da", "strMusicBrainzAlbumID": "193702aa-54dd-46dd-922e-faa38026bafe", "strMusicBrainzArtistID": "f0602f55-1770-483d-89bd-4bae0d0ac086", "strLocked": "Unlocked"}]}