{"track": [{"idTrack": "32734785", "idAlbum": "2110674", "idArtist": "111305", "idLyric": "417650", "idIMVDB": null, "strTrack": "Only Girl (in the World)", "strAlbum": "Loud", "strArtist": "Rihanna", "strArtistAlternate": "Robyn Rihanna Fenty", "intCD": null, "intDuration": "235000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Only Girl (In the World)\" is a song by recording artist Rihanna from her fifth studio album, Loud (2010). The song was released as the album's lead single on September 10, 2010 through Def Jam. It was written by Crystal Johnson, Norwegian production duo Stargate and Sandy Vee, and produced by Stargate and Vee. Musically, \"Only Girl\" is an up-tempo dance-pop song which incorporates elements of Europop. The song became the first to be completed for the album, and Rihanna chose it for inclusion before she recorded it.\n\n\"Only Girl\" was well received by music critics, complimenting its beat, as well as the direction of moving away from the darker themes which were present on Rated R (2009). \"Only Girl\" debuted at number seventy-five on the US Billboard Hot 100 and peaked at number one in its eleventh week, giving Rihanna her ninth number one single on the chart. The song reached number one in other countries, including Australia, Ireland, Italy, Poland, Norway and the United Kingdom. It also attained top-five positions in the Czech Republic, France and Germany.\n\nThe song's accompanying music video was directed by Anthony Mandler and filmed outside of Los Angeles. The video uses the simplistic theme of predominantly focusing on Rihanna frolicking on a hillside with life size flowers placed near her with an array of artistic sceneries and props. The song was performed for the first time on Saturday Night Live, as well as at 2010 American Music Awards in Los Angeles as part of a medley with \"Love the Way You Lie (Part II)\" and \"What's My Name?\". The song won Best Dance Recording at the 53rd Grammy Awards held in Los Angeles on February 13, 2011. American singer Katy Perry covered the song during her California Dreams Tour (2011/2012).", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xutwxx1359564152.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=pa14VNsdSYM", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "364693595", "intMusicVidLikes": "742741", "intMusicVidDislikes": "33477", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "5", "intLoved": "0", "intScore": "8", "intScoreVotes": "2", "intTotalListeners": "619184", "intTotalPlays": "6650094", "strMusicBrainzID": "e6d894a9-8593-4b90-966a-9ce743365c3e", "strMusicBrainzAlbumID": "7c6de97d-bf6a-4793-82f5-f142baed33e6", "strMusicBrainzArtistID": "73e5e69d-3554-40d8-8516-00cb38737a1c", "strLocked": "Unlocked"}]}