{"track": [{"idTrack": "32988975", "idAlbum": "2131565", "idArtist": "114500", "idLyric": "273689", "idIMVDB": null, "strTrack": "Pretty Girl Rock", "strAlbum": "No Boys Allowed", "strArtist": "Keri Hilson", "strArtistAlternate": null, "intCD": null, "intDuration": "0", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Pretty Girl Rock\" is a song by American R&B recording artist Keri Hilson, taken from her second studio album, No Boys Allowed (2010). It was released as the lead single internationally and was the second single from that album released in the United States. The song was written by Bill Withers, Ralph MacDonald, William Salter, Ne-Yo and Chuck Harmony, who also handled its production. \"Pretty Girl Rock\" is a mid-tempo R&B and pop song that features a slinky piano and bouncy R&B beats. The lyrics deliver messages of self-love and female empowerment.\n\nCritical reception towards the song was mixed to positive. Music critics noted it as the standout track on the album, and praised its catchy production. However, critics were of disparate opinions on the song's lyrics. In the United States, \"Pretty Girl Rock\" peaked at number 24 on the Billboard Hot 100 chart and at number four on the Hot R&B/Hip-Hop Songs chart. The song was certified platinum by the Recording Industry Association of America (RIAA), for selling over 1,000,000 digital copies. Internationally, the song reached the top 20 in Germany and New Zealand, and the top 30 in Austria and Slovakia.\n\nAn accompanying music video for the song was directed by Joseph Kahn and features Hilson portraying an array of American female icons of the past, including Josephine Baker, Dorothy Dandridge, The Andrews Sisters, Diana Ross, Donna Summer, Janet Jackson and T-Boz of the R&B girl group TLC. The video received positive response from critics and was nominated for Video of the Year at the 2011 BET Awards, and Best Dance Performance at the 2011 Soul Train Music Awards. Hilson promoted the song through live performances on various televised shows, including The Ellen DeGeneres Show and Germany's Next Topmodel, as well as in live concerts such as, the VH1 Divas Salute the Troops and the 84th Annual Macy's Thanksgiving Day Parade. R&B girl group RichGirl and American rapper Lil' Kim have released their own remixes to \"Pretty Girl Rock\", and American rock band Parachute have covered the song.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/tquuxr1359854916.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=HtXOVKNazYU", "strMusicVidDirector": "Joseph Kahn", "strMusicVidCompany": "HSI Productions", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "51354802", "intMusicVidLikes": "198879", "intMusicVidDislikes": "8296", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "1", "intScore": null, "intScoreVotes": null, "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "629cefc7-8210-4b14-9a88-1db928751a6f", "strMusicBrainzAlbumID": "601df670-c973-4ea1-bec7-dd5cea9fcba4", "strMusicBrainzArtistID": "b76c616a-ec0d-4f0c-b986-f249c4a04d77", "strLocked": "Unlocked"}]}