{"track": [{"idTrack": "32757995", "idAlbum": "2112977", "idArtist": "111493", "idLyric": "5222", "idIMVDB": "0", "strTrack": "Rolling in the Deep", "strAlbum": "21", "strArtist": "Adele", "strArtistAlternate": null, "intCD": null, "intDuration": "229000", "strGenre": "Soul", "strMood": "In Love", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Rolling in the Deep\" is a song recorded by British singer-songwriter Adele for her second studio album, 21. The song was written by Adele and Paul Epworth, who described it as a \"dark blues-y gospel disco tune\". The largest crossover hit in the United States from the past 25 years, \"Rolling in the Deep\" gained radio airplay from many different radio formats. It was first released on 29 November 2010 as the lead single of the album in digital download format. The lyrics describe the emotions of a scorned lover.\n\n\"Rolling in the Deep\" was acclaimed by music critics and represented a commercial breakthrough for Adele, propelling her to international success. The song reached number one in 11 countries and the top five in many more regions. It was Adele's first number-one song in the United States, reaching the top spot on many Billboard charts, including the Billboard Hot 100 where it was number one for seven weeks. By February 2012, \"Rolling in the Deep\" had sold over 7,000,000 copies in the United States, making it the highest selling digital song by a female artist in the US,  the second best-selling digital song in the US and Adele's best-selling single outside her native country, topping her previous best-selling \"Chasing Pavements\". Worldwide, it was the fifth best selling digital single of 2011 with sales of 8.2 million copies.  The song spent 65 weeks on the chart, making the song the third most weeks spent on the chart, tying the place with Jewel with her double single \"Foolish Games\"/\"You Were Meant for Me\".\n\nIn July, the video was nominated for seven MTV Video Music Awards nominations, making it the most nominated music video of the year. The video won three awards: Best Editing, Best Cinematography and Best Art Direction. \"Rolling in the Deep\" was also the Billboard Year End Hot 100 Number One Single of 2011. On 12 February 2012, \"Rolling in the Deep\" received three Grammy Awards for Record of the Year, Song of the Year, and Best Short Form Music Video. Critics and music publications ranked the song highly on their end-of-year lists. The song is the first number one by British female artist since 2008's \"Bleeding Love\" by Leona Lewis on Billboard Hot 100 chart.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/urtrsw1359613495.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=rYEDA3JcQqw", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/xsutur1418649589.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/wxrvpx1418649597.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/vupvst1418649605.jpg", "intMusicVidViews": "1650642709", "intMusicVidLikes": "6873025", "intMusicVidDislikes": "250290", "intMusicVidFavorites": "0", "intMusicVidComments": "361103", "intTrackNumber": "1", "intLoved": "3", "intScore": "9.72727", "intScoreVotes": "11", "intTotalListeners": "1323086", "intTotalPlays": "13809395", "strMusicBrainzID": "1a13c710-4b7e-4701-8968-cd61f2e58110", "strMusicBrainzAlbumID": "e4174758-d333-4a8e-a31f-dd0edd51518e", "strMusicBrainzArtistID": "cc2c9c3c-b7bc-4b8b-84d8-4fbd8779e493", "strLocked": "Unlocked"}]}