{"track": [{"idTrack": "32758005", "idAlbum": "2112977", "idArtist": "111493", "idLyric": "5225", "idIMVDB": "0", "strTrack": "Someone Like You", "strAlbum": "21", "strArtist": "Adele", "strArtistAlternate": null, "intCD": null, "intDuration": "287000", "strGenre": "Soul", "strMood": "In Love", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Someone like You\" is a song by English singer-songwriter Adele. Written by Adele and Dan Wilson for her second studio album 21. The pop ballad was inspired by a broken relationship of hers, and lyrically it speaks of Adele coming to terms with it. XL Recordings released the song as the second single from the album on 24 January 2011 in the United Kingdom and on 9 August 2011 in the United States. Accompanied only by a piano in the song (played by co-writer Wilson), Adele sings about the end of the relationship with her ex-boyfriend. The song received positive reviews from music critics who chose the song as a highlight on the album and praised its simple sound. The lyrics and Adele's vocal performance in the song were also praised.\n\nFollowing a well-received performance of the song at the 2011 BRIT Awards, \"Someone like You\" became Adele's first number one single in the United Kingdom and it stayed on the top of the chart for five weeks. The song also topped the charts in Ireland, New Zealand, Australia, Brazil, Italy, France, Switzerland and has become Adele's second number one in the United States. With that achievement Adele became the first female British solo singer in the history of the Billboard Hot 100 to have two number ones from the same album. In July 2011, it became the first single of the decade to sell a million units in the United Kingdom and it was certified Platinum by the British Phonographic Industry (BPI), as well as being certified triple platinum by the Recording Industry Association of America (RIAA) in the United States.\n\nAn accompanying music video for the song was directed by Jake Nava and it was filmed in Paris, France. The video showed Adele walking alone through the streets with a sad look on her face. Critics praised the video for being simple and perfect for the sound of the song. Adele performed the song on several award and television shows including the 2011 BRIT Awards, 2011 MTV Video Music Awards, Jimmy Kimmel Live! and The Ellen DeGeneres Show. She additionally added the song on the set list of her second tour Adele Live. The live performances of the song were heavily praised by music critics and fans. \"Someone like You\" was the first recipient of the Grammy Award for Best Pop Solo Performance at the 54th Grammy Awards, held on 12 February 2012.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/ysuxqr1361038627.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=hLQl3WQQoQ0", "strMusicVidDirector": "Jake Nava", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/qswqvq1419256842.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/spsqvt1419256849.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/rrwyvs1419256856.jpg", "intMusicVidViews": "1461675455", "intMusicVidLikes": "6439557", "intMusicVidDislikes": "230453", "intMusicVidFavorites": "0", "intMusicVidComments": "299377", "intTrackNumber": "11", "intLoved": "0", "intScore": "9.54545", "intScoreVotes": "11", "intTotalListeners": "1064699", "intTotalPlays": "10606122", "strMusicBrainzID": "028efe7f-cdfb-4135-846f-848f2fff15b1", "strMusicBrainzAlbumID": "e4174758-d333-4a8e-a31f-dd0edd51518e", "strMusicBrainzArtistID": "cc2c9c3c-b7bc-4b8b-84d8-4fbd8779e493", "strLocked": "Unlocked"}]}