{"track": [{"idTrack": "32723943", "idAlbum": "2109593", "idArtist": "111236", "idLyric": "0", "idIMVDB": null, "strTrack": "The Edge of Glory", "strAlbum": "Born This Way", "strArtist": "Lady Gaga", "strArtistAlternate": null, "intCD": null, "intDuration": "320000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"The Edge of Glory\" is a song by American recording artist and songwriter Lady Gaga, from her second studio album Born This Way (2011). The song was released digitally on May 9, 2011, and was added to the United States mainstream radio playlists on May 17, 2011. Initially released as one of two promotional singles for Born This Way, it shortly became the third single for the album following its success in digital outlets worldwide. The song was produced by Lady Gaga and Fernando Garibay. \"The Edge of Glory\" is a dance song that speaks of the very last moments of life. According to Gaga, lyrical inspiration came from the death of her grandfather, who died in September 2010. Alongside a saxophone solo played by Clarence Clemons, the melody of the song resembles much of the musical works of Bruce Springsteen, and contains several qualities similar to that of 1980s adult contemporary musical works.\n\nThe song received critical acclaim, with many critics deeming the song as an album highlight. Much of the praise went to the song's chorus and the musical production. Reviewers also complimented Gaga's vocals, describing it as \"soulful\". The song was an international hit, charting in the top ten in several major music markets, including Australia, Belgium, Canada, New Zealand, Norway, Spain and the United Kingdom. In the United States, it peaked at number three on the Billboard Hot 100, becoming Gaga's tenth consecutive top-ten single in the United States.\n\nA music video for the song was filmed in late May, co-directed by the singer and her production team, Haus of Gaga. The video is simple in contrast to much of Gaga's previous work, and portrays her dancing on a fire-escape and walking on a lonely street. Differences include the lack of intricate choreography and back-up dancers, as well as using only one outfit designed by Versace. Critics complimented the simplicity of the video, while comparing it to the works of Michael Jackson, Janet Jackson and Madonna. Gaga has performed the song in award shows, music festivals and events.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wsyrqr1359181430.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=QeWBS0JBNzQ", "strMusicVidDirector": " Haus of Gaga", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "82169813", "intMusicVidLikes": "358313", "intMusicVidDislikes": "44577", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "17", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": "414849", "intTotalPlays": "5114982", "strMusicBrainzID": "36119119-c128-4c87-bdc8-83af13021534", "strMusicBrainzAlbumID": "2e3b231b-ab9f-4d85-950a-48708a1cc2fb", "strMusicBrainzArtistID": "650e7db6-b795-4eb5-a702-5ea2fc46c848", "strLocked": "Unlocked"}]}