{"track": [{"idTrack": "32730845", "idAlbum": "2110288", "idArtist": "111282", "idLyric": "71684", "idIMVDB": "0", "strTrack": "Till the World Ends", "strAlbum": "Femme Fatale", "strArtist": "Britney Spears", "strArtistAlternate": "Britney", "intCD": null, "intDuration": "237946", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Till the World Ends\" is a song by American recording artist Britney Spears, released as the second single from her seventh studio album, Femme Fatale. It was written and produced by Dr. Luke and Max Martin, with additional writing by Kesha and Alexander Kronlund, and additional production by Billboard. Kesha explained that her main inspiration for the song was imagining Spears and any other female musicians touring the world. On March 2, 2011, the single's cover art and a snippet of the song surfaced online. \"Till the World Ends\" leaked online on March 3, 2011, and was released the following day.\n\n\"Till the World Ends\" is composed as an uptempo dance-pop and electropop song with an electro beat. It opens with sirens, and has elements of trance and Eurodance. The song features a chant-like chorus, and lyrics in which Spears sings about dancing until the end of the world. \"Till the World Ends\" received comparisons to past hits by artists such as Kesha and Enrique Iglesias. The song received universal critical acclaim, with critics calling it a catchy dance track and complimenting its anthemic nature.\n\nThe song was treated with different remixes, most notably the Femme Fatale Remix, featuring rapper Nicki Minaj and Kesha, which was released on April 25, 2011. The remix adds a rap by Minaj at the beginning, new vocals by Kesha and a dubstep breakdown. The Femme Fatale Remix received positive reviews from critics, with most complimenting the diversity of the group and Minaj's rap. \"Till the World Ends\" charted on the top-ten in several major music markets, including Australia, France, Ireland, New Zealand, Sweden and Switzerland. The Femme Fatale Remix propelled the single to the top five on the Canadian Hot 100 and the US Billboard Hot 100. However, \"Till the World Ends\" became her second lowest peaking single in the United Kingdom. \"Till the World Ends (Twister Remix)\" was released as a digital single on September 18, 2012 on iTunes by RCA Records.\n\nAn accompanying music video for the song was released on April 6, 2011. It portrays Spears in an underground dance party set on December 21, 2012. Critics noted the similarities with the music video for \"I'm a Slave 4 U\" (2001), and predominantly gave positive reviews for it. A choreography cut was released on April 15, 2011. The video was also nominated for two categories at the 2011 MTV Video Music Awards, and went on to win Best Pop Video. Spears has performed \"Till the World Ends\" on television shows Good Morning America and Jimmy Kimmel Live!, and performed it with Minaj at the 2011 Billboard Music Awards. She has also performed the song as the encore of the Femme Fatale Tour (2011).", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qyrqwu1359595661.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=qzU9OrZlKb8", "strMusicVidDirector": "Ray Kay", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "136782234", "intMusicVidLikes": "442200", "intMusicVidDislikes": "25462", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "2", "intScore": "8", "intScoreVotes": "3", "intTotalListeners": "430702", "intTotalPlays": "5415922", "strMusicBrainzID": "c0a6ef98-6284-48d4-9e44-fd38bcbae5ad", "strMusicBrainzAlbumID": "a7e9d7d2-3c60-472f-b2ba-829de5034179", "strMusicBrainzArtistID": "45a663b5-b1cb-4a91-bff6-2bef7bbfdd76", "strLocked": "Unlocked"}]}