{"track": [{"idTrack": "33015063", "idAlbum": "2133753", "idArtist": "112817", "idLyric": "270621", "idIMVDB": null, "strTrack": "We R Who We R", "strAlbum": "Animal + Cannibal", "strArtist": "Ke$ha", "strArtistAlternate": "Kesha", "intCD": "2", "intDuration": "204760", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"We R Who We R\" is a song by American recording artist and songwriter Kesha from her first extended play (EP), Cannibal (2010). The song was released as the EP's lead single on October 22, 2010. It was written by Kesha, with Jacob Kasher Hindlin, Dr. Luke, Benny Blanco and Ammo. Production of the song was completed by Dr. Luke, Blanco, and Ammo. In the wake of news that bullying had led to multiple suicides of gay youth, Kesha wrote the song in hopes that it would become a pride anthem. The song is intended to inspire people to be themselves, and as a celebration of anyone deemed quirky or eccentric.\n\nMusically, the song is a dance-pop song that incorporates elements of electropop and trance pop; it uses a synth-infused beat as a backing with sounds interpreted as hand claps. Kesha's vocals have been described as a talk-singing style that use layered Auto-Tune in some parts. The song has been compared to her debut single \"Tik Tok\" (2009), as it has a similar musical structure. Reception of \"We R Who We R\" has been generally positive. Although it was criticized for not being particularly different from Kesha's previous work, reviewers felt that the song was a strong dance-pop number that combined a good rhythm with an inspiring message filled with genuine humor.\n\n\"We R Who We R\" debuted at number one on the Billboard Hot 100, making it the seventeenth song in the chart's history to do so. The song also reached number one in the United Kingdom, Kesha's first number one solo single there, and topped the charts in Australia for three weeks. It also attained top-five positions on the Canadian, Japanese, and New Zealand charts. The song became Kesha's fifth consecutive solo top ten hit in the United States, Canada, and Australia. As of March 2011, the song has sold over 3,804,000 digital copies in the United States.\n\nThe song's accompanying music video was directed by Hype Williams and was filmed in downtown Los Angeles. The video is presented as an underground party and has been described as showcasing a darker and sexier side of Kesha compared to previous videos. The song has been performed in North America at the 2010 American Music Awards, and on her worldwide Get Sleazy Tour.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uywwyp1359587853.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=mXvmSaE0JXA", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "69292480", "intMusicVidLikes": "190583", "intMusicVidDislikes": "23513", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "509258", "intTotalPlays": "4812697", "strMusicBrainzID": "c0b99507-81df-4aa7-b160-b1c32ff1f31a", "strMusicBrainzAlbumID": "e90dc06b-40a0-4b71-a6b8-c5ed0fdd8c65", "strMusicBrainzArtistID": "fab34286-b8e1-4879-bce3-194e1358fbd2", "strLocked": "Unlocked"}]}