{"track": [{"idTrack": "32723942", "idAlbum": "2109593", "idArtist": "111236", "idLyric": "0", "idIMVDB": null, "strTrack": "Yoü and I", "strAlbum": "Born This Way", "strArtist": "Lady Gaga", "strArtistAlternate": null, "intCD": null, "intDuration": "307000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"You and I\" (stylized as \"Yoü and I\") is a song by American recording artist Lady Gaga, taken from her second studio album, Born This Way (2011). Written by Gaga, \"You and I\" is a rock and roll-influenced song that samples Queen's \"We Will Rock You\" (1977) and features electric guitar by Queen's Brian May. The song was debuted by Gaga in June 2010 during her performance at Elton John's White Tie and Tiara Ball. Footage of the performance appeared on the Internet, and positive response encouraged her to incorporate the song into her setlist for The Monster Ball Tour. She subsequently performed the song on Today to a record crowd in July 2010, and on The Oprah Winfrey Show in May 2011. The song was released as the fourth single from the album, on August 23, 2011 by Interscope.\n\n\"Yoü and I\" was inspired by Gaga's relationship with former boyfriend Lüc Carl, and is a slow tempo song featuring instrumentation from electric guitars and piano, with Gaga and Lange providing background vocals. The song received positive critical appreciation, with reviewers listing it as one of the highlights from Born This Way. After the release of the parent album, \"You and I\" charted in Canada, United Kingdom and the United States, due to digital downloads from the parent album. Season ten American Idol contestant Haley Reinhart performed \"You and I\" in May 2011 prior to its release, earning positive reviews. Her studio recording was released to the iTunes Store as a single, and appeared on the compilation album, American Idol Top 5 Season 10. \"You and I\" was nominated for the Grammy Award for Best Pop Solo Performance at the 54th Grammy Awards, which was held on February 12, 2012. \n\nThe accompanying music video for \"You and I\" was released on August 16, 2011 and was shot by Gaga's long-time collaborator Laurieann Gibson in Springfield, Nebraska. The video features Jo Calderone, Gaga's male alter ego, who is also featured on the single's cover, and Yüyi, her mermaid alter ego. The main concept behind the video was Gaga's journey to be with her beloved one; she is portrayed through an assortment of scenes displaying her in various avatars, including Calderone and Yuyi. After its release, the video was met with positive reception.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uxrwsy1359181466.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=X9YMU0WeBwU", "strMusicVidDirector": "Laurieann Gibson", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "77009570", "intMusicVidLikes": "370369", "intMusicVidDislikes": "45968", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "16", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "6949d85d-ffb2-4ab0-9370-52e07b288a39", "strMusicBrainzAlbumID": "2e3b231b-ab9f-4d85-950a-48708a1cc2fb", "strMusicBrainzArtistID": "650e7db6-b795-4eb5-a702-5ea2fc46c848", "strLocked": "Unlocked"}]}