{"track": [{"idTrack": "32939931", "idAlbum": "2127443", "idArtist": "113901", "idLyric": "115457", "idIMVDB": "0", "strTrack": "If You're Not the One", "strAlbum": "Gotta Get Thru This", "strArtist": "Daniel Bedingfield", "strArtistAlternate": null, "intCD": null, "intDuration": "266880", "strGenre": "Pop", "strMood": "Good Natured", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"If You're Not the One\" is a song by English singer Daniel Bedingfield. It was released on 22 November 2002 as the third single from his debut studio album Gotta Get Thru This (2002).\n\nThe single entered the top 20 on the majority of charts that it appeared on, including being a number-one hit in the UK Singles Chart, and reaching number 15 in the United States.\n\n\"If You're Not the One\" is written as a love ballad. Bedingfield claims to have been inspired by the band Westlife, when writing and recording the song. Bedingfield himself believes that the song is \"cheesy.\" Bedingfield admitted he began writing the song because he realized that material he considered more \"complex\", was unlikely to get him a record deal. \"Commercialism, sappy lyrics and meek tunes are the things I hate most in the universe, but I'm not sure even Bob Dylan could get record company interest without hooks these days\", Bedingfield recalled in an interview with The Daily Telegraph. \"It's a different age. You need to go some kind of populist route. So, about three years ago, I sat down with a Westlife song and tried to write something similar.\"\n\nBedingfield also admitted that he didn't even want to put the song on his album. He said, \"I didn't want to put \"If You're Not the One\" on the album as I thought it was too cheesy. I thought it sounded like Westlife. But she (Natasha Bedingfield, his sister) loved it. Women that hear it go all soft and think it's lovely\"\n\n\"If You're Not the One\" plays for 4 minutes and 19 seconds, in common time. It is in the key of B-flat major, and the chorus features Bedingfield singing falsetto, where he hits the note E♭5.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=uk9k_WGsr_w", "strMusicVidDirector": "Phil Griffin", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "77250", "intMusicVidLikes": "288", "intMusicVidDislikes": "8", "intMusicVidFavorites": "0", "intMusicVidComments": "40", "intTrackNumber": "5", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "184550", "intTotalPlays": "1022791", "strMusicBrainzID": "d77554a9-aae9-4dd4-a9e2-7d0db83f71d7", "strMusicBrainzAlbumID": "1cc92748-0b99-3b27-bf33-354f40e14842", "strMusicBrainzArtistID": "9169bdc6-5725-45ec-bba5-e9df75dbe8cc", "strLocked": "Unlocked"}]}