{"track": [{"idTrack": "32973200", "idAlbum": "2130360", "idArtist": "114298", "idLyric": "0", "idIMVDB": "0", "strTrack": "Mesmerize", "strAlbum": "Exodus", "strArtist": "Ja Rule", "strArtistAlternate": null, "intCD": null, "intDuration": "282000", "strGenre": "Hip-Hop", "strMood": "...", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Mesmerize\" is a song by American rapper Ja Rule. It was released in December 2002 as the second single from his fourth album The Last Temptation. The song was produced by Irv Gotti and features R&B artist Ashanti. The song peaked at number 2 on the Billboard Hot 100 on January 2003, behind Jennifer Lopez and L.L. Cool J.'s \"All I Have\", making it Ashanti's and Ja Rule's fourth top ten hit as a duet.\n\nThe song contains a sample from the 1974 song \"Stop, Look, Listen (To Your Heart)\" performed by Diana Ross and Marvin Gaye.\n\nThe music video was inspired by the 1978 musical film Grease.\n\nThe video begins with a group of men dressed in black discussing their plan for a revolution in a strategy room. Ja Rule enters dressed in a preppy sweater, much to the surprise of the other men. He explains that his girl wants him to leave the street life behind. Meanwhile, some of Ashanti's friends are having a slumber party and playing scrabble when Ashanti emerges dressed in flashy black leather attire. She explains that her guy wants her to be more street.\n\nThe song begins and we see the two meeting up at an amusement fair. As they sing, they partake in various carnival attractions, such as game booths and bumper cars. The song ends abruptly with Ja Rule's friends emerging from a black van and asking him if he's riding with them. After he hesitates and turns to Ashanti, she says she's riding if he's riding. They enter the van and after a few quick cuts they emerge and Ja Rule begins rapping \"Destiny\", an uptempo \"hardcore\" street song that contrasts with the more mellow \"Mesmerize\". The video ends with a crowd of men marching the streets and holding up various signs, including tributes to late rappers Tupac Shakur and DJ Jam-Master Jay.\n\nThe street scene was filmed outside Cathedral High School on Bishops Road (formerly Stadium Way), an up-hill climb towards Dodger Stadium. The carnival scenes were filmed in Los Angeles at Cathedral High School's graveyard field. The entire campus was the site of the old Calvary Cemetery, Northeast of downtown Los Angeles.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=VcP96KbFIIU", "strMusicVidDirector": "Irv Gotti", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "67305025", "intMusicVidLikes": "243887", "intMusicVidDislikes": "10467", "intMusicVidFavorites": "0", "intMusicVidComments": "10977", "intTrackNumber": "11", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "100934", "intTotalPlays": "381666", "strMusicBrainzID": "b20e4e53-040a-4b3b-8a85-371ee6a2a428", "strMusicBrainzAlbumID": "1239691f-4bf6-3cce-a39e-d581157cfb48", "strMusicBrainzArtistID": "b504f625-4ef6-4a5a-81e8-870a61e8dc9c", "strLocked": "Unlocked"}]}