{"track": [{"idTrack": "32814835", "idAlbum": "2117596", "idArtist": "112325", "idLyric": "264787", "idIMVDB": "0", "strTrack": "Rock Your Body", "strAlbum": "Justified", "strArtist": "Justin Timberlake", "strArtistAlternate": null, "intCD": null, "intDuration": "271386", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Rock Your Body\" is a song recorded by American singer-songwriter Justin Timberlake for his debut studio album, Justified (2002). It was written by Timberlake along with The Neptunes (consisting of Chad Hugo and Pharrell Williams), who also produced the track. The song was released on April 7, 2003 by Jive Records as the third single from Justified. The track is an uptempo, disco groove, soul infused song containing influences from Michael Jackson and Stevie Wonder. The female section of the track is sung by Vanessa Marquez. Originally intended to be featured on Jackson's tenth studio album Invincible (2001), the latter rejected the song along with several other tracks, which were instead given to Timberlake for his debut album.\n\n\"Rock Your Body\" topped the Australian Singles Chart. It peaked at number two on the UK Singles Chart, the third single from Justified to do so, following \"Like I Love You\" and \"Cry Me a River\". It charted at number three on the Danish Singles Chart, number four on the New Zealand Singles Chart and Irish Singles Chart, and number five on the US Billboard Hot 100. It was certified gold by the Recording Industry Association of America (RIAA) and the Recording Industry Association of New Zealand (RIANZ) for shipments of 500,000 and 7,500 copies, respectively. The song received generally positive reviews, with music critics noting it as a stand-out track, while complimenting its musical elements.\n\nThe accompanying music video for \"Rock Your Body\", which was directed by Francis Lawrence, features Timberlake with several back-up dancers performing choreography within a multi-color lighted cube. Timberlake performed the song live several times, including the highly controversial performance at the Super Bowl XXXVIII halftime show, where while performing with R&B singer Janet Jackson, Timberlake ripped off part of Jackson's costume, momentarily exposing her right breast on live television.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=TSVHoHyErBQ", "strMusicVidDirector": "Francis Lawrence", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "72757649", "intMusicVidLikes": "207432", "intMusicVidDislikes": "6744", "intMusicVidFavorites": "0", "intMusicVidComments": "14736", "intTrackNumber": "6", "intLoved": "1", "intScore": "9.16667", "intScoreVotes": "6", "intTotalListeners": "603281", "intTotalPlays": "2710239", "strMusicBrainzID": "d31fd36e-2b2b-48b2-8e54-55d5f318afba", "strMusicBrainzAlbumID": "424620c6-e416-3ce8-bfcc-d5c59952456d", "strMusicBrainzArtistID": "596ffa74-3d08-44ef-b113-765d43d12738", "strLocked": "Unlocked"}]}