{"track": [{"idTrack": "32817877", "idAlbum": "2117842", "idArtist": "112373", "idLyric": "323619", "idIMVDB": "0", "strTrack": "Unwell", "strAlbum": "More Than You Think You Are", "strArtist": "Matchbox Twenty", "strArtistAlternate": "Matchbox 20", "intCD": null, "intDuration": "228706", "strGenre": "Alternative Rock", "strMood": "...", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Unwell\" is a song by American alternative rock group Matchbox Twenty. It was released in April 2003 as the second single from their third album, More Than You Think You Are. It was written by Matchbox Twenty lead singer Rob Thomas. It was very successful on the radio, spending 18 weeks at the top of the US Billboard Adult Top 40 chart, two weeks atop the Billboard Hot Adult Contemporary Tracks chart, as well as reaching No. 5 on the Billboard Hot 100 chart. The song was nominated for a Grammy Award in 2004 for Best Pop Performance by a Duo or Group with Vocal.\n\nOn the live DVD Show: A Night in the Life of Matchbox Twenty, Rob Thomas states that he wrote the song as a metaphor for humanity in general, a song for people who are \"messed up and feel alone like that. We all feel a little messed up sometimes... you're not alone.\"\n\nDirected by Meiert Avis, the music video predominantly features Thomas seeing various odd occurrences throughout, all the while singing along to the song. The rest of the band only appears in cameos, notably when Thomas boards a subway and they are seen in the background. The appearance of the other band mates is also altered like most of the video (their noses are rather large). The rest of the band is also seen at the end of the video gathered in Thomas' room, and each takes their turn waving goodbye to the camera before Thomas does so as well at the end of the video. One of the reasons Rob Thomas picked Meiert Avis to direct is because his concept for the video was the closest thing to an acid trip out of every other idea.\n\nThe song also was the second most-played song in the United States in 2003 according to Billboard magazine. The music video was No. 1 on VH1's Top 40 Videos of 2003. In 2011, VH1 named the song as the 82nd best song of the 2000s.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uusuwp1488312161.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=WziA88-n02k", "strMusicVidDirector": "Meiert Avis", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "21963301", "intMusicVidLikes": "107128", "intMusicVidDislikes": "2249", "intMusicVidFavorites": "0", "intMusicVidComments": "6652", "intTrackNumber": "4", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "354630", "intTotalPlays": "2004681", "strMusicBrainzID": "efe280d1-74f1-4cfa-a0a6-65fd5f5aa17c", "strMusicBrainzAlbumID": "a13e9013-0d60-3013-8d57-c48539c9dfea", "strMusicBrainzArtistID": "75af9d25-cf32-49c0-9192-60bd8e9784e6", "strLocked": "Unlocked"}]}