{"track": [{"idTrack": "35407474", "idAlbum": "2338425", "idArtist": "143553", "idLyric": null, "idIMVDB": null, "strTrack": "Break My Heart", "strAlbum": "Future Nostalgia", "strArtist": "Dua Lipa", "strArtistAlternate": null, "intCD": null, "intDuration": "221000", "strGenre": "Indie Pop", "strMood": "Intimate", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"Break My Heart\" is a song by English singer Dua Lipa from her second studio album, Future Nostalgia (2020). The song was written by Lipa, Ali Tamposi, Stefan Johnson, Jordan K. Johnson, and Andrew Watt, with the latter of the five handling production alongside the Monsters & Strangerz. Due to an unintentional similarity to the guitar riff in INXS's 1987 song \"Need You Tonight\", band members Andrew Farriss and Michael Hutchence are also credited as writers, and the similarity is credited as an interpolation. The song was released for digital download and streaming on 25 March 2020 through Warner Records as the third single from Future Nostalgia, and impacted American contemporary hit radio on 31 March 2020 as the album's second single in the United States.\n\n\"Break My Heart\" is a dance-pop and disco-funk track with elements of house and 1980s music that includes a Europop and dance beat. A vulnerable song, it sees Lipa questioning if a new love will leave her broken-hearted. It entered at number 6 on the UK Singles Chart peaked at number 13 on the US Billboard Hot 100. It became Lipa's highest debut on the latter chart, debuting at number 21. Internationally, the song has peaked within the top 10 of 17 other countries, including Israel, where it reached the summit. \"Break My Heart\" has received several certifications, including a gold award from the British Phonographic Industry (BPI).\n\nThe accompanying 1990s-inspired music video was directed by Henry Scholfield and premiered on 26 March 2020. It sees Lipa in many scenarios attempting to discover her emotions, going from vulnerable to empowered. The video received positive reviews, with critics praising Scholfield's use of colour. An animated music video, Spotify vertical video and lyric video were also released for \"Break My Heart\". Lipa has promoted the song with televised live performances on The Tonight Show Starring Jimmy Fallon, Big Brother Brasil 20, and Graduate Together. The song has also received several remixes.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qsuswu1585568103.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=Nj2U6rhnucI", "strMusicVidDirector": "Henry Scholfield", "strMusicVidCompany": "Warner Bros. Records", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "301044758", "intMusicVidLikes": "3730761", "intMusicVidDislikes": "88337", "intMusicVidFavorites": "0", "intMusicVidComments": "85648", "intTrackNumber": "9", "intLoved": "1", "intScore": "9.5", "intScoreVotes": "2", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "ba2a214d-39b0-4b53-8b20-b2b80cf9bfab", "strMusicBrainzAlbumID": "aa366795-92d7-4d67-91fa-6741f82a4858", "strMusicBrainzArtistID": "6f1a58bf-9b1b-49cf-a44a-6cefad7ae04f", "strLocked": "Unlocked"}]}