{"track": [{"idTrack": "35204647", "idAlbum": "2319999", "idArtist": "143255", "idLyric": null, "idIMVDB": "2147483647", "strTrack": "Truth Hurts", "strAlbum": "Cuz I Love You", "strArtist": "Lizzo", "strArtistAlternate": null, "intCD": null, "intDuration": "173000", "strGenre": "Alternative Hip-Hop", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"Truth Hurts\" is a song released by American singer and rapper Lizzo. It was released on September 19, 2017 by Nice Life Recording Company and Atlantic Records. It was written by Lizzo, Jesse Saint John, Steven Cheung, and Ricky Reed, the latter of whom co-produced the track with Tele. Though it did not chart at the time of its release, it saw a sudden increase in popularity after being featured in the Netflix film Someone Great in 2019, boosted by the release of Lizzo's third studio album Cuz I Love You the same week.\n\nComposition\nMusically, it is led by a \"glittering\" piano loop. Lyrically, the song sees the singer addressing boy problems, rapping the lyrics, \"'You coulda had a bad bitch, non-committal/ Help you with your career, just a little', she raps. 'You’re ‘posed to hold me down/ But you’re holding me back/ And that's the sound of me not calling you back'.\"\n\nDuring a 2019 concert in her native Detroit, Lizzo revealed that \"the person I wrote that song about is from Detroit.\"\n\nCommercial performance\nNorth America\nIn the United States, \"Truth Hurts\" was a sleeper hit, being released in September 2017 and eventually receiving recognition in early 2019. On the US Billboard Hot 100 chart, the song debuted at number 50 on the week ending May 18, 2019. Its high debut was due to a Billboard rule that affects songs older than one year from entering the Hot 100 unless obtaining a substantial amount of chart points. The track has since reached a peak of number 14.\n\n\"Truth Hurts\" debuted at number 33 on the Mainstream Top 40 following its entry on the Hot 100 and has so far reached number 21. The song has also entered the top 40 of US Rhythmic charts, where it has reached number 23, becoming Lizzo's highest-charting song. In Canada, \"Truth Hurts\" opened at number 43 on the Canadian Hot 100 on the week ending May 18, 2019. It has peaked at number 29.\n\nEurope\nIn the United Kingdom, \"Truth Hurts\" has reached number 52 on the UK Singles Chart on the week ending May 31, 2019. In Belgium, the song entered the top 10 of the Belgian singles chart, at number two, becoming Lizzo's first and highest-charting entry in the country. The song also entered the top ten of the Belgium Urban Singles chart, at number 9, also becoming her first and highest-charting entry on the chart, respectively.\n\nOceania\nIn New Zealand, \"Truth Hurts\" peaked number five on the New Zealand singles chart. In Australia, the song entered the top 30, at number 21 on the week ending May 25, 2019.\n\nCritical reception\nAshley Monaé, writing for Pitchfork, stated the song contains \"sobering moments of truth where Lizzo’s charisma wins us over and sets her apart\". DIY magazine wrote that the song \"continues to show off her relatable rap\".\n\nThe song's lyrics in which she references the Minnesota Vikings was edited out for one station, Top 40/CHR WIXX Green Bay, due to the Packers rivalry with the aforementioned team, and is also part of the Packers Radio Network. Atlantic allowed the station to make changes to the song, and was ultimately “cool with it” when it came to the adjustment.\n\nMusic video\nA music video was released to accompany \"Truth Hurts\", styled by Brooke Candy. It depicts the singer at a wedding, before leaving the groom at the altar. The video finishes with the singer marrying herself, followed by a dance party. Scenes of the singer in lingerie are interspersed throughout the video. As of June 2019, the music video has amassed more than 30 million views on YouTube.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rvxvyu1560717322.jpg", "strTrack3DCase": "https://www.theaudiodb.com/images/media/track/3dcase/xytwup1560717316.png", "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=P00HMxdsVZI", "strMusicVidDirector": "Brooke Candy", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "41215282", "intMusicVidLikes": "693510", "intMusicVidDislikes": "14094", "intMusicVidFavorites": "0", "intMusicVidComments": "17968", "intTrackNumber": "13", "intLoved": "0", "intScore": "10", "intScoreVotes": "3", "intTotalListeners": "191586", "intTotalPlays": "1999103", "strMusicBrainzID": "e3d04cc6-b6e8-4942-b7c5-85645a02a6bf", "strMusicBrainzAlbumID": "b0b9a346-658c-48b4-97ee-8cd49c19c2e6", "strMusicBrainzArtistID": "8fb5370b-9568-4b61-9da5-2aa12c9928db", "strLocked": "Unlocked"}]}