{"track": [{"idTrack": "34100644", "idAlbum": "2222841", "idArtist": "111352", "idLyric": "0", "idIMVDB": null, "strTrack": "Bad Blood", "strAlbum": "1989", "strArtist": "Taylor Swift", "strArtistAlternate": null, "intCD": null, "intDuration": "212000", "strGenre": "Pop", "strMood": "Needy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Bad Blood\" is a song by American singer-songwriter Taylor Swift, from her fifth studio album 1989 (2014). The single version, featuring American rapper Kendrick Lamar, was released on May 17, 2015 by Republic Records. The song reached number-one on the Billboard Hot 100 and is the third song from the album to do so.\n\nThe accompanying music video was directed by Joseph Kahn and features an ensemble cast. The video previously held the 24-Hour Vevo Record with 20.1 million views, before being surpassed by Adele's \"Hello\". It won Video of the Year and Best Collaboration at the 2015 MTV Video Music Awards. The song received a nomination for Best Pop Duo/Group Performance while its music video won Best Music Video at the 58th Grammy Awards.\n\n\"After Blank Space, Joseph Kahn is back to nurturing Taylor Swift's vengeful side once again in this action-film genre hodgepodge of epic proportions for her latest track Bad Blood. Featuring a jawdropping collection of fierce females of the fashion, TV and pop-music industries (including Lena Dunham, Ellie Goulding, Cara Delevingne, and loads more) the video is set up like an extended trailer introducing many familiar faces and the personas they created for themselves. The first sequence has Swift and Selena Gomez in an office somewhere in London kicking butt and getting their hands on a mysterious briefcase. Gomez's character Arsyn is quickly established as Swift's nemesis when she betrays her, grabbing the briefcase and kicking her out of a window. Now that the bad blood has set in, Swift crews up at her Mission Impossible-style headquarters, races Tron-like motorcycles with Jessica Alba and sets out into post-apocalyptic London with her action-babes crew, which look like The Expendables except, y'know, leaner and wearing stilettos. This all culminates with a face-off between her crew and Selena's, with a rather hilarious finale as the two women simultaneously slap each other. Really makes us wonder how the rest of the scene would have played out...\" (Cat Velez, Promonews)", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/yvpssy1432067246.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=QcIy9NiNbmo", "strMusicVidDirector": "Joseph Kahn", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "1486115295", "intMusicVidLikes": "8858493", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "460388", "intTrackNumber": "8", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "914f6a27-fce4-4a75-9267-049b51a1b086", "strMusicBrainzAlbumID": "4d9ec1c2-58ec-48a4-aa0a-916718adead0", "strMusicBrainzArtistID": "20244d07-534f-4eff-b4d4-930878889970", "strLocked": "Unlocked"}]}