{"track": [{"idTrack": "34100638", "idAlbum": "2222841", "idArtist": "111352", "idLyric": "0", "idIMVDB": null, "strTrack": "Blank Space", "strAlbum": "1989", "strArtist": "Taylor Swift", "strArtistAlternate": null, "intCD": null, "intDuration": "232000", "strGenre": "Pop", "strMood": "Needy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Blank Space\" is a song by American singer-songwriter Taylor Swift from her 2014 fifth studio album 1989. It was written by Swift, Max Martin and Shellback. The song was released to the radio by Republic Records on November 10, 2014 as the album's second single, after \"Shake It Off\" and is the second track on the album. Musically, \"Blank Space\" is a minimalist electropop song with lyrics that satirize the media's perception of Swift and her relationships.\n\nThe accompanying music video was directed by Joseph Kahn, who said that Swift approached him with the idea for the treatment, saying she was all too aware of the jokes made about all of her ex-boyfriends and how she likes to include them in her songwriting. She told him that she wanted to address the general thought of her in the clip in a fun way by playing a crazy villain.\n\nDavid Knight from Promonews wrote: \"...It's no surprise that Joseph's video for Blank Space broke the internet a bit on Monday, as few music videos have done before without resorting to explicit content. It presents a glorious fantasy of Taylor in her princess's castle - actually Oheka Castle and Woolworth Mansion in New York State - falling for her prince. The setting is sumptuous, the guy is drop-dead gorgeous... and then comes the surprise. Taylor turns nasty. In fact, not just nasty. She's mad. She's evil. An irrational green-eyed jealous monster who destroys her fairytale piece by piece, and his car, and his clothes. This big pop video is driven by the sarcastic edge of Blank Space, addressing her complicated love life, and the gossip. And Joseph does a typically masterful job seamlessly combining the glamour with the sarcasm and creating a 'bad Taylor' that is so over the top, so knowing, you feel she's still lovely underneath. ...Could have been very tricky, turning Taylor Swift into a bad, mad girl. But this is both an artistic statement and irresistible entertainment.\"\n\nPromonews took Blank Space on their list of Videos of the Decade.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vrwusv1582924560.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=e-ORhEE9VVg", "strMusicVidDirector": "Joseph Kahn", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "2948323604", "intMusicVidLikes": "13054906", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "618559", "intTrackNumber": "2", "intLoved": "3", "intScore": "10", "intScoreVotes": "3", "intTotalListeners": "311437", "intTotalPlays": "5358849", "strMusicBrainzID": "c3fe7791-0a91-4f0a-a89b-b056f38d3cde", "strMusicBrainzAlbumID": "4d9ec1c2-58ec-48a4-aa0a-916718adead0", "strMusicBrainzArtistID": "20244d07-534f-4eff-b4d4-930878889970", "strLocked": "Unlocked"}]}