{"track": [{"idTrack": "33982618", "idAlbum": "2212776", "idArtist": "115909", "idLyric": "0", "idIMVDB": "0", "strTrack": "Chandelier", "strAlbum": "1000 Forms of Fear", "strArtist": "Sia", "strArtistAlternate": null, "intCD": null, "intDuration": "216120", "strGenre": "Pop", "strMood": "Intense", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Chandelier\" is a song by Australian recording artist Sia from her sixth studio album, 1000 Forms of Fear (2014). Written by Sia and Jesse Shatkin and produced by Shatkin and Greg Kurstin, the song was released on March 17, 2014 as the lead single from the album. It is an electropop song, featuring electronica, R&B and reggae influences. Lyrically, the song has a melancholic theme, detailing the demoralisation and rationalisation of alcoholism through the typical thought process of a \"party girl\".\n\nUpon its release, \"Chandelier\" received mainly favourable reviews from music critics, who praised Sia's songwriting and her vocals. Commercially, it was a worldwide success. The single charted within the top five of record charts in countries including Australia, Italy, Norway, Poland, New Zealand and the United Kingdom, and the top 10 in 28 countries. On the US Billboard Hot 100, the song has peaked at number 8, becoming Sia's first top ten single as a lead artist on the chart. The track was certified quadruple platinum by the Australian Recording Industry Association (ARIA) and platinum by the Recorded Music NZ (RMNZ) and Recording Industry Association of America (RIAA). The song received four Grammy nominations for Song of the Year, Record of the Year and Best Pop Solo Performance, with its video receiving a nomination for Best Music Video at the 57th Grammy Awards.\n\nA music video for the song was directed by Sia and Daniel Askill, while it was choreographed by Ryan Heffington. It features Maddie Ziegler, a young dancer, performing the choreography. In support of the single and 1000 Forms of Fear, Sia performed \"Chandelier\" on The Ellen DeGeneres Show, Late Night with Seth Meyers and Jimmy Kimmel Live! with Ziegler dancing. Sia also performed the song on Dancing With The Stars, accompanied by dancers Ziegler and Allison Holker.\nIn 2010, Sia released her fifth studio album We Are Born, which peaked at number two on the Australian Albums Chart. Following the release, Sia took a musical hiatus and co-wrote songs for multiple recording artists, including Beyoncé, Rihanna, Christina Aguilera, Flo Rida and David Guetta. In 2013, Sia recorded the track \"Elastic Heart\" for The Hunger Games soundtrack.\n\nIn May 2014, Sia announced her sixth studio album 1000 Forms of Fear and released \"Chandelier\" as its lead single. Sia revealed that she initially wrote the track for Rihanna or Beyoncé, but scrapped it and kept the song as her own record. The melody was formed after Sia played the piano, while Greg Kurstin and Jesse Shatkin played the marimba in the studio. In the United States, \"Chandelier\" was released for digital download onto iTunes Stores on 17 March 2014 through Monkey Puzzle, with distribution by RCA Records. In the United Kingdom, \"Chandelier\" was released digitally on 29 June 2014. A day later, it was sent by RCA Records to US hot adult contemporary radio.\n\"Chandelier\" was written by Sia, Jesse Shatkin and was produced by Greg Kurstin and Shatkin. It was described as an electropop ballad, featuring \"soaring\" synthesisers, \"militant\" drums, and hip hop beats with electronica, R&B, and reggae influences. The song features Sia's \"jaw-dropping\" vocal performance. Lyrically, \"Chandelier\" has a sad theme talking about \"the glitter and fatigue of a party girl's life\". John Walker from MTV Buzzworthy opined that the song has a dark theme, \"toeing the line between celebration and self-destruction as it becomes increasingly more blurred\". At the song's opening, Sia sings \"Party girls don't get hurt, can't feel anything... I push it down\" over a reggae-influenced background. During the chorus, she chants, \"I’m gonna swing from the chandelier, from the chandelier/ I’m gonna live like tomorrow doesn't exist, like it doesn't exist\". A few critics compared the song's musical style to works done by Rihanna, including Jeremy Gordon from Pitchfork Media, and Melinda Newman of HitFix.\nThe music video for \"Chandelier\" was released on 6 May 2014. It features Maddie Ziegler, a young dancer. Ziegler was personally asked by Sia to appear in the video via Twitter. The video was directed by Sia and Daniel Askill, and was choreographed by Ryan Heffington. Ziegler shared her thoughts about the dance moves to New York magazine:\n\n\"I like the whole dance. It was really different and weird for me, because I usually don’t, you know, be a crazy person every time. It was so fun to do and it was really out of the box and it expanded me a lot, because I’m used to competition dances where you’re like, 'Point your legs!' But this time it was like, you just need to let go and feel it.\"\n\nIn the video, Ziegler wears a blonde Sia wig. Throughout the clip, Ziegler dances in a deserted apartment \"while spinning, kicking, leaping, crawling, falling, twirling and hiding herself behind window drapes\". An alternative one-take version of the clip was released in June 2014. The choreography was praised by media outlets; an editor from The Guardian wrote that Ziegler \"dances with such impressive flexibility\". Nolan Feenay from Time magazine commented that the dance moves in the \"Chandelier\" music video could be the best dance routine of 2014. \"Chandelier\" received nominations at the MTV Video Music Awards for Video of the Year and Best Choreography, and ultimately won the latter. On 5 December 2014, it was nominated for a Grammy Award for Best Music Video.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vuwyyu1419259540.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=2vjPBrBU-TM", "strMusicVidDirector": "Daniel Askill", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/rrxuyt1419259460.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/wssspv1419259468.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/srxsrs1419259476.jpg", "intMusicVidViews": "2205837890", "intMusicVidLikes": "9195343", "intMusicVidDislikes": "546335", "intMusicVidFavorites": "0", "intMusicVidComments": "521880", "intTrackNumber": "1", "intLoved": "1", "intScore": "9.71429", "intScoreVotes": "7", "intTotalListeners": "669713", "intTotalPlays": "8949404", "strMusicBrainzID": "d54ad2cf-cc5b-4c8d-881d-f4685e12553c", "strMusicBrainzAlbumID": "5628bc44-c89b-4af6-9b76-f266d09be63c", "strMusicBrainzArtistID": "2f548675-008d-4332-876c-108b0c7ab9c5", "strLocked": "Unlocked"}]}