{"track": [{"idTrack": "33982625", "idAlbum": "2212776", "idArtist": "115909", "idLyric": "0", "idIMVDB": "0", "strTrack": "Elastic Heart", "strAlbum": "1000 Forms of Fear", "strArtist": "Sia", "strArtistAlternate": null, "intCD": null, "intDuration": "0", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Elastic Heart\" is a song by Australian recording artist Sia featuring Canadian recording artist The Weeknd and American producer Diplo, taken from the soundtrack for the 2013 American film The Hunger Games: Catching Fire. The song was produced by Diplo and American producer Greg Kurstin. It was released on 1 October 2013 as a single from Catching Fire by RCA, Republic and Lionsgate.\n\n\"Elastic Heart\" was well received by music critics and peaked at number 7 on the singles chart of New Zealand and was certified gold by the Recorded Music NZ. It also appeared on the charts of Australia, Belgium, Switzerland and the United Kingdom. In 2014, Sia re-recorded a solo version of \"Elastic Heart\" for her sixth studio album 1000 Forms of Fear. The solo version was released in 2015 as a single from the album and was accompanied by a music video, which features actor Shia LaBeouf and Maddie Ziegler.\n\nOn 7 January 2015, the music video for the song was released. Directed by Sia and Daniel Askill and choreographed by Ryan Heffington, The video features Maddie Ziegler, who previously appeared in the video for Sia's single \"Chandelier\", and actor Shia LaBeouf. In the video, Ziegler and LaBeouf wear nude and dirt-smeared outfits. Justine Harman from Elle likened the concept of the video to the plot of Titanic. Analysing the video's content, Jason Lipshutz from Billboard summarised it this way:\n\n\"The entirety of the video features the surprising pair interpreting the song through various body contortions: they dance-fight, collapse in the middle of the cage, crawl toward and away from each other, and make some wildly fantastic facial expressions.\"\n\nUpon its release, the visual faced criticism from a number of audiences due to the depiction of a nearly naked adult and child dancing together, being accused of depicting images that may express pedophilia. Sia later apologised on Twitter: \"All I can say is Maddie and Shia are two of the only actors I felt could play these two warring 'Sia' self states. I  to those who feel triggered by 'Elastic Heart'. My intention was to create some emotional content, not to upset anybody.\"", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=KWZGAExj-es", "strMusicVidDirector": "Sia", "strMusicVidCompany": "Music video by Sia performing Elastic Heart. (C) 2015 Monkey Puzzle Records, under exclusive license to RCA Records.", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "8", "intLoved": "0", "intScore": "9.6", "intScoreVotes": "5", "intTotalListeners": "419503", "intTotalPlays": "4133855", "strMusicBrainzID": "a6de534b-d25d-455a-887f-e37de00631fa", "strMusicBrainzAlbumID": "5628bc44-c89b-4af6-9b76-f266d09be63c", "strMusicBrainzArtistID": "2f548675-008d-4332-876c-108b0c7ab9c5", "strLocked": "Unlocked"}]}