{"track": [{"idTrack": "34345230", "idAlbum": "2243069", "idArtist": "120340", "idLyric": "0", "idIMVDB": "0", "strTrack": "Good for You", "strAlbum": "Good for You", "strArtist": "Selena Gomez", "strArtistAlternate": null, "intCD": null, "intDuration": "221000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Good for You\" is a song recorded by American singer Selena Gomez for her upcoming second studio album Revival (2015). It features vocals by rapper ASAP Rocky, who co-wrote the track along with Julia Michaels, Justin Tranter, and Nick Monson. The song was produced by Sir Nolan and Monson, and co-produced by Rocky and Hector Delgado. Gomez who was fully involved in the track's creative process, assisted in developing it as representation of her process of self-realization, her confidence as a young woman, and feelings of vulnerability.\n\nA torch song, the lyrical content in \"Good for You\" also contains a theme of psychodrama, and specifically discusses pleasing and being the perfect complement for a significant other. It is a pop and R&B slow jam that comprises a mellow, snap-drop, hip hop beat reminiscent of modern, pitched-down Southern hip hop productions, on which Gomez solicits an uncharacteristic breathy vocal.\n\n\"Good for You\" was released on June 22, 2015, as the lead single from the album through Interscope and Polydor Records. Upon release, the song became Gomez's highest career debut on the Billboard Hot 100 where it entered at number nine with first-week sales of 179,000 copies. Its debut marked Gomez's career-best sales week for a single, and her third top-ten hit in the United States. Internationally, \"Good for You\" reached the top ten in Canada, Greece and Spain, and the top 20 in eight other countries.\n\nA restrained, minimalist music video directed by Sophie Muller to accompany the single premiered on screens in Times Square on June 26, 2015. The clip made use of a new, stripped-down version of \"Good for You\" which omitted Rocky's verse. Highlighted for its provocative imagery, the visual follows a low-key premise, with Gomez wallowing on several vignettes, donning a number of casual outfit changes. Both the song and its music video drew in several comparisons to the works of Lana Del Rey and were well received by music critics who commended Gomez's artistic growth and maturity in each, and the track's ambient production.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=1TsVjvEkc4s", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "250209", "intTotalPlays": "2349775", "strMusicBrainzID": "f6908093-ff6c-458c-949d-99987cd1263b", "strMusicBrainzAlbumID": "35bd81a7-3398-44a3-860e-2502483c46f4", "strMusicBrainzArtistID": "e4bc69e2-a064-4f93-ada1-f7f209cc1cc3", "strLocked": "Unlocked"}]}