{"track": [{"idTrack": "34209986", "idAlbum": "2231924", "idArtist": "111828", "idLyric": "0", "idIMVDB": "679371476723", "strTrack": "Heartbeat Song", "strAlbum": "Piece By Piece", "strArtist": "Kelly Clarkson", "strArtistAlternate": null, "intCD": null, "intDuration": "198000", "strGenre": "Pop", "strMood": "Happy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Heartbeat Song\" is a song by American singer Kelly Clarkson from her seventh studio album, Piece by Piece (2015). Written by Mitch Allan, Audra Mae, Kara DioGuardi, and Jason Evigan, the song is an uptempo synth-pop track produced by Greg Kurstin. Lyrically, it sings of meeting a person who restores someone's faith in love. Inspired by 1980s synthpop music, \"Heartbeat Song\" was released by RCA Records as the album's lead single on January 12, 2015.\n\n\"Heartbeat Song\" was released to a positive response from music critics, who complimented the song's production and praised Clarkson's decision to return to mainstream pop music. Other critics, however, noted the strong resemblance the song's melody bore to that of Jimmy Eat World's single \"The Middle\" (2001), which later allowed the band to be credited as additional songwriters. Commercially, the single debuted on the Billboard Hot 100 chart at number 37 and has peaked at number 21, marking Clarkson's sixteenth top 40 hit on the chart. It also became her fifth song to top the Billboard Hot Dance Club Songs chart and marked as her highest debut among her twenty career entries on the Billboard Adult Top 40 chart. Internationally, it became a top ten hit single in Austria, Belgium, Poland, Slovenia, South Africa, and the United Kingdom while also becoming a top 20 hit in the national charts of the Czech Republic, Germany, Mexico, Slovakia and Sweden.\n\nDirected by Marc Klasfeld, its accompanying music video features scenes of various downtrodden people and their process of finding love again. Clarkson premiered \"Heartbeat Song\" in a live televised performance on The Graham Norton Show in February 2015 and has performed it on The Tonight Show Starring Jimmy Fallon and the fourteenth season of American Idol. The song was nominated for Best Pop Solo Performance at the 58th Annual Grammy Awards.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "", "strMusicVidDirector": "Marc Klasfeld", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": null, "intMusicVidLikes": null, "intMusicVidDislikes": null, "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": "139027", "intTotalPlays": "945533", "strMusicBrainzID": "ec0d851d-f491-4e97-84c7-affdbc5fad91", "strMusicBrainzAlbumID": "0c9a7e98-8762-4fd8-afef-68690a5c2d2f", "strMusicBrainzArtistID": "d339efbb-77b9-4147-ba9e-59f2f24550b2", "strLocked": "Unlocked"}]}