{"track": [{"idTrack": "34119635", "idAlbum": "2224502", "idArtist": "131472", "idLyric": "0", "idIMVDB": "0", "strTrack": "Lips Are Movin", "strAlbum": "Title", "strArtist": "Meghan Trainor", "strArtistAlternate": null, "intCD": null, "intDuration": "181000", "strGenre": "Pop", "strMood": "Quirky", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Lips Are Movin\" is a song recorded by American singer Meghan Trainor. Trainor co-wrote it with Kevin Kadish, who produced it as well. Epic Records released it on October 21, 2014, as the second single from Trainor's fourth studio album Title (2015). \"Lips Are Movin\" was announced in October 2014, along with its official single artwork, and release to radio stations in the same month. \"Lips Are Movin\" is a bubblegum pop, doo-wop and R&B song with wry lyrics about a philandering, untruthful man.\n\nComparing it to Trainor's previous single \"All About That Bass\", critics stated that \"Lips Are Movin\" elevated Trainor from a one-hit wonder to a successful pop act. \"Lips Are Movin\" was a commercial success, becoming Trainor's second consecutive single to reach the top five in Australia, the United Kingdom, and the U.S. Billboard Hot 100, where it peaked at numbers three, two, and four, respectively. It also reached the top ten in several European countries, including Austria, Spain, Germany, and the Netherlands.\n\nPhilip Andelman directed the music video for \"Lips Are Movin\" and Hewlett-Packard commissioned it. It portrays behind-the-scenes events during the shoot of a music video, featuring dancers that include Les Twins and Chachi Gonzales. Following its release on November 19, 2014, the video was viewed 2.5 million times on YouTube within two days and received positive reviews that praised its imagery. Trainor has performed \"Lips Are Movin\" live on several shows, including Today, The Voice, and Dancing with the Stars. It was also performed during Trainor's That Bass Tour (2015) and MTrain Tour (2015).\n\n\"Lips Are Movin\" is a bubblegum pop, doo-wop and R&B song. It includes half-sung, half-rapped vocals and a retro-soul melody with beats and a percussion-heavy arrangement. VH1 described it as \"a feisty, upbeat track\" that \"has some spunky lyrics\". According to James Cowan of Canadian Business, the song \"shares the same girl-group-influenced harmonies, wry lyrics and candy palette\" of its predecessor, \"All About That Bass\". Musically, \"Lips Are Movin\" was likened to Christina Aguilera's \"Candyman\" (2007) by Carl Smith of Sugarscape.com. The song's tempo is 139 beats per minute. It is composed in the key G major. Trainor's vocals span the tonal nodes F3 to B5. The song's chord progression is G–Am–C–G.\n\nKevin Kadish produced and co-wrote \"Lips Are Movin\".\nThe song's lyrics are about a philandering, untruthful man; they include, \"if your lips are movin', then you're lyin', lyin', lyin, babe\". It was reportedly written in eight minutes by Kevin Kadish and Meghan Trainor and produced by the former.\n\nOn October 14, 2014, the song's artwork and a full-length low-quality version were leaked online. The same day, it was announced by the label that \"Lips Are Movin\" would be released to contemporary hit radio in the U.S. on October 21, 2014, as Trainor's second single. The song was offered first on Shazam, and also premiered on MTV News the following day. The song garnered radio play from three radio stations the same day, six days before its radio release date. The song was released as a download on the same date in Austria, Germany, and Switzerland. It was later released worldwide—except in the United Kingdom—instantly made available to those who pre-ordered Title, In the United Kingdom, the song was released as a download on January 18, 2015.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xyvvtv1481631318.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=qDc_5zpBj7s", "strMusicVidDirector": "Philip Andelman", "strMusicVidCompany": "Epic", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "533639787", "intMusicVidLikes": "2056699", "intMusicVidDislikes": "173841", "intMusicVidFavorites": "0", "intMusicVidComments": "143104", "intTrackNumber": "11", "intLoved": "1", "intScore": "9.66667", "intScoreVotes": "6", "intTotalListeners": "211441", "intTotalPlays": "1299559", "strMusicBrainzID": "18b7683b-e085-44d6-a4db-358d6284f51f", "strMusicBrainzAlbumID": "e041d145-a199-4ea9-8aba-4988eb4586d7", "strMusicBrainzArtistID": "b2029169-2574-4305-820f-252a5fde3697", "strLocked": "Unlocked"}]}