{"track": [{"idTrack": "33973980", "idAlbum": "2212099", "idArtist": "111611", "idLyric": "0", "idIMVDB": "0", "strTrack": "Photograph", "strAlbum": "x", "strArtist": "Ed Sheeran", "strArtistAlternate": null, "intCD": null, "intDuration": "257611", "strGenre": "Pop", "strMood": "Philosophical", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Photograph\" is a song recorded by the English singer-songwriter, Ed Sheeran, for his second studio album, × (2014). Sheeran wrote the song with Snow Patrol member, Johnny McDaid, who had a piano loop from which the composition developed. After recording several versions with other producers, Sheeran eventually solicited help from Jeff Bhasker; the collaboration generated a version that Bhasker further enhanced for months. The ballad derives its music primarily from an acoustic guitar, piano and programmed drums. With visually descriptive lyrics, it discusses a long-distance relationship inspired by Sheeran's own experience of being away from his then-girlfriend while he was on tour.\n\nThe song received generally positive commentary from critics, who noted the lyrics and Sheeran's use of imagery. \"Photograph\" served as the fifth and final single from the album. It reached the top five on the main singles charts in more than five countries. In the US, where it peaked at No. 10, \"Photograph\" became the third single from the album to have reached within the top ten. In the UK, it reached No. 15 and has since been certified platinum for sales of 600,000 units. The single has also been certified double platinum in Australia and Canada, and platinum in New Zealand and Italy.\n\nThe single's release on 11 May 2015 followed the premiere of the music video on 9 May 2015. The video is a montage of real home footage of Sheeran's infancy, childhood and adolescence, providing insight on his private early life such as his inclination to playing music instruments and fondness of Lego. The video was nominated for Best Video at the 2016 Brit Awards. Sheeran performed the song on television shows and on his x Tour, which ran from 2014 to 2015.\n\nOn 9 June 2016, it was revealed that Sheeran was being sued by songwriters Martin Harrington and Thomas Leonard, writers of Matt Cardle's 2011 single \"Amazing\", for $20 million for copyright infringement.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=nSDgHBxUbVQ", "strMusicVidDirector": "Emil Nava", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "908400240", "intMusicVidLikes": "4659622", "intMusicVidDislikes": "132220", "intMusicVidFavorites": "0", "intMusicVidComments": "142986", "intTrackNumber": "6", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "461727", "intTotalPlays": "4029876", "strMusicBrainzID": "7dcbc1be-4257-4d64-b915-045dfb23ae88", "strMusicBrainzAlbumID": "c24e5416-cd2e-4cff-851b-5faa78db98a2", "strMusicBrainzArtistID": "b8a7c51f-362c-4dcb-a259-bc6e0095f0a6", "strLocked": "Unlocked"}]}