{"track": [{"idTrack": "34100639", "idAlbum": "2222841", "idArtist": "111352", "idLyric": "0", "idIMVDB": null, "strTrack": "Style", "strAlbum": "1989", "strArtist": "Taylor Swift", "strArtistAlternate": null, "intCD": null, "intDuration": "231000", "strGenre": "Pop", "strMood": "Needy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Style\" is a song by American singer-songwriter Taylor Swift and is the third track from her fifth studio album, 1989. The pop rock song was written by Swift, Max Martin, Shellback and Ali Payami. It was released to radio by Republic Records, in partnership with Swift's label Big Machine Records, on February 9, 2015, as the album's third single after \"Blank Space.\"\n\n\"Style\" received positive reviews from music critics, most of whom praised the '80s-styled production and its 'thrilling' tone. \"Style\" has peaked at number six on the U.S. Billboard Hot 100 chart, becoming the third consecutive top-10 single from 1989 in the country, and entered the top-10 on charts of numerous regions, including Australia, Canada, and South Africa. It also made the top 40 in countries like the United Kingdom, Austria, Czech Republic, Hungary, Ireland, New Zealand and the Netherlands.\n\n\"Style\" debuted as a snippet in a Target commercial to promote her album. In late December 2014, Big Machine Records head Scott Borchetta answered a fan's question on an impromptu Q&A on social networking site Twitter. The fan asked, \"What's Taylor's next single?,\" and Borchetta responded promptly that he was leaning towards \"Style\"—it was an \"obvious single choice\", according to Billboard. In January 2015, Republic Records officially announced \"Style\" as Swift's third single from 1989, set for a release of February 9, 2015. Swift explained the meaning and inspiration of the song to Ryan Seacrest during an interview on iHeartRadio in October 2014.\n\nI loved comparing these timeless visuals with a feeling that never goes out of style ... It's basically one of those relationships that's always a bit off ... The two people are trying to forget each other. So, it's like, \"All right, I heard you went off with her,\" and well, I've done that, too ... My previous albums have also been sort of like, \"I was right, you were wrong, you did this, it made me feel like this\"—a righteous sense of right and wrong in a relationship. What happens when you grow up is you realize the rules in a relationship are very blurred and that it gets very complicated very quickly, and there's not a case of who was right or who was wrong.\n\n\"Style\" has a tempo of 95 beats per minute and is written in the key of D major. Jason Lipshutz from Billboard characterized \"Style\" as a \"James Dean-evoking\" pop rock song. Meanwhile, Los Angeles Times‍ '​s Mikael Wood and The Observer‍ '​s Kitty Empire described the track as funk-pop. On behalf of Time, however, Sam Lansky detailed it as a \"disco anthem.\"\n\nThe accompanying music video was directed by Kyle Newman. On February 10, 2015, Swift posted a teaser for the music video and its release date on Instagram. The video showed Swift's head and steam/smoke tendrils rising up her neck. A second teaser was posted on Swift's social media accounts the next day, depicting shadowy trees on her back. A third teaser was released showing lightning and two different colored eyes being projected onto Swift as she stands against a blank backdrop.\n\nThe video was scheduled to be released on Good Morning America on February 13, 2015, but appeared a few hours before the scheduled time through Canadian music channel Much. The video was then quickly uploaded to Swift's official Vevo account. Swift's love interest in the video is played by model Dominic Sherwood, whose eyes are two different colors due to heterochromia. Some of the scenes were shot in the Hercules Cave in Tangier, Morocco as she mentioned it on Facebook.\n\nThe video opens with a silhouette of Swift's head containing a scene in which her boyfriend (played by Sherwood) is standing in a seashore. As the song starts, it can been seen that Swift is holding on to a paper airplane necklace (similar to the one in her \"I Knew You Were Trouble\" video, and a reference to the \"necklace hanging from my neck\" and \"two paper airplanes, flying\" in \"Out of the Woods\") with scenes of her in the woods accompanied by various flashbacks. The man is shown waking up from a bed interspliced by Swift in a dim-lit room. As the chorus begins, the man holds a mirror in front of him in which Swift’s lips are overlaid which is followed by various scenes in which images of Swift and the man get projected on one another. As the video progresses the man can be seen driving a car with Swift in the back seat. He then takes off his shirt joined by Swift as they embrace and kiss each other. Through the following clips the man is shown on a beach while Swift sings in a dim-lit room. The video ends with the man pulling up his car at night as Swift rises from sitting on the ground in an isolated location and turns towards him.\n\nRolling Stone writer Daniel Kreps opined that unlike the music videos for \"Shake It Off\" and \"Blank Space\", \" is a different beast, showcasing Swift in a darker, more abstract, light.\" Jessica Derschowitz of CBS News agreed calling the video \"a major departure from the more playful videos for her earlier 1989 singles \"Blank Space\" and \"Shake It Off.\" Emilee Lindner of MTV felt the video was \"mature, tasteful, and, dare I say… sexy?\" InStyle deemed it \"Swift's most cinematic video to date.\" Louis Virtel of HitFix described the video as \"a slow throb, a pleasant recollection of quaint memories with a cute boy who resembles James Dean.\" The Wall Street Journal‍‍ '​‍s Michael Driscoll wrote: \"the video is reminiscent of '80s pop with its steady synth bass line and images that may bring to mind Chris Isaak's 'Wicked Game', from an album also released in 1989.\" Mikael Wood of the Los Angeles Times found that the video contains \"a creepy homage to David Lynch's Mulholland Drive, with Sherwood looking in the rear-view mirror of his car and finding Swift staring back at him.\" The Huntington News said, \"While the track is one of the album’s best, the video  leaves something to be desired\" and called the video \"very hipster – the whole things looks as if it was shot through an Instagram filter by a man wearing thick-framed specs.\"", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=-CmadmM5cOk", "strMusicVidDirector": "Kyle Newman", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "700660194", "intMusicVidLikes": "3436145", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "154296", "intTrackNumber": "3", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": "225734", "intTotalPlays": "4259175", "strMusicBrainzID": "4459f042-afff-4fa3-b5e5-e10d9782992d", "strMusicBrainzAlbumID": "4d9ec1c2-58ec-48a4-aa0a-916718adead0", "strMusicBrainzArtistID": "20244d07-534f-4eff-b4d4-930878889970", "strLocked": "Unlocked"}]}