{"track": [{"idTrack": "34430134", "idAlbum": "2249662", "idArtist": "136837", "idLyric": "0", "idIMVDB": "2147483647", "strTrack": "Trap Queen", "strAlbum": "Fetty Wap", "strArtist": "Fetty Wap", "strArtistAlternate": null, "intCD": null, "intDuration": "222093", "strGenre": "Rap", "strMood": "Confrontational", "strStyle": "West Coast Rap", "strTheme": "...", "strDescriptionEN": "\"Trap Queen\" is the debut single by American rapper Fetty Wap from his self-titled debut album (2015). Following its online premiere in March 2014, it was released independently on April 22, 2014 before being re-released in conjunction with 300 Entertainment on December 15, 2014. The song was well received by critics who praised the vocals and production for being cheery and infectious.\n\nIn 2015, \"Trap Queen\" became Fetty Wap's first entry on the Billboard Hot 100 and was a sleeper hit which ultimately went on to be a top ten hit, peaking at number 2; the song spent 25 consecutive weeks in the top-10. \"Trap Queen\" has peaked within the top ten of the charts in Denmark and the United Kingdom. An accompanying music video for the song, directed by Nitt Da Gritt, was released on his YouTube page that features Wap and his girlfriend partying at their apartment. He first performed the song on television at the 2015 MTV Movie Awards with Fall Out Boy and would make later appearances at The Tonight Show with Jimmy Fallon, Jimmy Kimmel Live!, Nick Cannon Presents Wild 'n Out and the BET Awards 2015 to perform the song. The song received two nominations at the 58th Grammy Awards: Best Rap Song and Best Rap Performance.\n\nFetty Wap, a native of Paterson, New Jersey, had been rapping and recording music locally as a member of the Remy Boyz 1738 rap troupe, which includes Montana \"Monty\" Buckz. Wap conceived \"Trap Queen\" in late 2013 and recorded the song the following March after hearing what would become its backing track, which had been produced by Tony Fadd of the Paterson-based RGF Productions. It was the first recording on which Wap had sung, as he had been anxious to try \"something different\". The original studio recording consisted of three sung verses that Wap had freestyled in the melody he had written. The recording was uploaded to SoundCloud shortly after in March 2014, where it soon began amassing plays. An extended version of the initial recording, featuring an additional spoken outro, was included on Wap's Up Next mixtape, which was initially sold locally in Paterson and later released online. This version of the song was also independently released on April 22, 2014 as a standalone digital single under Goodfella4life Entertainment.\n\nAlthough Wap had a feeling that \"Trap Queen\" was a potential hit even before recording the song, particularly when he first heard the beat, his suspicions that it could reach an audience outside his own region were confirmed later as he noticed its growing popularity on social media websites like Twitter and Instagram; meanwhile, its play count on SoundCloud had increased to over a million within its first months online. To take advantage of the increased attention the song was receiving, a revised version was subsequently made for radio which shortened the total runtime and included an additional rapped verse following the first iteration of the chorus.\n\nIn November 2014, Wap and RGF Productions partnered with Lyor Cohen's Atlantic Records-distributed label 300 Entertainment to give \"Trap Queen\" a full-fledged commercial release. The two labels jointly issued the most recent edit of the single to digital retailers on December 15, 2014.\n\nWritten by Fetty Wap and produced by Tony Fadd of RGF Productions, \"Trap Queen\" is a melodic hip hop and R&B song containing elements of electronic and trap music. Wap sings most of the song's verses, along with its chorus, in a gritty, melodic delivery reminiscent of contemporary Southern hip hop artists such as Gucci Mane, Future, Rich Homie Quan, and Young Thug. Wap's sung vocals, particularly during the song's chorus, are digitally altered. One additional verse, following the first iteration of the chorus, is rapped in a more straightforward, traditional style. The song's beat is largely characterized by its trap percussion and synthesized chords.\n\nLyrically, \"Trap Queen\" is a giddy, affectionate tribute to a girlfriend and \"partner in crime\" whom Wap calls his trap queen. Wap has clarified that the song was written about an ex he had been dating and dealing with during his own time in the trap. In its lyrics, Wap proclaims his love for his girlfriend, fondly recalling counting money, going shopping, going to the strip club, getting high, and \"cooking pies\" with her. The lyrics also express an aspirational quality, with Wap and his girlfriend setting a goal to buy matching Lamborghinis with the money they earn together. Ural Garrett of HipHopDX compared the song's lyrical approach to urban fiction narratives, stating that its themes \"wouldn't feel too out of place in writings from Zane, Wahida Clark or Mz. Lady P\".\n\nThe also song refers to dealing crack cocaine.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qvvuww1488799019.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=i_kF4zLNKio", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "591842954", "intMusicVidLikes": "2867528", "intMusicVidDislikes": "190069", "intMusicVidFavorites": "0", "intMusicVidComments": "148718", "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "290712", "intTotalPlays": "1788063", "strMusicBrainzID": "ef91ff41-c6bf-4d01-ab2d-c48bf9e2641b", "strMusicBrainzAlbumID": "b795b26b-5c11-48f9-b82b-8371dd316504", "strMusicBrainzArtistID": "e3492ea0-5997-4241-a7bf-2fd7fb1bfad1", "strLocked": "Unlocked"}]}