{"track": [{"idTrack": "34455502", "idAlbum": "2251733", "idArtist": "111626", "idLyric": "0", "idIMVDB": "2147483647", "strTrack": "What Do You Mean?", "strAlbum": "Purpose", "strArtist": "Justin Bieber", "strArtistAlternate": null, "intCD": null, "intDuration": "205000", "strGenre": "Pop", "strMood": "Good Natured", "strStyle": "Rock/Pop", "strTheme": null, "strDescriptionEN": "\"What Do You Mean?\" is a song recorded by Canadian singer Justin Bieber for his upcoming fourth studio album Purpose. The song was announced on July 28, 2015, on On Air with Ryan Seacrest, and released on August 28, 2015, as the album's lead single. It was well received by music critics. The track was also a commercial success in his home country, topping the Canadian Hot 100. \"What Do You Mean?\" debuted at the number one position on the Billboard Hot 100 where it stayed for one week, and topped various other charts worldwide, including Australia, Norway and the United Kingdom.\n\"What Do You Mean?\" was written by Bieber, Jason Boyd and Mason Levy. It is a pop and tropical house-inspired song. Bieber uses a breathy vocal. The production contains flute instrumentation, piano chords, tropical synths, bass and \"slick beat\" elements with the sound of a clock ticking. Gil Kaufman of MTV News writes that the track contains \"a slippery flute-like trill over a spare tick-tock island groove and a super chill vibe\", and is \"a kind of sequel\" to Skrillex and Diplo's \"Where Are Ü Now\", which featured Bieber. It was initially speculated by the media that Skrillex produced \"What Do You Mean?\". However, a spokesperson for Bieber confirmed in an interview for Rolling Stone that the song was produced by Bieber, and MdL who had previously collaborated with the singer on his single \"Boyfriend\" (2012). Written in the key of A♭ major, it has an upbeat tempo of 120-126 beats per minute.\nA lyric video for \"What Do You Mean?\", directed by Laban and featuring skateboarders Ryan Sheckler and Chelsea Castro, was released on August 28, 2015. A music video, directed by Brad Furman and starring John Leguizamo and Xenia Deli, premiered on August 30, following the 2015 MTV Video Music Awards. The video starts off with a man (played by Actor John Leguizamo) waiting at a stop sign in front of a motel in the rain. A dark hooded figure (revealed to be Bieber) walks to the man. It is realized that Bieber is in debt to him, and then gives him money and is promised to do one job: protect a girl, (Bieber's love interest.), as Bieber then walks away. As the song begins, it cuts to a neon-lighted hotel room, where the girl that was mentioned earlier is. Then, Bieber knocks on the door and as she refuses, Bieber then forces himself in. They both end up making love to each other. As the Bieber sings the second the verse, a group of masked men burst in and then tie and then kidnap Bieber and the girl. Is it then cut to Bieber and the girl tied up an abandoned warehouse, trying to escape. They eventually find a lighter and use it to burn the rope and escape. The masked men finds out they escaped and chases after them. They use the door, but realize that it leads to jumping outside to the ground. When the men is almost up to them, Bieber jumps out first and then the girl. They both land safely on an inflatable mat. We then see Leguizamo again who reveals himself as the leader of the masked men, as he is greeted by Bieber. We also see where that they landed is an underground skatepark party, as Bieber sings the rest of the song. The video ends with Bieber standing in the dark, in the skatepark, alone.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=DK_0jXPuIr0", "strMusicVidDirector": "Brad Furman", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "284505093", "intMusicVidLikes": "2331971", "intMusicVidDislikes": "259123", "intMusicVidFavorites": "0", "intMusicVidComments": "191866", "intTrackNumber": "3", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "364945", "intTotalPlays": "3397653", "strMusicBrainzID": "77af5f95-4c6f-4bb9-805a-85088a9c27fd", "strMusicBrainzAlbumID": "2660de3c-56db-4bd1-bf99-e162c68e5712", "strMusicBrainzArtistID": "e0140a67-e4d1-4f13-8a01-364355bee46e", "strLocked": "Unlocked"}]}