{"track": [{"idTrack": "34100645", "idAlbum": "2222841", "idArtist": "111352", "idLyric": "0", "idIMVDB": null, "strTrack": "Wildest Dreams", "strAlbum": "1989", "strArtist": "Taylor Swift", "strArtistAlternate": null, "intCD": null, "intDuration": "220000", "strGenre": "Pop", "strMood": "Needy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Wildest Dreams\" is a song recorded by American singer-songwriter Taylor Swift for her fifth studio album, 1989. The song was released to radio by Big Machine Records and Republic Records on August 31, 2015, as the album's fifth single. Swift wrote the song with its producers Max Martin and Shellback. Musically, \"Wildest Dreams\" is a dream pop and soft rock power ballad, with the lyrics describing Swift's plea for her lover to remember her.  The accompanying music video was directed by Joseph Kahn.\n\n\"The latest Taylor Swift video directed by Joseph Kahn was never going to be anything less than spectacular, and this one for Wildest Dreams was shot on location in Africa. An extraordinary version of Africa it is too: the wild animals are tame, and actual Africans are as rare as hen's teeth. This colonial-era tale of thwarted love, with Swift as an Ava Gardner or Liz Taylor-type movie star shooting a Mojambo-style movie with a handsome hunk (played by Scott Eastwood, son of Clint), lacks the bite of Blank Space and bombast of Bad Blood. But the singer has pledged that what she makes from the video - presumably from plays and pre-roll ads on YouTube - will go to a wildlife charity. So start watching.\" (David Knight, Promonews)\n\nThe video received mixed reviews. In an article on the Huffington Post, Lauren Duca wrote that the video \"channels wild colonialism\", and \"instead of the cultural appropriation that has become almost status quo in today's pop music, Swift has opted for the bolder option of actually just embodying the political exploitation of a region and its people.\" On the Daily Dot, Nico Lang said the video \"has a major race problem\", and \"for a clip that’s set in Africa - it’s about as white as a Sunday morning farmer’s market.\"\nJoseph Kahn, who directed the video, responded to accusations that the video glorified colonialism, saying: \"This is not a video about colonialism but a love story on the set of a period film crew in Africa, 1950. ... We collectively decided it would have been historically inaccurate to load the crew with more black actors as the video would have been accused of rewriting history. This video is set in the past by a crew set in the present and we are all proud of our work.\"", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/npe4fh1631910358.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "www.youtube.com/watch?v=IdneKLhsWOQ", "strMusicVidDirector": "Joseph Kahn", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "806478047", "intMusicVidLikes": "4843390", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "227998", "intTrackNumber": "9", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": "216398", "intTotalPlays": "3145333", "strMusicBrainzID": "598bc2a9-1a27-4f6a-a7cc-30649303edca", "strMusicBrainzAlbumID": "4d9ec1c2-58ec-48a4-aa0a-916718adead0", "strMusicBrainzArtistID": "20244d07-534f-4eff-b4d4-930878889970", "strLocked": "Unlocked"}]}