{"track": [{"idTrack": "35776087", "idAlbum": "2372643", "idArtist": "111493", "idLyric": null, "idIMVDB": null, "strTrack": "Easy on Me", "strAlbum": "Easy on Me", "strArtist": "Adele", "strArtistAlternate": null, "intCD": null, "intDuration": "224000", "strGenre": "Soul", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"Easy on Me\" is a song recorded by English singer-songwriter Adele released on 15 October 2021, through Columbia Records as the lead single from her fourth studio album, 30 (2021). Her first musical release in nearly five years, \"Easy on Me\" was produced by American record producer Greg Kurstin, who also co-wrote the song with Adele. A minimally produced ballad, the song is set to a prominent, sombre piano, propelled by sparse bass beats. Expressing themes of nostalgia, regret, and forgiveness, the song's lyrics represent Adele's plea to her son, in which she details her struggles with her dissolved marriage and requests him to be kind to her.\n\nMusic critics reviewed the song positively, with praise towards its poignant lyrics and emotional vocals, though some opined it did not match the emotional heights of her previous ballads. Commercially, the song was an immediate global success, breaking the Spotify and Amazon Music records for the most streams for a song in a day or a week. It topped the charts in 25 countries, including the United Kingdom, and United States, marking her third and fifth chart toppers in the respective territories.\n\nAn accompanying music video, directed by Canadian filmmaker Xavier Dolan and shot in Sutton, Quebec, was released on 15 October 2021, continuing the setting established in the music video for Adele's 2015 song \"Hello\", where she is seen entering a furnished house. In the \"Easy on Me\" video, Adele vacates the house and drives off in a truck as a pile of sheet music flies out of it, littering the road.\n\nThe accompanying music video for \"Easy on Me\" was filmed on 15–16 September 2021 in Quebec, and directed by Canadian filmmaker Xavier Dolan who had previously worked with Adele on the music video for her 2015 single \"Hello\". Filming took place at the Chemin Jordan and the Domaine Dumont Chapelle Ste-Agnès in Sutton, a town in southwestern Quebec, including the same house used for \"Hello\". The music video opens in black and white and shifts to colour halfway through, as the track's beat becomes more prominent. Adele vacates the house and drives off in a furniture-filled truck, past a \"Sold\" sign board planted by the property. Numerous pages of sheet music fly out the car's back windows and scatter all over a road as she drives away. A video of bloopers from the production of the music video was released on 4 November 2021.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/75mbqg1685743795.jpg", "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "https://www.youtube.com/watch?v=U3ASj1L6_sY", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "169939511", "intMusicVidLikes": "5090597", "intMusicVidDislikes": "67009", "intMusicVidFavorites": "0", "intMusicVidComments": "247745", "intTrackNumber": "1", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "a7720370-b5a1-49b0-983a-85081f0bcbfe", "strMusicBrainzAlbumID": "0d5d0ca4-d42d-432b-960a-0307ea6845a1", "strMusicBrainzArtistID": "cc2c9c3c-b7bc-4b8b-84d8-4fbd8779e493", "strLocked": "Unlocked"}]}