{"track": [{"idTrack": "35787853", "idAlbum": "2373873", "idArtist": "111611", "idLyric": null, "idIMVDB": null, "strTrack": "Shivers", "strAlbum": "=", "strArtist": "Ed Sheeran", "strArtistAlternate": null, "intCD": null, "intDuration": "207853", "strGenre": "Pop", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"Shivers\" is a song by English singer-songwriter Ed Sheeran, released through Asylum Records and Atlantic Records on 10 September 2021 as the second single from his fifth studio album, = (2021). \"Shivers\" entered atop the charts in the United Kingdom and Ireland, dethroning Sheeran's previous single \"Bad Habits\" after eleven consecutive weeks at the summit in both countries. The song also topped the charts in Austria, Germany, Sweden and Switzerland and peaked at number five on the Billboard Hot 100.\n\nBackground\nSheeran referred to the song while explaining why the album title was = instead of –, as fans had predicted, in which he said: \"I was making the record and I wrote a song called 'Shivers' and I was like, 'This doesn't really feel like \". Sheeran wrote \"Shivers\" at the end of the Divide tour, when he set up a studio at a rented farm in Suffolk where he had his last date of the tour. It took him 3 days to write the song, which was unusually long for him, as he felt the song \"was too special to get wrong\".\n\nRelease and promotion\nOn 19 August 2021, Sheeran announced his fourth studio album, =, in which the song is listed on the tracklist. He later announced the cover art and release date of the song on 2 September 2021. He also revealed that \"Shivers\" was originally intended to be the lead single for the album instead of its current lead single, \"Bad Habits\". A preview of the song was also listed. Sheeran announced its accompanying music video and a teaser video of it on Labour Day, 6 September 2021.\n\nCritical reception\nOn 2 September 2021, the same day Sheeran announced the song, Jonathan Heaf from the United Kingdom branch of GQ in Sheeran's hometown, described the song as \"a sexy, rocketing song that includes hand claps in the bridge and is music to dance to with your best friends after three too many tequilas\".\n\nMusic video\nA music video was released along with the song on 10 September 2021, starring Sheeran and AnnaSophia Robb. Just like his previous video \"Bad Habits\", it was directed by Dave Meyers. Sheeran emulates fellow English singer Elton John.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/ik3t0j1637333854.jpg", "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "https://www.youtube.com/watch?v=Il0S8BoucSA", "strMusicVidDirector": "Dave Meyers", "strMusicVidCompany": "<a href=\"https://trendymic.com\">music world</a>", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "186343018", "intMusicVidLikes": "1856719", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "52228", "intTrackNumber": "2", "intLoved": "1", "intScore": "10", "intScoreVotes": "2", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "d199de3b-e552-410e-b45e-eaf178b763dc", "strMusicBrainzAlbumID": "51182052-d6d4-49a0-bd87-a88cdb211bed", "strMusicBrainzArtistID": "b8a7c51f-362c-4dcb-a259-bc6e0095f0a6", "strLocked": "Unlocked"}]}