{"track": [{"idTrack": "34793128", "idAlbum": "2279758", "idArtist": "111239", "idLyric": null, "idIMVDB": "0", "strTrack": "Hymn for the Weekend", "strAlbum": "A Head Full of Dreams", "strArtist": "Coldplay", "strArtistAlternate": null, "intCD": null, "intDuration": "258826", "strGenre": "Alternative Rock", "strMood": "Happy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Hymn for the Weekend\" is a song by British rock band Coldplay, featuring uncredited vocals by American singer Beyoncé. It was released on 25 January 2016 as the second single from their seventh studio album, A Head Full of Dreams (2015). The song was written by the members of Coldplay and produced by Rik Simpson, Tim Bergling, Digital Divide, and Stargate.\n\n\"Hymn for the Weekend\" has reached number six on the UK Singles Chart and also reached the top twenty in countries such as Switzerland, Ireland, France, Sweden, Austria, Belgium, Italy and Spain. In the US, with the Seeb remix, the song reached number 25 on the US Billboard Hot 100. A music video for the song was released on 29 January 2016 and features Coldplay and Beyoncé in various cities in India.\n\nThe song was debuted on Annie Mac's BBC radio show on 30 November 2015, and Coldplay bassist Guy Berryman dialed in after the song aired to talk about his brush with royalty. According to Berryman, lead singer Chris Martin originally wanted the song to be a party song with the lyrics \"drinks on me, drinks on me\", but fortunately his bandmates didn't think that would go well with their fans. Martin's longtime friend Beyoncé was asked to sing on the song, and she accepted the request.\n\nMartin corroborated Berryman's story about the band protesting him singing, \"Drinks on me, drinks on me\" in an interview with The Wall Street Journal. According to Martin, the original kernel was that he \"was listening to Flo Rida or something\", and he thought, \"it's such a shame that Coldplay could never have one of those late-night club songs, like \"Turn Down for What\". I thought I’d like to have a song called 'Drinks on Me' where you sit on the side of a club and buy everyone drinks because you're so fucking cool,\" Martin recalled. \"I was chuckling about that, when this melody came, 'drinks on me, drinks on me', then the rest of the song came out. I presented it to the rest of the band and they said, 'We love this song, but there's no way you can sing \"drinks on me.\"' So that changed into 'drink from me' and the idea of having an angelic person in your life. Then that turned into asking Beyoncé to sing on it.\"\n\n\"Hymn for the Weekend\" is written in the key of C minor set in a 4\n4 time signature at a moderate tempo of 90 beats per minute.\n\nAccording to The Times of India, the video was shot in October 2015 at various Indian cities including Varanasi, Worli Village, Mumbai and Kolkata. The fort showcased at the start and in between is Bassein Fort aka Saint Sebastian's Fort located in Vasai, Mumbai. The video was also shot at the famous Maratha Mandir theatre which is reputed for showcasing a single film for 15 straight years. The video is themed on the North Indian festival of Holi. The video was filmed by Ben Mor, and was released on 29 January 2016. The video features Beyoncé and Indian actress Sonam Kapoor.\n\nThe music video was criticized on Indian social media network for its stereotypical portrayal of Indian society.\n\nIt has over 730 million views as of May 2017, becoming the most viewed music video for both Coldplay and Beyoncé.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xurwxs1495702849.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=YykjpeuMNEk", "strMusicVidDirector": "Ben Mor", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "1250670032", "intMusicVidLikes": "7053697", "intMusicVidDislikes": "218460", "intMusicVidFavorites": "0", "intMusicVidComments": "264743", "intTrackNumber": "3", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "ea9f40ba-837a-4bf9-96a2-0639d98beb06", "strMusicBrainzAlbumID": "27da3ef8-f3b0-47bf-898d-9bdf4af7fc04", "strMusicBrainzArtistID": "cc197bad-dc9c-440d-a5b5-d52ba2e14234", "strLocked": "Unlocked"}]}