{"track": [{"idTrack": "34591810", "idAlbum": "2263473", "idArtist": "114897", "idLyric": null, "idIMVDB": null, "strTrack": "I Took a Pill In Ibiza", "strAlbum": "At Night, Alone.", "strArtist": "Mike Posner", "strArtistAlternate": null, "intCD": null, "intDuration": "280803", "strGenre": "R&B", "strMood": "Dreamy", "strStyle": "Urban/R&B", "strTheme": "Party", "strDescriptionEN": "\"I Took a Pill in Ibiza\" (also known by its censored title \"In Ibiza\" or its clean title \"I Took a Plane to Ibiza\") is a song by American singer Mike Posner. The song, originally acoustic guitar-based, was remixed by the Norwegian duo SeeB and released in the United States on July 24, 2015, digitally as a single from Posner's second EP, The Truth as well as the lead single from his second studio album, At Night, Alone..\n\nThe SeeB remix reached the top ten of the charts in twenty seven countries, including number one in Belgium, Ireland, Israel, Netherlands, Norway and the United Kingdom. In the latter country, the song remained at the top of the charts for four weeks. It has achieved high chart positions in Posner's native United States, where it reached number one on both the Billboard Dance/Mix Show Airplay Chart and the Billboard Pop Songs chart. It also peaked at number four on the main chart Billboard Hot 100. The song became Posner's biggest single, outperforming his debut, \"Cooler than Me\" (2010), and was later nominated for Grammy Award for Song of the Year.\n\nThe original version of \"I Took a Pill in Ibiza\" is a folk pop song, while the SeeB remix is a tropical house song. The remix is written in the key of G minor in half time with a tempo of 102 beats per minute. It follows a chord progression of Gm – F – E♭maj7 – B♭, and Posner's vocals span from B♭3 to D5.\n\nA music video featuring the SeeB remix was launched via Posner's YouTube Vevo account on February 26, 2016. It portrays Posner as a druggie whose face is replaced by a papier-mâchéd mask. The man spends the video becoming increasingly intoxicated as he mingles with girls and his equally self-destructive friends. The man sings about how his fame, having long since faded, left him completely empty inside and unable to feel any kind of fulfillment, causing him to attempt to fill the void with his rampant hedonism and material possessions.\n\nA second music video featuring the original version was released on March 15, 2016. It features Posner with sheets of paper depicting lyrics of the song in a style similar to Bob Dylan's 1965 electric folk song, \"Subterranean Homesick Blues\".", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xwxqvq1483436525.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=foE1mO2yM04", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/tryywt1483436713.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/ssvpqs1483436727.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/srpxru1483436733.jpg", "intMusicVidViews": "1532945780", "intMusicVidLikes": "7849981", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "230071", "intTrackNumber": "2", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": "53913", "intTotalPlays": "342140", "strMusicBrainzID": "c1d140f2-097a-4d05-978c-a675d5022b71", "strMusicBrainzAlbumID": "d3677a23-b945-4210-be20-f5b57fa7e740", "strMusicBrainzArtistID": "5b64e344-b2fb-47bd-bd7b-4c793b17d472", "strLocked": "Unlocked"}]}