{"track": [{"idTrack": "34594546", "idAlbum": "2263655", "idArtist": "131472", "idLyric": null, "idIMVDB": "0", "strTrack": "NO", "strAlbum": "Thank You", "strArtist": "Meghan Trainor", "strArtistAlternate": null, "intCD": null, "intDuration": "213000", "strGenre": "Pop", "strMood": "Quirky", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"No\" (stylized as \"NØ\") is a song by American singer and songwriter Meghan Trainor, recorded for her second major-label studio album, Thank You (2016). It was written by Trainor, Eric Frederic, and Jacob Kasher Hindlin, and produced by Ricky Reed. The track was released on March 4, 2016, as the lead single from the album.\n\nBacked by an instrumental of ripping guitars, the dance-pop and R&B song draws some influences from doo-wop, with lyrics about men who \"can't take the hint\" when their advances towards women are rejected. Its composition was compared by several critics to various pop artists of the late 1990s and early 2000s, such as Britney Spears and NSYNC. It debuted at number 21 on Radio Songs, becoming the highest debut on the chart since Lady Gaga's \"Born This Way\". The song peaked at number three on the US Billboard Hot 100, and was nominated for Choice Music Single: Female at the 2016 Teen Choice Awards.\n\nThe accompanying music video for the song was set at a warehouse. The video was noted to be visually darker than Trainor's previous clips and features her dancing alongside an all-female dance troupe. The clip drew comparisons to the works of Spears and Madonna for its sexual nature.\n\nThe video for \"No\" was directed by Fatima Robinson. In an interview with Time, Trainor confirmed the filming of the accompanying music video took place on March 4, 2016. The music video was released on March 21, 2016 on Trainor's Vevo page. Visually darker than her previous clips, the singer joins a female dance troupe in a warehouse. Joe Lynch from Billboard opined: \"Trainor gives serious early '00s Britney and early '90s Madonna vibes. It's a much sexier look than we're used to seeing from Trainor, but she owns it.\" For Fuse's Emilee Lindner, Trainor is \"shedding the bubblegum pink and pastel blues of her Title era and delving in the darkness of her new brown-haired persona.\" As of August 2018 it has over 500 million views on YouTube.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rxyrqr1533245765.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=cMTAUr3Nm6I", "strMusicVidDirector": "Fatima Robinson", "strMusicVidCompany": "Epic", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "500324573", "intMusicVidLikes": "3071283", "intMusicVidDislikes": "333291", "intMusicVidFavorites": "0", "intMusicVidComments": "262096", "intTrackNumber": "3", "intLoved": "0", "intScore": "10", "intScoreVotes": "3", "intTotalListeners": "128956", "intTotalPlays": "1023332", "strMusicBrainzID": "f9529f15-1c31-4b41-8651-a57feb7ec4b1", "strMusicBrainzAlbumID": "dc475b10-44d7-47e8-9cb5-d1a1b3c9495d", "strMusicBrainzArtistID": "b2029169-2574-4305-820f-252a5fde3697", "strLocked": "Unlocked"}]}