{"track": [{"idTrack": "34719934", "idAlbum": "2273822", "idArtist": "112024", "idLyric": null, "idIMVDB": "0", "strTrack": "Starboy", "strAlbum": "Starboy", "strArtist": "The Weeknd", "strArtistAlternate": null, "intCD": null, "intDuration": "230000", "strGenre": "R&B", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"Starboy\" is a song recorded by Canadian singer The Weeknd for his third studio album of the same name. It features French electronic duo Daft Punk and was written by the trio alongside Doc McKinney, Henry Walter and Jason Quenneville, being produced by Daft Punk and co-produced by The Weeknd, McKinney and Cirkut. It was released as the first single from the album on September 22, 2016, by XO and Republic Records. It is an R&B song with lyrics that contain themes of extravagance of a celebrity life.\n\n\"Starboy\" topped the charts in countries such as Canada, France, Netherlands, New Zealand and Sweden, as well as the US Billboard Hot 100, where it became The Weeknd's third chart-topper, and Daft Punk's first chart-topper. The music video for the song was directed by frequent collaborator Grant Singer, who directed The Weeknd's previous music videos for \"Can't Feel My Face\" and \"The Hills\". In the music video, The Weeknd is shown trying to destroy evidence of his previous self, including his own awards from his past album, Beauty Behind the Madness. The video has been described as The Weeknd's attempt to murder his former persona.\n\n\"Starboy\" was released on September 22, 2016, following the announcement of the album and its accompanying artwork a day earlier. \"Starboy\" is an R&B song that incorporates themes of the extravagance associated with a celebrity lifestyle and also discusses how the celebrity lifestyle can make an entertainer fragile.\n\nThe music video for the song was directed by frequent collaborator Grant Singer, who directed The Weeknd's previous music videos for \"Can't Feel My Face\" and \"The Hills\". It was released through the singer's official Vevo account on September 28, 2016 on YouTube, along with an accompanying poster which Rolling Stone described as \"pulp-horror-inspired\". The video has been described as the singer's attempt to kill his former/old persona, perhaps signaling he is reinventing himself with this new album, by suffocating himself, clipping his old hairstyle, and crushing his glass-framed platinum records.\n\nSeveral cars owned by The Weeknd are mentioned in the song's lyrics and featured in the video, including the Lamborghini Aventador SV Roadster which he sings in his second verse: \"Pull off in that Roadster SV/ Pockets overweight, getting hefty,\" a Bentley Mulsanne: \"No competition, I don't really listen/ I'm in the blue Mulsanne bumping New Edition,\" and the McLaren P1: \"I'm trying to put you in the worst mood/ P1 cleaner than your church shoes.\" Billboard approached John Paolo Canton, McLaren Automotive's director of public relations, in order to find out the owner of the car, as their website stated \" even the world's biggest carmaker  afford product placement like this, let alone a boutique British brand\". Canton later confirmed that the car did belong to The Weeknd.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/sxsyyv1486048920.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=34Na4j8AVgA", "strMusicVidDirector": "Grant Singer", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "1651823724", "intMusicVidLikes": "7068050", "intMusicVidDislikes": "486867", "intMusicVidFavorites": "0", "intMusicVidComments": "339388", "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "336283", "intTotalPlays": "3227235", "strMusicBrainzID": "3da01a8e-3c71-408f-a9c7-0c4d10ad4e7d", "strMusicBrainzAlbumID": "ceaa5c39-91c7-4c8a-886c-85b11fa8a1f6", "strMusicBrainzArtistID": "c8b03190-306c-4120-bb0b-6f2ebfc06ea9", "strLocked": "Unlocked"}]}