{"track": [{"idTrack": "34402837", "idAlbum": "2247627", "idArtist": "112024", "idLyric": "0", "idIMVDB": "0", "strTrack": "The Hills", "strAlbum": "Beauty Behind the Madness", "strArtist": "The Weeknd", "strArtistAlternate": null, "intCD": null, "intDuration": "242000", "strGenre": "R&B", "strMood": "Intense", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"The Hills\" is a song by Canadian singer The Weeknd. It was released on May 27, 2015 as the second single from his second studio album, Beauty Behind the Madness (2015).\n\n\"The Hills\" was a critical success, appearing on several year-end lists. In the singer's native Canada, the song peaked at number one. In the United States it also reached number one on the Billboard Hot 100, replacing his own \"Can't Feel My Face\". The song also made the top 10 in the United Kingdom, Ireland, Germany, Australia, and New Zealand. It reached the top 20 in Denmark and Sweden while reaching the top 40 in The Netherlands, Norway, and Switzerland. A music video for the song was released on May 27, 2015. It was directed by Grant Singer. Two official remixes of the song features rappers Eminem and Nicki Minaj.\n\nThe song is written in the key of C minor in common time with a tempo of 113 beats per minute. The vocals in the song span from C4 to E♭6.\n\nProducer Illangelo stated ”I’m very optimistic and positive with anything I put my energy towards, so for me, Abel’s success now is what I imagined it always should have been. ‘The Hills’ was an opportunity for us to go back to the classical, original the Weeknd moments of our first mixtapes that I co–produced and mixed in their entirety, and then bringing that into a new context, with a pop arrangement and chords in a faster tempo. It’s the perfect marriage of that.\"\n\nThe music video for \"The Hills\" was directed by Grant Singer. It was uploaded to YouTube on May 27, 2015. As of December 2016, the video has been viewed over 960 million times, having more views than any other music video by The Weeknd. The video begins showing a wrecked car that has flipped over, and it is unknown why the car has flipped over. The Weeknd is seen crawling out of the car before helping two women to get out. As the song progresses, Weeknd is seen walking by himself down a dark street in Los Angeles, and around the middle of the song, the wrecked car explodes behind him. He occasionally is pushed repeatedly by one of the women from the car. At the end of the song, he enters an abandoned mansion, and goes upstairs to a room illuminated with red light. A man holding an apple sits waiting for him, next to two other women, and the video cuts to black.\n\nThe man from inside the mansion is Rick Wilder also appears in both the \"Can't Feel My Face\" and \"Tell Your Friends\" music videos.\n\nAnother music video was filmed for the Eminem remix in collaboration with GoPro and United Realities, is a 360-degree virtual reality video in which The Weeknd is seen leaving a venue and heading to his limo. As the viewer changes the angles, it's shown that comets are raining down and the raining debris causing fiery explosions around the area. As he approaches his limousine, a fiery explosion consumes him.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uwvusq1481630910.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=yzTuBuRdAyA", "strMusicVidDirector": "Grant Singer", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "1459951459", "intMusicVidLikes": "7770938", "intMusicVidDislikes": "346930", "intMusicVidFavorites": "0", "intMusicVidComments": "260898", "intTrackNumber": "5", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "379438", "intTotalPlays": "3529644", "strMusicBrainzID": "ee458835-f356-4b20-b6ac-03bc2f7f3d9e", "strMusicBrainzAlbumID": "a85b8aff-fcbc-4431-95ba-d8c20bbfb77e", "strMusicBrainzArtistID": "c8b03190-306c-4120-bb0b-6f2ebfc06ea9", "strLocked": "Unlocked"}]}