{"track": [{"idTrack": "34351567", "idAlbum": "2243599", "idArtist": "137728", "idLyric": "0", "idIMVDB": "0", "strTrack": "Unsteady", "strAlbum": "VHS", "strArtist": "X Ambassadors", "strArtistAlternate": null, "intCD": null, "intDuration": "190223", "strGenre": "Alternative Rock", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "X Ambassadors' first hit single “Renegades” was catchy, but it also sounded like the kind of outside-the-box song that would be hard to repeat. In other words, they seemed to be possible candidates for “one hit wonder” fate.\n\nThat has changed in a big way with the release of their latest hit, an engaging, emotional ballad called “Unsteady” that has been connecting with listeners and slowly rising up the airplay and iTunes charts. While “Renegades” featured distant-sounding vocals, the voice in “Unsteady” is front and center, plaintively crying out in desperation. Sam Harris sings, “Hold, hold on, hold onto me / Cause I'm a little unsteady / A little unsteady.”\n\nTaken literally, the song describes a child stuck in between fighting parents who are about to divorce. Harris continues, “Mama, come here / Approach, appear / Daddy, I'm alone / Cause this house don't feel like home / If you love me, don't let go.”\n\nThe message of “Unsteady” is apparently resonating, as it nudges up to No. 10 on Billboard's Alternative Songs chart and continues to climb the lower half of the iTunes Top 200 chart in the U.S. The fact that the mood and melody of the track are so different from “Renegades” shows that X Ambassadors could have staying power due to their versatility.\n\nIn a behind the scenes chat with Shazam, Harris explained the story behind the song. “That feeling of abandonment born into this loving family that was together, that was a unit. That unit no longer exists, even though you have both parents there who love you, who care for you, and you know that they're there, but you can't help but feeling like a promise was broken.” Harris added, “Divorce is not something that's fair for anyone involved. A very important moment in your life (is) when you realize that your parents are human too.”\n\nBoth “Unsteady” and “Renegades” appear on X Ambassadors' debut album VHS, which dropped last June and launched directly into the Top 10. The sky appears to be the limit for the band, as they're currently opening for Muse's huge American arena tour.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/ypwqqp1473683995.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": "0", "intMusicVidComments": "0", "intTrackNumber": "4", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "155471", "intTotalPlays": "965697", "strMusicBrainzID": "031fd49f-a025-4ae7-bd4a-d4f138fd447b", "strMusicBrainzAlbumID": "68834e04-745e-4dba-a15f-4e2ac62f1ccc", "strMusicBrainzArtistID": "298f4089-1948-44b5-b5e8-d5381f42362f", "strLocked": "Unlocked"}]}