{"track": [{"idTrack": "34529981", "idAlbum": "2257888", "idArtist": "111305", "idLyric": "0", "idIMVDB": "0", "strTrack": "Work", "strAlbum": "Anti", "strArtist": "Rihanna", "strArtistAlternate": null, "intCD": null, "intDuration": "219000", "strGenre": "Pop", "strMood": "In Love", "strStyle": "Rock/Pop", "strTheme": "Work", "strDescriptionEN": "\"Work\" is a song recorded by Barbadian singer Rihanna for her eighth studio album, Anti (2016). Featuring guest vocals from Canadian rapper Drake, the song was released as the lead single from Anti on January 27, 2016 through Westbury Road and Roc Nation. \"Work\" was written by Rihanna and Drake along with PartyNextDoor, Allen Ritter, Rupert Thomas, R. Stephenson, Monte Moir, and Boi-1da; the latter is also the producer. The dancehall and reggae-pop song, contains an interpolation of \"If You Were Here Tonight\" (1985) performed by Alexander O'Neal. Lyrically, the song incorporates themes of working for money, as well as discussing fragile relationships.\n\n\"Work\" received generally mixed reviews, with critics praising the song's production and musical style, however noted the track was \"comfortable\". The song was a commercial success, reaching number one on the Billboard Hot 100 where it became Rihanna's fourteenth number one. The song also saw success elsewhere peaking at number one in Canada, France and the Netherlands and peaking within the top five of the charts in Australia, New Zealand, the United Kingdom and Germany.\n\nThe song was accompanied by two music videos, which both premiered on February 22, 2016. The first of the two versions was directed by Director X, while the second was directed by Tim Erem. The song was further promoted with a live performance at the 2016 BRIT Awards which featured guest appearances from Drake and SZA. \"Work\" was praised as a song which has brought the genre of dancehall to the forefront of American music, becoming the first dancehall song to top the Billboard Hot 100 since Sean Paul's \"Temperature\" (2006). A Billboard writer highlighted the song and Rihanna herself for displaying West Indian black culture prominently without appropriation from mainstream culture.\n\n\"Work\" was written by the artists, PartyNextDoor, Allen Ritter, Rupert \"Sevn\" Thomas, Monte Moir, R. Stephenson, and Boi-1da; the latter is also the producer. In the summer of 2015, Thomas, Ritter, Boi-1da, and Martin Mason, among others, stayed at Drake's house in Los Angeles for a mid-week period. Thomas described the time spent at the home as a \"beat factory, everyone was sitting there working and collaborating with each other.\" Thomas created a beat which was dancehall-influenced; he later played it for Boi-1da to which he positively responded, \"We’re both Jamaican-Canadian. It was just something in our DNA, so it woke him up, and we started remembering all these old dancehall songs from the '90s.\" Boi-1da came with up idea for sampling an \"old school dancehall rhythm\" and after that the chords were made with Ritter and past it, \"everything went organically\".\n\nWhen the song's music was finished, Boi-1da sent it to PartyNextDoor who wrote the lyrics, \"he’s an incredible writer, and he’s Jamaican as well. I think so that’s how he’s able to come up with those vibes and feels,\" noted Thomas. After Drake heard the song he loved it and decided to write and record a verse on it. Shortly after Braithwaite stayed at Rihanna's home in Malibu, where he played her the song. Rihanna's vocals were recorded by Marcos Tovar and Kuk Harrell at the Westlake Recording Studios in Los Angeles; the latter also served as a vocal producer. Drake's vocals were recorded by Noel Cadastre and Noah \"40\" Shebib at the Sandra Gale Studios in California and the SOTA Studios in Toronto. The vocal recording was assisted by Thomas Warren, while additional vocals were provided by PartyNextDoor. Manny Marroquin mixed \"Work\" at the Larrabee Studios, while Noel \"Gadget\" Campbell and Shebib did the mixing at the Studio 360 and SOTA Studios in Toronto. The mastering was done by Chris Gehringer at the Sterling Sound in New York City. \"Work\" marks the third collaboration between Rihanna and Drake, following \"What's My Name?\" in 2010 and \"Take Care\" in 2012.\n\n\"Work\" is a dancehall and reggae-pop song with a length of three minutes and thirty-nine seconds. Hugh McIntyre of Forbes described the song as \"quite\" urban and mixes hip hop influences with \"island vibes\". Zach Frydenlund of Complex wrote that the song \"is slower and very rhythmic with Rihanna showing off her vocal skills over the crafty production.\" Alexa Camp of Slant Magazine called it an \"an understated midtempo jam in the vein of Janet Jackson's recent 'No Sleeep', with a percolating beat, sinuous synth lines, and vocal samples stretched and pulled in a way that recalls Jimmy Jam and Terry Lewis's masterful production work on Janet's 1997 album The Velvet Rope.\" The Guardian's Harriet Gibsone wrote: \"The glossy, modernist 'Work' skewers elements of dub and dancehall: her voice is at times Auto-Tuned, and a distant sample of what sounds a little like Grace Jones's My Jamaican Guy haunts its empty spaces.\"\n\nThe song is written in the key of G♯ minor in common time with a tempo of 92 beats per minute. The vocals in the song span from F♯3 to G♯4.\n\nRolling Stone's Daniel Kreps wrote the song contains \"a tropical house vibe\". In contrary, Taj Ran from Billboard wrote the song \"isn’t part of a new genre that many in the mainstream media are calling \"tropical house\". Anti’s lead single is undeniably drenched in dancehall, a genre with deep roots in Jamaica's club scene that spun off from reggae in the 1970s.\" According to The Atlantic's Spencer Kornhaber, the single has \"strangely unfinished quality\" that features its verses, choruses and bridge fade into themselves, \"forgoing soft-to-loud explosions or exciting rhythmic changes\". He also noted that, Boi-1da also tries to create \"escalation\" in the song by adding additional drums for the second chorus, flutes, autotuned harmonies and back-off piano. The New York Times's Jon Caramanica noted Rihanna at times \"barely even relies on words, truncating her syllables past patois to something far less exact.\" Lyrically, \"Work\" is \"about working for a paycheck no matter what else is going on in your life.\" Additionally, it focuses on \"a fragile relationship\" that can be seen in the lines, \"If I get another chance to, I would never, oh never, neglect you,\" which Rihanna sings.\n\nFilming of the accompanying music video took place at the Real Jerk restaurant in Toronto on February 5. Rihanna later announced its premiere date to be February 22, 2016 via her Twitter account, while also releasing a videoclip via YouTube. There are two versions; the first was directed by Director X while the second was directed by Tim Erem.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/ruysry1488395177.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=HL1UzIK-flA", "strMusicVidDirector": "Director X", "strMusicVidCompany": "Hound Content", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/uqtuqt1483438136.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/rvtrtu1483438152.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/yrswrw1483438161.jpg", "intMusicVidViews": "1074770377", "intMusicVidLikes": "6185712", "intMusicVidDislikes": "575658", "intMusicVidFavorites": "0", "intMusicVidComments": "386797", "intTrackNumber": "4", "intLoved": "1", "intScore": "8.5", "intScoreVotes": "2", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "47ea5855-4ce1-4d64-b5f8-f132b08dec3b", "strMusicBrainzAlbumID": "0c482acd-35a2-466b-b833-ef5f2f1297d4", "strMusicBrainzArtistID": "73e5e69d-3554-40d8-8516-00cb38737a1c", "strLocked": "Unlocked"}]}