{"track": [{"idTrack": "33578040", "idAlbum": "2179716", "idArtist": "112782", "idLyric": "0", "idIMVDB": "2147483647", "strTrack": "Best Song Ever", "strAlbum": "Best Song Ever", "strArtist": "One Direction", "strArtistAlternate": null, "intCD": null, "intDuration": "202000", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Best Song Ever\" is a song recorded by English-Irish boy band One Direction. It was released on 22 March 2013 by Syco and as the lead single from the group's third studio album, Midnight Memories. Written by Wayne Hector, John Ryan, Ed Drewett, Julian Bunetta and produced by Bunetta, Matt Rad and Ryan, the song was recorded in 2012 and runs for 3 minutes and 21 seconds. It was announced by One Direction in a video uploaded to their YouTube channel on 25 June 2013.\n\nThe trailer for This Is Us was released thirty minutes after the video was uploaded, and included a short preview of the song. The song became available for pre-order on iTunes on 26 June 2013. The song was included in the box set of the Brit Awards, 2014 BRIT Awards.\n\nThe song debuted and peaked at number two on both the UK Singles Chart and the US Billboard Hot 100.\n\nThe music video was filmed over two days at The Temple House in Miami Beach, Florida. The video was directed by Ben Winston and written by Winston and comedian James Corden. It was released on the band's Vevo channel on 22 July 2013.\n\nThe video, which is over six minutes long, features the band going into an office in Hollywood and talking to two executives named Harvey and less Grossman (Tom Cruise) (Niall Horan and Louis Tomlinson, respectively) after being led in by Veronica, the sexy assistant (Zayn Malik). Marcel, the nerdy marketing guy (Harry Styles), shows them photoshopped pictures of the band in ridiculous outfits and even has a choreographer named Leeroy (Liam Payne) demonstrate his ideas for new dance moves. Insulted by this attempt to box them into the boy band stereotype, the band erupts into the song and starts wreaking havoc by throwing things around the office. Interspersed with clips from their film, This Is Us, the band continues to destroy the office and even shows off a \"dance routine,\" poking fun at their perceived lack of dancing prowess. The video ends as they nail a poster of themselves to the wall and Zayn spray paints the words \"this is us\" on it, presumably to let people know that they will continue to be themselves despite their growing success and popularity.\n\nThe video broke the Vevo 24-hour record with 12.3 million views, although the record was later broken by Miley Cyrus's \"Wrecking Ball\", which garnered 19.3 million views.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qxqprt1382578424.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "Ben Winston", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": "0", "intMusicVidComments": "0", "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "237979", "intTotalPlays": "1967249", "strMusicBrainzID": "6009e28a-2c33-4b9d-bd35-ddaca0a2e03c", "strMusicBrainzAlbumID": "f98f6fb2-0ce2-467a-a32c-2da684b8d9bb", "strMusicBrainzArtistID": "1a425bbd-cca4-4b2c-aeb7-71cb176c828a", "strLocked": "Unlocked"}]}