{"track": [{"idTrack": "33449802", "idAlbum": "2169432", "idArtist": "117894", "idLyric": "0", "idIMVDB": "0", "strTrack": "Blurred Lines", "strAlbum": "Blurred Lines EP", "strArtist": "Robin Thicke", "strArtistAlternate": null, "intCD": null, "intDuration": "263000", "strGenre": "Soul", "strMood": "Sensual", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Blurred Lines\" is a single written and performed by American recording artists Robin Thicke, T.I., and Pharrell Williams. Produced by Pharrell, it serves as the lead single from Thicke's album of the same name. It was released on March 26, 2013 through Pharrell's label Star Trak Recordings. Recorded in 2012, the song was primarily inspired by the Marvin Gaye song \"Got to Give It Up\", and apart from T.I.'s rap was entirely the work of Williams. However, Thicke clearly laid claim to writing credits on the track according to a Reuters article. The song became the subject of a bitter legal dispute with the family of Gaye and Bridgeport Music as to whether the song infringed copyrights to \"Got to Give It Up\". Thicke and Williams were found liable for copyright infringement by a federal jury in March 2015, and Gaye was awarded posthumous songwriting credit based on the royalties pledged to his estate.\n\nThe song's music video was released in two versions, with one featuring models Emily Ratajkowski, Jessi M'Bengue, and Elle Evans being topless, while the other censored nudity. The uncut version of the video was at one time removed from YouTube for violating the site's terms of service regarding nudity; it was later restored, but with an age restriction. The song's lyrics and music video have proven controversial with some groups, with claims that it is misogynistic and promotes date rape. This has led to the song being banned at universities and other institutions in the United Kingdom and prompted a rebuttal from Thicke.\n\n\"Blurred Lines\" peaked at number one in at least 25 countries and becoming the number one song of 2013 in several of them. It became Thicke's first, T.I.'s fourth, and Pharrell's third number-one single in the US, where it was also the longest running number one single of 2013. The song subsequently became one of the best-selling singles of all time, with sales of 14.8 million, simultaneously breaking the record for the largest radio audience in history. The single was nominated for two Grammys at the 56th Annual Grammy Awards, including Record of the Year and Best Pop Duo/Group Performance. The song has been parodied and covered numerous times.\n\n\"Blurred Lines\" was produced by Thicke and Pharrell with an intention of creating a sound similar to Marvin Gaye's \"Got to Give It Up\" (1977). The song was completed in less than an hour. In an interview with GQ's Stelios Phili, Thicke explained:\n\n“\tPharrell and I were in the studio and  I was like, \"Damn, we should make something like that , something with that groove.\" Then he started playing a little something and we literally wrote the song in about half an hour and recorded it. He and I would go back and forth where I'd sing a line and he'd be like, \"Hey, hey, hey!\" We started acting like we were two old men on a porch hollering at girls like, \"Hey, where you going, girl? Come over here!\"\t”\nIn a separate interview, Thicke clarified the meaning of the song's title, saying it referred to \"the good-girl/bad-girl thing and what's appropriate\".\n\nThicke and manager Jordan Feldstein decided the song would not have much impact through radio and would need an innovative approach to become a hit. Feldstein told HitQuarters: \"We had an artist that had never had a hit on radio. It was a non-traditional song; it didn't sound like a Timbaland or Benny Blanco record. So we had to approach the market in an interesting way.\" Feldstein came up with the idea of creating a video designed to go viral and brought in experienced music video director Diane Martel to shoot it. Its controversial nature was designed to attract attention with Feldstein saying: \"I knew it would get it banned quickly ... Getting something banned actually helps you.\"\n\nThe music video, directed by Diane Martel, was released on March 20, 2013. The video features Thicke, T.I., and Pharrell casually standing in front of light-pink backdrop as they flirt with models (Emily Ratajkowski, Elle Evans, and Jessi M'Bengue) who pose and dance. At various points, the hashtag \"#THICKE\" flashes, whilst towards the end, \"ROBIN THICKE HAS A BIG DICK\" is spelled out in silver balloons. In the unrated version of the video, the models wear nothing but skin-colored G-strings. In the edited version, they are scantily clad and the hashtag \"#BLURREDLINES\" is seen at various points. This is the second time that director Diane Martel and Pharrell join together for a music video project involving two differently rated versions. The 2001 video for the N.E.R.D single \"Lapdance\" also featured models in two variant editions, one of which, like \"Blurred Lines\", is a topless version. The video was filmed at Mack Sennett Studios in Silver Lake.\n\nAfter being on the site for just under one week, the unrated version of the video was removed from YouTube on March 30, 2013, citing violations of the site's terms of service that restricts the uploading of videos containing nudity, particularly if used in a sexual context. However it was later restored on July 12, 2013. The unrated video remains available on Vevo, while the edited version is available on both Vevo and YouTube. The unrated version of \"Blurred Lines\" generated more than 1 million views in the days following its release on Vevo. As of January 2017, the unrated version of \"Blurred Lines\" is available on YouTube.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/utyrxu1484318741.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "Diane Martel", "strMusicVidCompany": "Black Dog Films", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": "0", "intMusicVidComments": "0", "intTrackNumber": "1", "intLoved": "2", "intScore": "10", "intScoreVotes": "6", "intTotalListeners": "501210", "intTotalPlays": "3614292", "strMusicBrainzID": "33b1713b-653e-4be4-89e1-c21e9405a115", "strMusicBrainzAlbumID": "cce1a3fe-65b4-4276-9bf4-5b1a7dd488af", "strMusicBrainzArtistID": "ddfd9b2f-186e-4b2c-ad09-01aa5380c225", "strLocked": "Unlocked"}]}