{"track": [{"idTrack": "32931136", "idAlbum": "2126729", "idArtist": "111305", "idLyric": "0", "idIMVDB": "0", "strTrack": "Diamonds", "strAlbum": "Unapologetic", "strArtist": "Rihanna", "strArtistAlternate": "Robyn Rihanna Fenty", "intCD": null, "intDuration": "225000", "strGenre": "Pop", "strMood": "In Love", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Diamonds\" is a song by recording artist Rihanna, released as the lead single from her seventh studio album Unapologetic (2012). It was written by Sia Furler, Benjamin \"Benny Blanco\" Levin, Mikkel S. Eriksen and Tor Erik Hermansen. The song was produced by Blanco, as well as Eriksen and Hermansen, under their production name StarGate. \"Diamonds\" premiered on September 26, 2012, during the Elvis Duran and the Morning Show and was released for a digital download the following day. Def Jam Recordings serviced the single to contemporary hit radio in the United States on October 2. Musically, \"Diamonds\" is a mid-tempo pop ballad with influences of electronic and soul music. The single is a departure from the theme of \"unhealthy relationships\" that are evident in several of Rihanna's previous singles.\n\nCritics were divided on \"Diamonds\"; some complimented Rihanna's different musical direction, however, others criticized its production. \"Diamonds\" has reached number one in sixteen countries including Austria, Canada, France, Finland, Germany, Norway, and the United Kingdom and attained top ten positions in over thirty countries. It also topped the US Billboard Hot 100, becoming Rihanna's twelfth number one single on the chart and tied her with Madonna and The Supremes for the fifth-most number ones in the chart's history. In addition, \"Diamonds\" has reached number one on the US Hot Dance Club Songs and Hot R&B/Hip Hop Songs charts and number four on the US Pop Songs chart.\n\nThe song's music video, shot by Rihanna's regular collaborator Anthony Mandler, depicts Rihanna in four environments that represent the elements of earth, air, water and fire. It features \"dreamy\" and \"surreal\" scenes of the singer such as her lying alone in open waters, frantically running from a car on a deserted highway, in a desert with horses running free and in-between a street battle. The video received positive response from critics, who praised the imagery used. Reviewers also noted that throughout the video, the scene in which Rihanna's arm is intertwined with a heavily tattooed man resembles that of the singer's ex-boyfriend Chris Brown. Rihanna performed the song at the Victoria's Secret Fashion Show and on Saturday Night Live in the United States, and on The X Factor in the United Kingdom. An official remix of \"Diamonds\", featuring rap verses by Kanye West was released on November 16, 2012.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/svpswu1355323396.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=lWA2pjMjpBs", "strMusicVidDirector": "Anthony Mandler", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/txwyxr1418733931.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/xxxprq1418733945.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/vysusv1418733954.jpg", "intMusicVidViews": "1457384994", "intMusicVidLikes": "6351130", "intMusicVidDislikes": "305261", "intMusicVidFavorites": "0", "intMusicVidComments": "324451", "intTrackNumber": "2", "intLoved": "1", "intScore": "10", "intScoreVotes": "2", "intTotalListeners": "608911", "intTotalPlays": "6608632", "strMusicBrainzID": "f281056d-5696-43d0-bb2e-61677ef65309", "strMusicBrainzAlbumID": "1ab3ba95-bc96-46f4-bc6d-1e57bc6ad1a0", "strMusicBrainzArtistID": "73e5e69d-3554-40d8-8516-00cb38737a1c", "strLocked": "Unlocked"}]}