{"track": [{"idTrack": "32939591", "idAlbum": "2127416", "idArtist": "112817", "idLyric": "0", "idIMVDB": null, "strTrack": "Die Young", "strAlbum": "Warrior", "strArtist": "Ke$ha", "strArtistAlternate": "Kesha", "intCD": null, "intDuration": "213000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Die Young\" is a song by American recording artist Kesha. It was released on September 25, 2012 as the lead single from her second studio album, Warrior. The electropop song was written by Kesha, Dr. Luke, Benny Blanco, Cirkut, and fun. singer Nate Ruess. Two teaser trailers were posted prior to the single's official release. A lyric video for the song was published to YouTube. Contemporary critics gave mixed reviews of the song; MTV, Seventeen, and Rolling Stone were disappointed with it, reflecting on its sameness with Kesha's other songs, while others praised it. The song has noticeable similarities to Flo Rida's \"Good Feeling\". To a lesser extent, it has also been compared to \"Domino\" by Jessie J, and \"Teenage Dream\" by Katy Perry. \"Die Young\" charted in multiple countries, debuting at 13 on the Billboard Hot 100 chart. In its third week, \"Die Young\" broke into the top-ten, making it Kesha's eighth top-ten hit since her debut on the chart in 2010 with \"Tik Tok\". The song has also reached the top ten in multiple countries worldwide, including most of the anglosphere, Norway, Austria, Lebanon, and others. The official music video for \"Die Young\" was also made available for download. In it, she plays the role of a cultist, leading her disciples in a sex ritual. Music magazine Billboard reported on the symbolism used in the video, documenting synergy with it and the Illuminati conspiracy theory. The official remix features rappers Juicy J, Wiz Khalifa, and Becky G.\n\nIn December 2012, on the day after the Newtown elementary school shooting in Connecticut transpired, the song was pulled from radio stations due to its lyrics. On microblogging website, Twitter, the singer offered condolences to the victims of the shooting, apologizing for any negative impact the lyrics of \"Die Young\" might have caused. The following day, the singer tweeted that she had no lyrical control over the song and was \"forced\" to sing it; the tweet was deleted, but not before mainstream music-media source Viacom photographed the message and spread it through its communication channels.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qssuyp1357658716.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=NOubzHCUt48", "strMusicVidDirector": "Darren Craig", "strMusicVidCompany": "The Uprising Creative", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "84479303", "intMusicVidLikes": "381544", "intMusicVidDislikes": "80024", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "425005", "intTotalPlays": "4982468", "strMusicBrainzID": "fdee0a21-37f6-4593-bafa-a775d7b2b2b4", "strMusicBrainzAlbumID": "7f238f1a-6b01-458f-9a1b-3b34859018f3", "strMusicBrainzArtistID": "fab34286-b8e1-4879-bce3-194e1358fbd2", "strLocked": "Unlocked"}]}