{"track": [{"idTrack": "33372076", "idAlbum": "2162908", "idArtist": "111492", "idLyric": "0", "idIMVDB": "269773897390", "strTrack": "Get Lucky", "strAlbum": "Random Access Memories", "strArtist": "Daft Punk", "strArtistAlternate": null, "intCD": null, "intDuration": "367000", "strGenre": "Funk", "strMood": "Happy", "strStyle": "Electronic", "strTheme": "...", "strDescriptionEN": "\"Get Lucky\" is a song by French house music duo Daft Punk, co-written by and featuring Pharrell Williams and Nile Rodgers. It is the lead single from Daft Punk's fourth studio album Random Access Memories. Regarding the lyrical composition, Pharrell stated that the song is not just about a sexual conquest, but the fortune in finding potential chemistry with someone. Before its release as a single, \"Get Lucky\" was featured in television advertisements broadcast during Saturday Night Live, after which Rodgers and Pharrell announced their involvement in the track. Small excerpts also appear throughout the promotional video series The Collaborators. Following a leak days earlier, the single was released as a digital download on 19 April 2013. \"Get Lucky\" has since received general acclaim from critics. Daft Punk first met Nile Rodgers at a listening party in New York for the duo's 1997 debut album Homework, and became friends thereafter. The duo acknowledged Chic's influence in the song \"Around the World\" and had great respect for Rodgers. He noted however that a series of near misses and scheduling conflicts had delayed their chance of collaborating. The duo eventually invited Rodgers to the Random Access Memories sessions at Electric Lady Studios in New York City. This coincidentally was the studio where the first Chic single had been recorded, in the neighborhood in which Rodgers grew up. Prior to Rodgers' involvement, the song existed in rough form with Omar Hakim on drums and Nathan East performing bass guitar. Once Rodgers contributed his rhythm guitar work, Daft Punk re-recorded the bass part with East to fit Rodgers' performance.\nPharrell Williams had first heard from Daft Punk about the project \"at a Madonna party\" they were attending, and offered his services for a collaboration. The duo and Pharrell later met up in Paris, where he showed some of his own material he had been working on. Pharrell explained that he had been inspired by Rodgers, not knowing that Daft Punk had coincidentally been recording with him. Upon returning to the United States, Pharrell had \"forgotten everything\" regarding the \"Get Lucky\" sessions; he attributed this to jet lag, but jokingly wondered if the duo had tampered with his memory. Daft Punk responded by explaining that Pharrell's lyrics and performance had come about in a very spontaneous way, which was the likely reason he had trouble recalling the experience. Upon hearing \"Get Lucky\", Pharrell remarked that the music evoked the sense of being on an exotic island during a \"peachy color\" sunrise. He elaborated that the title does not simply refer to a sexual act, but to the fortune of meeting with and immediately connecting to someone. As a member of The Neptunes, Pharrell had previously provided a remix of \"Harder, Better, Faster, Stronger\" that appeared in the 2003 album Daft Club. Daft Punk had also served as co-writers and producers for the 2010 single \"Hypnotize U\" by N.E.R.D, Pharrell's band.\n\"Get Lucky\" was completed over the course of approximately 18 months. It was first publicly revealed via two 15-second television advertisements on Saturday Night Live. Rodgers announced his contribution to the song shortly afterward, and noted that various fan remixes of the clips have appeared online since the airing. The third trailer officially announced Pharrell's involvement in the song and features Daft Punk, Rodgers, and Pharrell performing together. The promotional web series The Collaborators featured excerpts of \"Get Lucky\", culminating in the Pharrell-focused episode in which the song was first referred to by name.\nDays prior to the single release, the song had been leaked and broadcasted on various radio stations. The song broke records with the highest number of plays of any song in a single day on music streaming application Spotify. In the United Kingdom the song joined the playlists of BBC Radio 1, BBC Radio 2 and BBC Radio 6 Music. Upon the official release, Pharrell performed \"Get Lucky\" live for the first time at an HTC One launch party in Brooklyn. English band Daughter recorded an indie version of the song for BBC Radio 1's Live Lounge. The song was also covered by George Barnett, Postmen, and Igor Presnyakov. Peter Serafinowicz uploaded a video of him featuring the song. Israeli musician Noy Alooshe made a mashup of the song with Michael Jackson's \"Billie Jean\".", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wywwvy1368607415.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=wKtS9pfIwUQ", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/ystrqy1368607302.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/uvxrvt1368607307.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/stywtv1368607314.jpg", "intMusicVidViews": "7451", "intMusicVidLikes": "116", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "22", "intTrackNumber": "8", "intLoved": "2", "intScore": "10", "intScoreVotes": "2", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "833f00e1-781f-4edd-90e4-e52712618862", "strMusicBrainzAlbumID": "aa997ea0-2936-40bd-884d-3af8a0e064dc", "strMusicBrainzArtistID": "056e4f3e-d505-4dad-8ec1-d04f521cbb56", "strLocked": "Unlocked"}]}