{"track": [{"idTrack": "33583796", "idAlbum": "2180164", "idArtist": "123228", "idLyric": "0", "idIMVDB": "0", "strTrack": "The Fox", "strAlbum": "The Fox", "strArtist": "Ylvis", "strArtistAlternate": null, "intCD": null, "intDuration": "213000", "strGenre": "Euro Dance", "strMood": "Fun", "strStyle": "Clubbing", "strTheme": "...", "strDescriptionEN": "\"The Fox (What Does the Fox Say?)\", is an electronic dance song and viral video by Norwegian comedy duo Ylvis. The top trending video of 2013 on YouTube, \"The Fox\" was posted on the video-sharing website on 3 September 2013, and had over 473 million views as of December 9, 2014. \"The Fox\" peaked at number 6 for three consecutive weeks on the Billboard Hot 100, and was before the US release of \"Am I Wrong\" by Nico & Vinz, the highest-ranked song by a Norwegian artist on the chart since a-ha's number-one song \"Take on Me\" in 1985.\n\nOriginally an \"anti-hit\" produced as a part of the duo's new season of Norwegian television talk show I kveld med YLVIS (Tonight with Ylvis) and uploaded on YouTube as a teaser, \"The Fox\", \"created to fail\", has ironically and accidentally gone viral, becoming Ylvis' \"breakout\" song and drawing international attention to the group. There are currently no plans to release an album including the song or any sequel to it.\nThe brothers Vegard and Bård Ylvisåker, members of the Norwegian comedy group Ylvis, produced the song and music video \"The Fox\" to promote their upcoming third season of I kveld med Ylvis on TVNorge. In an interview with Norwegian newspaper Aftenposten, the brothers stated that the idea of a song about a fox was originally conceived in 2012, but then shelved. Half a year later, in 2013, Bård and lyricist Christian Løchstøer began to play with the idea once again. Vegard was initially skeptical about making a song about a fox, but soon relented. In an interview on the Norwegian-Swedish talk show Skavlan, the brothers mentioned that given the opportunity to collaborate with Stargate, they originally wanted to make a dance song about men who cannot dance or dread dancing and named it \"The Dancing Stick\", but felt that the idea was \"too clever,\" and that they would appear to be trying to make a hit. The idea was therefore scrapped and \"The Fox\" got produced instead.\n\nBård described the writing process for \"The Fox\" in an interview with Billboard in the United States: \"The way we work is we just sit around and talk about things and get ideas and take some notes. I guess we must have been talking about what sound a fox makes. And then we had a chance to work with Stargate, a norwegian production company based in New York City... We actually did a favor for them and we asked them if they could produce a song for the new season in exchange\". Tor Erik Hermansen of Stargate recalled in an interview with Spin that the favor was actually a mockumentary done by the Ylvisåker brothers to celebrate Mikkel Storleer Eriksen's 40th birthday, in which they pretended to be the Stargate duo. Australian producer M4SONIC was also involved in the production.\nTris McCall of The Star-Ledger describes \"The Fox\" as \"a parody of the excesses and absurdities of contemporary club music\": the brothers \"take turns singing preposterous lyrics about animal noises\" over \"typically vainglorious synthpop,\" with the proposed fox sounds \"mimic the car-alarm synthesizers of contemporary dubstep.\" He compares it to Ylvis' \"Someone Like Me\" which mocked the insertion of dubstep breaks into pop songs. Danielle Seamon of The Lantern acknowledges that while some may be \"extremely perplexed by the attention stupidity and bizarreness collects in 2013\" displayed by the song, it is in fact \"meant to be a funny and almost satirical to pop music\", and Ylvis has \"pushed everybody’s buttons by breaking and manipulating every rule of a Top 40 pop song.\" Evan Sawdey of PopMatters, who names \"The Fox\" one of the best songs of the year, calls it \"a concept that’s so stupid it’s smart\" by bending \"the very fabric of pop culture in such a memorable, ridiculous way\" with simple lines of \"utter comic brilliance.\"\nLike many viral music videos, \"The Fox\" has become an Internet meme and has been extensively covered and adapted by others, with some of the most prominent including a cover by The Ohio University Marching 110 who had previously covered \"Gangnam Style\" and LMFAO's \"Party Rock Anthem\"; a cover by Tay Zonday of \"Chocolate Rain\" fame; an acoustic guitar cover of the first verse by Tyler Ward; an adaptation based on the popular video game League of Legends entitled \"What Does Teemo Say?\"; and an adaptation by Annoying Orange entitled \"The Sock.\" The video was also featured twice by the Fine Brothers on their popular series Elders React and Teens React, which show reactions of elderly people and teens to YouTube videos, respectively. A video showing actor Morgan Freeman reading the lyrics of \"The Fox\" aloud when being interviewed by online TV/movies review site Screen Junkies has also garnered media attention and millions of YouTube views. During an interview with 4Music, in response to the many parodies inspired by their song, the Ylvisåker brothers themselves have reviewed some of the more popular ones. The song has also been featured substantially in \"YouTube Rewind: What Does 2013 Say?\", a homage paid by YouTube to the year's top videos.\n\nThe song has been featured for multiple times on television. It was used in an advertisement for the Fox Network featuring clips of FOX programs and actors singing the song. On 28 October, four contestants on the seventeenth season of Dancing with the Stars performed the song for the \"Team Dance\" week under the team name \"Foxing Awesome\", scoring a perfect 30. NBC's Saturday Night Live cast-member Jay Pharoah and host Kerry Washington appeared in a parody video of the song titled \"My Girl\" on 2 November 2013, featuring a boyfriend got caught by his girlfriend for sexting with other girls. The song has also been performed by the Glee cast in the episode \"Puppet Master\" aired on Thanksgiving Day (28 November 2013).\n\nDue to the popularity of the song, TMZ reported on 18 October 2013 that two weeks away from Halloween, the sales of fox costumes had already risen by almost 40% at one costume outlet from last Halloween, according to the data from Spirit Halloween, BuyCostumes and Amazon. The song has also been synchronized with a \"singing Halloween house\" by the neighborhood in Edwards Landing, Leesburg, Virginia, who every Halloween creates an LED light show with a hit song.\n\nThis song will appear in Just Dance 2015.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qpwvsu1379201054.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=jofNR_WkoCE", "strMusicVidDirector": "Ole Martin Hafsmo", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/uuxrvw1418734681.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/yxutwp1418734690.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/yvrvtv1418734698.jpg", "intMusicVidViews": "767293001", "intMusicVidLikes": "5632874", "intMusicVidDislikes": "613295", "intMusicVidFavorites": "0", "intMusicVidComments": "944382", "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "97735", "intTotalPlays": "664512", "strMusicBrainzID": "b3d1b185-bac3-4ecd-903d-e05c1ff04e6c", "strMusicBrainzAlbumID": "7959172f-cf85-4ada-9529-feef7ffab1ec", "strMusicBrainzArtistID": "18e9528e-a4af-4e09-9a35-ea11c7a7ae43", "strLocked": "Unlocked"}]}