{"track": [{"idTrack": "33576613", "idAlbum": "2179607", "idArtist": "113672", "idLyric": "0", "idIMVDB": "0", "strTrack": "We Can't Stop", "strAlbum": "Bangerz", "strArtist": "Miley Cyrus", "strArtistAlternate": "Hanna Montana", "intCD": null, "intDuration": "232000", "strGenre": "Country", "strMood": "Confrontational", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"We Can't Stop\" is a song by American recording artist Miley Cyrus for her fourth studio album Bangerz (2013). It was released on June 3, 2013 by RCA Records as the lead single from the album, following Cyrus' departure from Hollywood Records in early 2013. \"We Can't Stop\" was written by Mike L. Williams II, Pierre Ramon Slaughter, Timothy Thomas and Theron Thomas (known collectively as Rock City), Cyrus, Douglas Davis and Ricky Walters. The song was produced by Williams II under his production name, Mike Will Made-It, with co-production from P-Nasty and vocal production by Rock City. \"We Can't Stop\" is a pop, R&B, and dance song that lyrically talks of a house party.\n\nUpon its release, \"We Can't Stop\" received generally mixed reviews from music critics, who were ambivalent towards its production and lyrics. It peaked at number two on the U.S. Billboard Hot 100. In doing so, it tied Cyrus' earlier song \"Party in the U.S.A.\" as her highest-peaking track in the country, where it has exceeded sales of two million copies. Internationally, the track enjoyed similar success, topping national singles charts in territories including New Zealand and the United Kingdom.\n\nAn accompanying music video was directed by Diane Martel and was released on June 19, 2013. It received generally mixed reviews from critics, who were divided on Cyrus' increasingly provocative image. Thirty-seven days after its premiere, it became the fastest clip to reach 100 million views across Vevo platforms. \"We Can't Stop\" was additionally promoted with a highly-controversial performance during the 2013 MTV Video Music Awards.\n\nReleased on June 19, 2013, and directed by Diane Martel, the video portrays Cyrus and her friends at a house party and, according to her, is inspired by true events. The video starts with Miley cutting off a house-arrest ankle bracelet and putting on gold teeth accessories. It also shows Cyrus making out with a doll of herself in a pool, doing her infamous \"twerking\", dancing with a giant teddy bear; and other bizarre scenes, such as a skull made out of french fries, cutting off fake fingers in the kitchen, a mountain of bread, a computer-animated mask, and smoke coming out of a man's crotch. The video shows vibrant colors. This aspect of Cyrus' video was praised by critics, along with its creativity. The Director's Cut version has new scenes of Cyrus that weren't seen on the original video, such as the singing karaoke scenes.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/tsqptu1378882260.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=LrUvu1mlWco", "strMusicVidDirector": "Diane Martel", "strMusicVidCompany": "Black Dog Films", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/wxprqx1378882434.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/wswpvy1378882447.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/wqytyq1378882462.jpg", "intMusicVidViews": "882934666", "intMusicVidLikes": "3835067", "intMusicVidDislikes": "1366992", "intMusicVidFavorites": "0", "intMusicVidComments": "889647", "intTrackNumber": "2", "intLoved": "3", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "437208", "intTotalPlays": "4504919", "strMusicBrainzID": "da333e71-ccb1-4d07-826e-b182426e362b", "strMusicBrainzAlbumID": "0e5b4580-4e6d-43e6-8384-0d13ac52a9d7", "strMusicBrainzArtistID": "7e9bd05a-117f-4cce-87bc-e011527a8b18", "strLocked": "Unlocked"}]}