{"track": [{"idTrack": "32723945", "idAlbum": "2109594", "idArtist": "111236", "idLyric": "286369", "idIMVDB": null, "strTrack": "Alejandro", "strAlbum": "The Fame Monster", "strArtist": "Lady Gaga", "strArtistAlternate": null, "intCD": null, "intDuration": "274000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Alejandro\" is a song by American recording artist Lady Gaga. It was released as the third single from her third extended play (EP) and second major release The Fame Monster (2009). Co-written and produced by RedOne and inspired by her \"Fear of Sex Monster\", the lyrics portray Gaga bidding farewell to her lovers.\nMusically, it is composed as a mid-tempo Europop song with an uplifting melody. Contemporary critics predominantly gave positive reviews for it and noted its heavy influence from pop groups like ABBA and Ace of Base. The song charted in the United Kingdom and Hungary due to digital sales following the album's release. Upon release, \"Alejandro\" charted again in the United Kingdom as well as in Australia, Canada, New Zealand, Sweden, and the United States while topping the Finnish, Polish, Russian, Bulgarian, and Romanian charts. \"Alejandro\" became Gaga's seventh successive single to reach the top-ten of the US Billboard Hot 100.\n\nThe accompanying music video was directed by fashion photographer Steven Klein and inspired by Gaga's love for her gay friends and admiration of gay love. Within the video, Gaga dances with a group of soldiers in a cabaret, interspersed with scenes of Gaga as a nun swallowing a rosary and near-naked men holding machine guns. The music video was controversial and received mixed to positive reviews. Critics complimented its idea and dark nature while the Catholic League criticized Gaga for appearing to use blasphemy despite Klein dismissing the idea and claiming that the scene in question (the swallowing of Rosary beads) was Gaga's \"desire to take in the Holy\". Gaga performed on the ninth season of American Idol and has performed on all dates of The Monster Ball Tour.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/yvystx1359181606.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=niqrrmev4mA", "strMusicVidDirector": "Steven Klein", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "216821242", "intMusicVidLikes": "456142", "intMusicVidDislikes": "101858", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "0", "intScore": "7.5", "intScoreVotes": "2", "intTotalListeners": "855149", "intTotalPlays": "9427926", "strMusicBrainzID": "a426ebab-2000-4e1b-9e4c-bcbe62f69bb4", "strMusicBrainzAlbumID": "d8707dc0-18ad-4f04-8d84-e81ceda4c681", "strMusicBrainzArtistID": "650e7db6-b795-4eb5-a702-5ea2fc46c848", "strLocked": "Unlocked"}]}