{"track": [{"idTrack": "32780572", "idAlbum": "2114810", "idArtist": "111828", "idLyric": "271699", "idIMVDB": null, "strTrack": "Already Gone", "strAlbum": "All I Ever Wanted", "strArtist": "Kelly Clarkson", "strArtistAlternate": null, "intCD": null, "intDuration": "281000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Already Gone\" is a song performed by American singer and songwriter Kelly Clarkson from her 2009 album, All I Ever Wanted. It is co-written by Clarkson and Ryan Tedder, who also produced it. The song was released as the album's third single in August 2009. Lyrically, \"Already Gone\" is about the breakup of a relationship; the music consists of an arrangement using a piano, drums, and string instruments.\n\nThe production and release of \"Already Gone\" have been surrounded in controversy. Clarkson claimed that Tedder re-used the musical arrangement on the 2008 Beyoncé Knowles song \"Halo\", and stated that the public would incorrectly assume that she had stolen it; Tedder declared the accusations hurtful and false. After failing to prevent the song from being included on All I Ever Wanted because the tracklisting had already been finalized and the album was already being pressed, Clarkson then voiced her anger towards her record company bosses for subsequently deciding to release it as a single. The accompanying music video was directed by Joseph Kahn, who complained that he was not allowed to fully realize his vision, and stated he was unhappy with the final result. It features scenes of Clarkson dressed in a gold gown and expensive jewelry while lying on a chaise longue in an apartment. Shots of floating objects intersperse a second scene in which Clarkson, wearing a black dress, sings in a rehearsal room while surrounded by the instruments of an invisible orchestra.\n\nDespite her dissatisfaction with the song's release as a single, Clarkson began promoting it in July 2009, performing it live on the Late Show with David Letterman and other talk shows. In the fall, she performed the song on VH1 Divas and at the American Music Awards. She has included \"Already Gone\" in the encore set of her 2009 All I Ever Wanted Tour. The song has received much praise from music critics, and is regarded as one of the highlights of All I Ever Wanted. Critics have praised the song for its expressions of vulnerability, its emotional impact, and its successful use of the ballad form. It peaked at number 13 on the Billboard Hot 100, and was certified Platinum in Canada and Gold in Australia", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/sxrqrx1383081644.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=f0T3WAbU6tg", "strMusicVidDirector": "Joseph Kahn", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/xyxtxv1383081717.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/xqsupw1383081729.jpg", "strMusicVidScreen3": null, "intMusicVidViews": "37431056", "intMusicVidLikes": "116065", "intMusicVidDislikes": "1887", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "6", "intLoved": "0", "intScore": "5", "intScoreVotes": "1", "intTotalListeners": "259422", "intTotalPlays": "1784368", "strMusicBrainzID": "f5992a73-9c1b-492f-ba6f-fddfa6f68853", "strMusicBrainzAlbumID": "50e5e68b-626a-3bde-904d-5649163ebecd", "strMusicBrainzArtistID": "d339efbb-77b9-4147-ba9e-59f2f24550b2", "strLocked": "Unlocked"}]}