{"track": [{"idTrack": "32723944", "idAlbum": "2109594", "idArtist": "111236", "idLyric": "286370", "idIMVDB": "0", "strTrack": "Bad Romance", "strAlbum": "The Fame Monster", "strArtist": "Lady Gaga", "strArtistAlternate": null, "intCD": null, "intDuration": "294000", "strGenre": "Pop", "strMood": "Quirky", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Bad Romance\" is a song by American recording artist Lady Gaga. It was released as the lead single from her third extended play (EP), and second major release The Fame Monster (2009). Written by Lady Gaga and produced by RedOne, the track was inspired by Gaga's fear of negative love relationships and the paranoia that she experienced while touring the globe from 2008 to 2009. Following a demo leak, Gaga premiered the finished version at Alexander McQueen's show at the Paris Fashion Week in October 2009, followed by the release of the single's cover art. Musically, \"Bad Romance\" features a spoken bridge, a full-throated chorus and sung lyrics that concern the situation of being in love with one's best friend. The song, containing elements of the music from the 1980s and the 1990s and influences of German house-techno music, has been described by Gaga as a pop experimental record.\n\n\"Bad Romance\" reached number one in the United Kingdom, Republic of Ireland, Canada, Sweden, Germany, Austria and Denmark, also peaking at number two in countries such as the United States, Australia and New Zealand. According to the International Federation of the Phonographic Industry, the song has sold 9.7 million copies worldwide in 2010. \"Bad Romance\" was praised by most critics, who compared it to Gaga's second single, \"Poker Face\". It was also ranked the ninth best song by Rolling Stone in their list of the \"25 Best Songs of 2009\" and received the Grammy Award for Best Female Pop Vocal Performance.\n\nThe accompanying music video, directed by Francis Lawrence, features Gaga inside a surreal white bathhouse. There, she gets kidnapped by a group of supermodels who drug her and sell her to the Russian mafia for sexual slavery. The music video ends with Gaga killing the man who bought her. The video received positive responses for its artistic treatment and visual imagery; critics complimented its provocative and symbolic plot. It was nominated for ten awards at the 2010 MTV Video Music Awards, eventually winning seven of those, including the Video of the Year. The video also won a Grammy for Best Short Form Music Video. Gaga has performed \"Bad Romance\" on television shows, including Saturday Night Live and Gossip Girl as well as award shows such as the 2009 American Music Awards. It was the closing song of Gaga's The Monster Ball Tour, during which, she performed it while standing inside a giant gyroscope.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uwputt1359181568.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=qrO4YZeyl0I", "strMusicVidDirector": "Francis Lawrence", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/xsvwqu1418394096.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/tuyvsw1418394204.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/yusssu1418394211.jpg", "intMusicVidViews": "1172539814", "intMusicVidLikes": "4399670", "intMusicVidDislikes": "398247", "intMusicVidFavorites": "0", "intMusicVidComments": "820472", "intTrackNumber": "1", "intLoved": "0", "intScore": "9.66667", "intScoreVotes": "6", "intTotalListeners": "1167941", "intTotalPlays": "13525906", "strMusicBrainzID": "f39ac45a-c9ef-46f5-b4cb-6fd5f2fe111d", "strMusicBrainzAlbumID": "d8707dc0-18ad-4f04-8d84-e81ceda4c681", "strMusicBrainzArtistID": "650e7db6-b795-4eb5-a702-5ea2fc46c848", "strLocked": "Unlocked"}]}