{"track": [{"idTrack": "32849936", "idAlbum": "2120401", "idArtist": "111827", "idLyric": "0", "idIMVDB": "0", "strTrack": "California Gurls", "strAlbum": "Teenage Dream", "strArtist": "Katy Perry", "strArtistAlternate": "Katy Hudson", "intCD": null, "intDuration": "234000", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"California Gurls\" is a song by American recording artist and songwriter Katy Perry from her third studio album, Teenage Dream (2010). Production was handled by Dr. Luke, Max Martin and Benny Blanco, all of whom contributed to the writing of the song along with Perry and Bonnie McKee. American hip hop artist Snoop Dogg also has a writing credit, and is featured as a guest vocalist on the song. According to Perry, the song is an answer song to \"Empire State of Mind\" by Jay-Z and Alicia Keys. \"California Gurls\" is a midtempo disco, funk-pop, and electronic song with influences of New Wave and electropop, while its lyrics are an ode to the west coast, the state in which Perry was born and raised.\n\n\"California Gurls\" garnered positive reviews from music critics, with the majority of them labeling it a \"summer anthem\", as well as complimenting its production and chorus. Originally intended to be sent to mainstream and rhythmic airplay on May 25, 2010, the song was rush released to radio on May 7, 2010, after clips from Perry's new album were leaked online. It was subsequently released to iTunes on May 11, 2010. The song was a worldwide success, peaking at number one on the Billboard Hot 100 for six consecutive weeks, giving Perry her second US number-one single and Snoop Dogg his third. The song reached number one in over 10 countries, including Australia, Canada, Ireland, New Zealand, and the United Kingdom.\n\nA music video for the song was released on June 15, 2010, and features Perry and her dancers as pieces of a board game, set in the fictional \"Candyfornia\". Perry has said that the inspiration behind the video was artist Will Cotton, who was also the artistic director of the video. It has been noted that the video is influenced by several other works, including Charlie and the Chocolate Factory, Alice in Wonderland, and the board game Candyland. On December 2, 2010, the song received a Grammy nomination for Best Pop Collaboration with Vocals. In 2012, Billboard ranked the song number one on a special The 30 Summer Songs of All Time listing.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qvqqsx1359422681.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=F57P9C4SAW4", "strMusicVidDirector": "Mathew Cullen", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/uxyxxp1364485220.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/uutrpr1364485231.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/stuquy1364485243.jpg", "intMusicVidViews": "512560074", "intMusicVidLikes": "1933437", "intMusicVidDislikes": "134863", "intMusicVidFavorites": "0", "intMusicVidComments": "113464", "intTrackNumber": "3", "intLoved": "2", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "44e88237-bdb1-4176-9687-714f0d9f6f76", "strMusicBrainzAlbumID": "e6f683c9-fc85-412c-a352-d6e411fc2603", "strMusicBrainzArtistID": "122d63fc-8671-43e4-9752-34e846d62a9c", "strLocked": "Unlocked"}]}