{"track": [{"idTrack": "32771226", "idAlbum": "2114062", "idArtist": "111674", "idLyric": "73578", "idIMVDB": "0", "strTrack": "Just the Way You Are", "strAlbum": "Doo-Wops & Hooligans", "strArtist": "Bruno Mars", "strArtistAlternate": " Peter Gene Hernandez", "intCD": null, "intDuration": "220000", "strGenre": "Pop", "strMood": "Philosophical", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Just the Way You Are\" is the debut single by American singer-songwriter Bruno Mars, and is the lead single from his debut studio album, Doo-Wops & Hooligans. It was released in the United States on July 20, 2010. It has also received airplay from AOL Radio's New Pop First station. The song was written by The Smeezingtons, Khalil Walton, Jon Ray, and Needlz and produced by The Smeezingtons, and Needlz. The music video, directed by Ethan Lader, was released on September 8, 2010 and features Peruvian born Australian actress Nathalie Kelley. The track was added to Radio 1 A Playlist in the United Kingdom, and was released in the United Kingdom on September 19, 2010 as \"Just the Way You Are (Amazing)\". The official remix features rapper Lupe Fiasco and is included on the deluxe edition of Doo-Wops & Hooligans. On February 13, 2011, the song won the Grammy Award for Best Male Pop Vocal Performance. \"Just the Way You Are\" has sold 12.5 million copies worldwide, becoming one of the best-selling singles of all time.\nThe song was written by The Smeezingtons, Khalil Walton, and Needlz. Bruno said of the song, \"It took me months to come up with 'Just the Way You Are'... I wasn't thinking of anything deep or poetic. I was telling a story. Get ready to fall in love!\" He added, \"I'm a big fan of songs like Joe Cocker's 'You Are So Beautiful' and Eric Clapton's 'Wonderful Tonight' - songs that go straight to the point. You know, there's no mind-boggling lyrics or twists in the story - they just come directly from the heart. And to me 'Just The Way You Are' is one of those songs. There's nothing mind-blowing about it. I'm just telling a woman she looks beautiful the way she IS - and, let's be honest, what woman doesn't wanna hear those lyrics?!\" Mars' A&R who was responsible for finding songs and songwriters to help in the process of composing the song, Aaron Bay-Schuck, told HitQuarters that as soon as \"Just the Way You Are\" was finished they knew they had the first single, saying:\n\n\"It had a massive chorus, an instantly memorable melody and lyric, and was a natural transition from the B.o.B and Travie McCoy songs ...  it didn’t sound like anything else on the radio. It had everything we could want in a first single for Bruno.\"\n\nAri Levine explains: “Needlz had a track with a melody idea by Khalil Walton that was presented to us by one of the A&R guys. Bruno and Phil came up with the chorus, and then Needlz sent us the files and we replaced a bunch of sounds with our sounds and I programmed drums in the MPC, and we wrote the rest of the song. I never met Needlz or Walton\". The song was supposed to be for Lupe Fiasco but at this point Bruno decided to keep it.\n\n\"Just the Way You Are\" was Mixed at Larrabee Sound Studios in Hollywood by Manny Marroquin, while Christian Plata and Erik Madrid served as the assistant mixing. Ari Levine and Bruno Mars played all the instruments on the track and recorded them. Ari was also responsible for engineering the song at Levcon Studios in California. Stephen Marcussen mastered the song at Marcussen Mastering in California.\n\"Just The Way You Are\" is a pop and R&B song with an instrumentation that features piano, keyboard sounds and breakbeat. The instruments are arranged into what critics described as a \"nice smooth ballad with vocals\". Tim Byron of The Vine said \"the steeply rising melody at the start of the chorus introduces a little tension before defusing it with the, catchy tag of the chorus, which is simple and effective as a hook\". The Guardian music reviewer, Paul Lester, describes the song as \"fairly standard R&B pop, his vocal a breezy falsetto as characterless.\"\n\nThe song is in the key of F Major and has a sequence of F-D-Minor-B-Flat-F. Mars' vocal range spans from F4 to C6. Billboard critic Megan Vick called \"Just The Way You Are\" \"a feel-good jam, in which Mars' is able to take \"to the next level\" is dreamy soprano with a \"breezy piano and vaguely hip-hop breakbeat\"\". Leah Greenblatt of Entertainment Weekly labeled the song \"sweetly smitten ballad\". Nick Levin from Digital Spy describe it as an \"huge-hearted urbany piano ballad with a similar instant classic feel to \"Empire State of Mind\"\". From The Guardian, Paul Lester says the lyrics are \"about a girl Mars could \"kiss all day\"\". The song has been compared to a \"U2 production\" by Jon Caramanica of The New York Times and by Andy Gill adding that he felt a \"groove through R&B territory\". Tim Sendra of allmusic called the debut single \"lushly romantic\". Scott Kara for the New Zealand Herald felt the song was a \"ballad boogie\".\n\nLyrically, the song is about Mars professing \"his love for a beautiful girl who occupies his dreams\". Megan Vick for Billboard carries on with her explanation \"Mars professes his love...\"When you smile, the whole world stops and stares for a while/ 'Cause girl you're amazing, just the way you are\". She concludes, \"Mars' lyrics aim to make female listeners feel nothing short of perfect in their own skin\". Tim Byron of The Vine said the song is \"effective – the repeated lines at the start of the verses are catchy\". Consequence of Sound's Kevin Barber described the song \"Mars sticks to the song’s name and insists that he wouldn’t want to change anything about his particular gal.You believe him, too. With an undeniably catchy chorus\".\nThe corresponding music video was directed by Ethan Lander and was shot in September 2010 in the downtown of Los Angeles. The video features Peruvian-Australian actress Nathalie Kelley. Lander considers Bruno Mars a star. He adds \"The charisma that he has, you can’t teach.” Finishing with \"singer even manages to be suave in his mugshot, which is no small feat!\" He sees the video as a collaboration, the video dicrector came up with the vision and Mars added his vision and son on. The video is a mixture of live action and stopped animation and through the animation Bruno shows his girlfriend how beautiful she is. He takes a cassette tape and starts creating images out of the tape and they start to get a live of their own.\n\nThe video begins with Kelley listening to \"Just the Way You Are\" on her Walkman as Mars walks in. Mars stops the tape player, removes the cassette tape and begins singing his song. As the instrumental portion of the song begins, Mars pulls the media out of the cassette tape and arranges the media into letters forming his name followed by the song title. As the song continues, he forms a picture of a drum, again on the table, using the tape media. Additional images of similar construction follow throughout the video including a portrait of Mars as well as one of Kelley blinking her eyes and smiling as Mars continues singing. Most of the images shown are animated, including a bell which Mars rings with his fingers in synchronization with the chimes near the end of the song. Lastly, Mars finishes the song while singing and playing an upright piano while Kelley watches and smiles. The video was inspired by the artwork of Erika Iris Simmons.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xxxqsq1359131907.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=LjhCEhWiKXk", "strMusicVidDirector": "Ethan Lader", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/vvxqps1418734407.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/uvysyp1418734414.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/usrywq1418734421.jpg", "intMusicVidViews": "1446417198", "intMusicVidLikes": "5131064", "intMusicVidDislikes": "200024", "intMusicVidFavorites": "0", "intMusicVidComments": "206531", "intTrackNumber": "2", "intLoved": "3", "intScore": "10", "intScoreVotes": "6", "intTotalListeners": "765960", "intTotalPlays": "6134786", "strMusicBrainzID": "2c03feb2-af77-483f-982e-8d82d3ffd03f", "strMusicBrainzAlbumID": "b3d1fbf7-dd1c-4119-a16e-58c2feb5bcb0", "strMusicBrainzArtistID": "afb680f2-b6eb-4cd7-a70b-a63b25c763d5", "strLocked": "Unlocked"}]}