{"track": [{"idTrack": "32734666", "idAlbum": "2110666", "idArtist": "111304", "idLyric": "0", "idIMVDB": "0", "strTrack": "Love the Way You Lie", "strAlbum": "Recovery", "strArtist": "Eminem", "strArtistAlternate": "Marshall Bruce Mathers III", "intCD": null, "intDuration": "263000", "strGenre": "Hip-Hop", "strMood": "Bittersweet", "strStyle": "Urban/R&B", "strTheme": "In Love", "strDescriptionEN": "\"Love the Way You Lie\" is the second single from American rapper Eminem's seventh studio album Recovery. Singer Skylar Grey was inspired to write and record the demo with Alex da Kid when she felt she was in an abusive romantic relationship with the music industry. Eminem wrote the verses and chose Barbadian singer Rihanna to sing the chorus; their past experiences of domestic violence influenced the collaboration. Recording sessions were held in Ferndale, Michigan, and Dublin, Ireland. Backed by guitar, piano and violin, the track is a midtempo hip hop ballad with a pop refrain and describes two lovers who refuse to separate despite being in an abusive love–hate relationship.\n\nInterscope Records released the single in August 2010. Critics, who praised the song's melody but were divided on its themes, suggested it was influenced by Eminem's and Rihanna's respective relationships with ex-lovers Kimberly Scott and Chris Brown. Eminem promoted \"Love the Way You Lie\" with performances at the 2010 Electronic Entertainment Expo, the MTV Video Music Awards and festivals. The music video, directed by Joseph Kahn, stars Dominic Monaghan and Megan Fox in a violent relationship and shows Eminem and Rihanna in front of a burning house. The clip had a mixed reception due to scenes of domestic violence; critics suggested it alludes to the personal lives of Eminem and Rihanna.\n\nMagazines listed \"Love the Way You Lie\" among the best of 2010 and of Eminem's work. The song won awards and received five Grammy nominations. His best-selling single, it was number one on 26 weekly record charts, including the United States' Billboard Hot 100 for seven weeks. The single sold more than 5 million copies in the US and was the best-selling song of 2010 in the United Kingdom. Musical acts such as Cher Lloyd and The Band Perry performed cover versions. Rihanna has said that a theme of domestic violence, a topic on which she claims many people do not have insight, is what makes the song effective. She later recorded \"Love the Way You Lie (Part II)\", narrated mostly from the female perspective.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qssqrs1441072440.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=uelHwf8o7_U", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/yvvvry1418387554.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/ytqvyp1418387563.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/rtrvsp1418387571.jpg", "intMusicVidViews": "1943918854", "intMusicVidLikes": "8568849", "intMusicVidDislikes": "316538", "intMusicVidFavorites": "0", "intMusicVidComments": "533509", "intTrackNumber": "15", "intLoved": "2", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": "626696", "intTotalPlays": "4423153", "strMusicBrainzID": "29d6a30b-b911-475c-808c-8b289844ca75", "strMusicBrainzAlbumID": "a5056c3b-730f-493b-b10e-52f678d72b85", "strMusicBrainzArtistID": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "strLocked": "Unlocked"}]}