{"track": [{"idTrack": "32999354", "idAlbum": "2132504", "idArtist": "111352", "idLyric": "485074", "idIMVDB": null, "strTrack": "Mine", "strAlbum": "Speak Now", "strArtist": "Taylor Swift", "strArtistAlternate": null, "intCD": "2", "intDuration": "232453", "strGenre": "Country", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Mine\" is a country pop song performed by American singer-songwriter Taylor Swift. The song was written by Swift alone and produced by Swift along with Nathan Chapman. It was released as the lead single from Swift's third studio album, Speak Now by Big Machine Records. Following an unauthorized Internet leak, the song was released on August 4, 2010, two weeks earlier than the intended release date. Swift was inspired to write \"Mine\" after reflecting on one of her unnamed crushes and explained that the song is about her tendency to run from love. The song contains elements of pop music and its lyrics speak of the ups and downs of a young love.\n\nCritical reception for \"Mine\" was mostly positive. Swift was praised for her ability to show a mature perspective on love, although some critics called the song \"formulaic\" for resonating her earlier works, notably \"Love Story\". The song was commercially successful, as well; it became a top ten hit in Australia, Canada and Japan. The single was certified gold by the Australian Recording Industry Association (ARIA). In the United States, the song entered the Billboard Hot 100 at number three, making Swift the second female artist in the history of the Hot 100 to debut multiple tracks in the top five during a calendar year after Mariah Carey did so in 1995.\n\nThe song's accompanying music video was directed by Roman White. The video chronicles the romantic relationship between Swift and her love interest played by British actor Toby Hemingway which ends with a marriage. The music video was met with great appraise from contemporary critics who deemed it as \"rather sweet,\" and \"heartwarming.\" The song was performed live at numerous venues to promote Speak Now. The music video received the coveted Video of the Year Award in the CMT Music Awards 2011.\n\nThe song was featured on an episode of Glee titled \"The Break Up\" sung by Naya Rivera (Santana Lopez) and was also covered by Maroon 5.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/trupsp1359414857.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=XPBwXKgDTdE", "strMusicVidDirector": "Roman White", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "151916892", "intMusicVidLikes": "451426", "intMusicVidDislikes": "14873", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "6", "intLoved": "1", "intScore": null, "intScoreVotes": null, "intTotalListeners": "271918", "intTotalPlays": "2503167", "strMusicBrainzID": "e856c716-3ee6-4691-a4c4-364b7e93a84f", "strMusicBrainzAlbumID": "ba1259eb-d41e-41c5-a70c-0e6fa73e6708", "strMusicBrainzArtistID": "20244d07-534f-4eff-b4d4-930878889970", "strLocked": "Unlocked"}]}