{"track": [{"idTrack": "32825778", "idAlbum": "2118431", "idArtist": "112461", "idLyric": "286331", "idIMVDB": null, "strTrack": "Need You Now", "strAlbum": "Need You Now", "strArtist": "Lady Antebellum", "strArtistAlternate": null, "intCD": null, "intDuration": "277573", "strGenre": "Rock", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Need You Now\" is a country pop song performed by American country music group Lady Antebellum. The song was co-written by Lady Antebellum and Josh Kear, and produced by the trio along with Paul Worley. It serves as the lead-off single and title track to their second studio album, Need You Now, which was released on January 26, 2010. The song was their debut single in the UK and Europe and was released on April 26, 2010. It won four Grammy Awards in 2011, including for Song of the Year and Record of the Year, the first country song to win both honors since 2007, and only the second ever.\n\nThe song spent five weeks at No. 1 on the Billboard Hot Country Songs chart in late 2009. Thereafter, \"Need You Now\" crossed over onto various pop and adult contemporary music charts, becoming a top five hit in Canada, Ireland, and New Zealand, as well as a top ten hit in the Netherlands and Norway. The song won Single of the Year and Song of the Year at the 2010 Academy of Country Music Awards, as well as Group Video of the Year at the 2010 CMT Music Awards. For the chart week of March 30, 2010, the song became the group's highest charting single on the Billboard Hot 100, reaching No. 2, the best position for a country song on that chart since Taylor Swift's \"Today Was a Fairytale\" reached the same position the previous month. The single has been certified quintuple platinum by the Recording Industry Association of America (RIAA).\n\nA music video was shot for the song, directed by Dave McClister. In the video the song has an extended piano intro, and features all members of the group acting out scenes related to the storyline. The song was initially released only to the country radio format in the United States and Canada on August 24, 2009, but was remixed and re-released to all other formats domestically and internationally at the beginning of 2010. The song gained prominence internationally, in Europe and South America. The trio re-recorded the song again in Simlish to accompany the release of the Sims 3 expansion pack Ambitions. By April 17, 2011, the song became the 9th most downloaded song in history, moving 5,000,000 copies, and surpassed Taylor Swift's \"Love Story\" as the most downloaded country song in history. It has since sold over 6 million copies in the US.\n\nThe song is featured in the first episode of Hellcats. It also appeared in episode 12 of The Glades. \"Need You Now\" has already been covered by several artists, including Adele and Glee Cast. \"Weird Al\" Yankovic included the chorus in \"Polka Face\", the polka medley from his 2011 album Alpocalypse.\n\nDavid McClister directed the \"Need You Now\" music video, using a treatment he wrote in 10 minutes.\n\nThe video features all three members of Lady Antebellum acting out scenes pertaining to the storyline. It begins in a hallway of a hotel where Kelley is sitting against a wall and Scott is in her room, with Haywood playing the piano. Kelley goes to a cafe and has a drink, where Haywood arrives with his love interest. Scott then leaves her room and hails a taxi. Kelley leaves the cafe and goes outside to walk to a costume ball, to which Scott is also traveling. When they arrive at the ball, they both see their love interests wearing masks and embrace them. Haywood soon arrives at the ball with his love interest. The video ends with all three members embracing their love interests. The video was filmed at the King Edward Hotel in Toronto, Ontario.\n\nOf the changes between the song and its music video, one of the most noted is Kelley drinking coffee instead of whiskey, since the song states the character is intoxicated. In response, McClister admitted he simply did not want the video to be a literal adaptation of the song, as he felt sitting in a diner in the middle of the night was lonelier.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/syxvvs1359671310.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=eM213aMKTHg", "strMusicVidDirector": "David McClister", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "93083043", "intMusicVidLikes": "443495", "intMusicVidDislikes": "8499", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "565914", "intTotalPlays": "4024320", "strMusicBrainzID": "01469536-81c9-4a65-8f97-61bcd7781ecd", "strMusicBrainzAlbumID": "be6f6989-a723-414e-a688-2f3057363959", "strMusicBrainzArtistID": "0eedfc95-e79a-4fd9-832a-cd816a0b3fda", "strLocked": "Unlocked"}]}