{"track": [{"idTrack": "32734658", "idAlbum": "2110666", "idArtist": "111304", "idLyric": "157910", "idIMVDB": "0", "strTrack": "Not Afraid", "strAlbum": "Recovery", "strArtist": "Eminem", "strArtistAlternate": "Marshall Bruce Mathers III", "intCD": null, "intDuration": "248000", "strGenre": "Hip-Hop", "strMood": "Angry", "strStyle": "Urban/R&B", "strTheme": "Street Life", "strDescriptionEN": "\"Not Afraid\" is a song by the American rapper Eminem from his seventh studio album, Recovery (2010). It was released as the album's lead single on April 29, 2010, by Interscope Records. \"Not Afraid\" was first revealed as a single by Eminem via Twitter, after which the song debuted on radio. To promote the single's release, a freestyle rap, \"Despicable\", was released on the Internet and received attention for its tone and lyrical content.\n\nThe song was written and produced by Eminem, Boi-1da, Jordan Evans and Matthew Burnett; keyboardist Luis Resto was also attributed with songwriting credit. According to Eminem's manager Paul Rosenberg and music critics, \"Not Afraid\" carries a positive message and depicts Eminem's change in direction from drugs and violence. Recording sessions took place at Effigy Studios in Michigan, Encore Studios in California and Boi-1da Studios in Ontario. Brothers Mike and Joe Strange worked with Eminem on mixing and engineering. The hip hop song features a choir that assists Eminem in a heavily layered chorus and vocals are sung over a guitar, synthesizer and piano; no Auto-Tune was used on the sung vocals, but many reverberation tools were.\n\n\"Not Afraid\" met with mixed to positive reviews from critics, who praised the song for being anthemic in nature and carrying a positive message. The song did, however, face criticism for its sudden change in theme from previous singles, and was considered to be less affecting than some of his other songs. Despite mixed reception, \"Not Afraid\" became the sixteenth song in Billboard history to debut on the US Billboard Hot 100 at number one; it also debuted as a chart-topper in Canada. As of August 2011, the song has sold over four million digital copies. \"Not Afraid\" has earned Eminem MTV Video Music Awards, MTV Video Music Awards Japan, Grammy Awards, Billboard Music Awards and Detroit Music Awards.\n\nThe song was accompanied by a music video, which Rich Lee directed in May 2010. New York City and Newark, New Jersey were chosen as settings to shoot the video. In it, Eminem displays newfound courage and confidence, albeit facing struggles and eventually jumping off a ledge. Reviewers praised the video as it followed the lyrics and praised the video for such depictions. However, the product placement in the video by Nike shoes and Beats by Dr. Dre headphones was criticized. In 2010, Eminem performed \"Not Afraid\" at Electronic Entertainment Expo 2010 (E3 2010), Oxegen 2010, T in the Park 2010 and the 2010 MTV Video Music Awards. He has also performed the song at the Bonnaroo Music Festival, Lollapalooza and the V Festival.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wpptsp1359607220.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=j5-yKhDd64s", "strMusicVidDirector": "Rich Lee", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/ytuqup1418650030.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/rxrwxu1418650039.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/xvsprw1418650047.jpg", "intMusicVidViews": "1369552713", "intMusicVidLikes": "8173848", "intMusicVidDislikes": "228422", "intMusicVidFavorites": "0", "intMusicVidComments": "819366", "intTrackNumber": "7", "intLoved": "2", "intScore": "9.33333", "intScoreVotes": "6", "intTotalListeners": "723892", "intTotalPlays": "5031592", "strMusicBrainzID": "7b898b31-3bf6-4048-a690-f33ba0cdb324", "strMusicBrainzAlbumID": "a5056c3b-730f-493b-b10e-52f678d72b85", "strMusicBrainzArtistID": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "strLocked": "Unlocked"}]}