{"track": [{"idTrack": "33024188", "idAlbum": "2134509", "idArtist": "113672", "idLyric": "337266", "idIMVDB": null, "strTrack": "Party in the U.S.A.", "strAlbum": "The Time of Our Lives", "strArtist": "Miley Cyrus", "strArtistAlternate": "Hanna Montana", "intCD": null, "intDuration": "202320", "strGenre": "Country", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Party in the U.S.A.\" is a pop song performed by American recording artist and actress Miley Cyrus. The song was written by Jessie J, Dr. Luke and Claude Kelly and produced by Dr. Luke. It was released on August 11, 2009, by Hollywood Records, as the lead single from Cyrus' first extended play The Time of Our Lives. The song was originally intended for Jessie J herself. However, believing it was not edgy enough for Jessie J, they passed it to Cyrus. Once it reached Cyrus, the songwriters adjusted the lyrics to fit Cyrus' persona. Not completely identifying with \"Party in the U.S.A.\", she chose it for The Time of Our Lives partially due to a need for tracks. The song's music merges elements found within R&B and pop music, while the lyrics reflect her relocating from Nashville, Tennessee, to Hollywood, California.\n\n\"Party in the U.S.A.\" was a critical and commercial success, reaching the top ten of charts in eight countries. In the United States, the song peaked at number two on the Billboard Hot 100, becoming Cyrus' best-charting single to date and sixth-best-selling digital single of 2009. It was also deemed one of the best-selling singles in the United States and Hollywood Records' fastest and best-selling single to date, selling 6 million copies worldwide as of October 2012. The single was certified 5x platinum by both the Recording Industry Association of America (RIAA) and Music Canada.\n\nThe music video for \"Party in the U.S.A.\", directed by Chris Applebaum, pays tribute to the 1978 film Grease and Cyrus' parents' courting days. It occurs mainly at a drive-in theater and won the MuchMusic Video Award for Best International Artist Video at the 2010 award show. The song was performed live for Cyrus' world tours, the 2009 Wonder World Tour and the 2011 Gypsy Heart Tour. At the 2009 Teen Choice Awards, Cyrus' use of a pole during a performance of \"Party in the U.S.A.\", which some interpreted to be a dance pole, caused a media uproar. \"Party in the U.S.A.\" has been covered by various artists, including its co-writer Jessie J, and parodied by \"Weird Al\" Yankovic.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/upqsxu1359691781.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=M11SvDtPBhA", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/xpqyqv1378885615.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/rrvusu1378885625.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/vvqwps1378885634.jpg", "intMusicVidViews": "428697428", "intMusicVidLikes": "993471", "intMusicVidDislikes": "141707", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "3", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "723230", "intTotalPlays": "4805428", "strMusicBrainzID": "c2656d9f-ed39-46a6-ae6c-9a1cadd48ebc", "strMusicBrainzAlbumID": "9ab71af0-20f1-4d09-b36e-d3b4068603cc", "strMusicBrainzArtistID": "7e9bd05a-117f-4cce-87bc-e011527a8b18", "strLocked": "Unlocked"}]}