{"track": [{"idTrack": "32855510", "idAlbum": "2120835", "idArtist": "112817", "idLyric": "270610", "idIMVDB": null, "strTrack": "Take It Off", "strAlbum": "Animal", "strArtist": "Ke$ha", "strArtistAlternate": "Kesha", "intCD": null, "intDuration": "215200", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Take It Off\" is a song by American recording artist and songwriter Kesha, from her debut album, Animal. The song was written by Kesha Sebert, Lukasz Gottwald and Claude Kelly and it was produced by Dr. Luke with vocal editing done by Emily Wright. It was released as the fourth and final single from the album on July 13, 2010. \"Take It Off\"'s initial writing consisted of Kesha attending a drag show and becoming turned on by transvestite men taking their clothing off. The song is an upbeat dance pop song that uses heavy amounts of auto tune and utilizes an electro infused beat.\n\nCritical reception of the song has been mixed to positive. A complaint amongst critics was the demonstration of overly processed vocals with the use of auto-tune. Other critics felt the song was a strong, irresistible dance-pop number that contained a carefree message. Due to strong digital sales from the release of Animal, the song charted in the United States, the United Kingdom and Canada before being announced as a single. After being released as a single the song reached the top ten in Canada, Australia and the United States. With the song reaching the top-ten in the United States, Kesha became only the eleventh artist in history to amass four top-tens from a debut album. As of February 2011, \"Take It Off\" has sold over two million copies in the United States.\n\nTwo music videos for the single were released. The first video features Kesha and her friends on a distant planet, dancing around in a mosh pit while slowly turning into stardust as the video progresses. The inspiration for the video, according to Kesha, was about shedding your inhibitions and being \"raw and real.\" The second video released for the song features Jeffree Star and incorporates a more dominant animal theme, while drawing from 80's themed inspiration such as: Tron, David Bowie in Labyrinth, and Revenge of the Nerds. To promote the single Kesha performed \"Take It Off\" along side earlier singles \"Your Love Is My Drug\" and \"Tik Tok\" on NBC's Today Show.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vsstqs1357657977.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=edP0L6LQzZE", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "59745658", "intMusicVidLikes": "193482", "intMusicVidDislikes": "11007", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "3", "intLoved": "1", "intScore": "9.2", "intScoreVotes": "5", "intTotalListeners": "626054", "intTotalPlays": "5484884", "strMusicBrainzID": "96ab3214-3aa0-4035-abcf-396f976efb13", "strMusicBrainzAlbumID": "ff7b68e9-ba2f-4a11-8004-52f1f358856a", "strMusicBrainzArtistID": "fab34286-b8e1-4879-bce3-194e1358fbd2", "strLocked": "Unlocked"}]}