{"track": [{"idTrack": "32849934", "idAlbum": "2120401", "idArtist": "111827", "idLyric": "270265", "idIMVDB": "2147483647", "strTrack": "Teenage Dream", "strAlbum": "Teenage Dream", "strArtist": "Katy Perry", "strArtistAlternate": "Katy Hudson", "intCD": null, "intDuration": "227000", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Teenage Dream\" is a song by American recording artist Katy Perry. It was released as the second single from her third studio album of the same name on July 23, 2010 through digital distribution. Perry and Bonnie McKee wrote many songs with a youthful theme in mind, but they were rejected by producers Benny Blanco and Dr. Luke. Blanco showed them The Teenagers' single \"Homecoming\", and McKee imagined \"Teenage Dream\" as a throwback song to the euphoric feelings of being in love as a teenager. They met with Max Martin in Perry's hometown of Santa Barbara, California and started writing the track at Playback Recording Studio, which Perry later described as a pure moment for her. After Perry recorded her vocals, McKee presented her idea and the chorus was rewritten. Perry also described the song as reminiscent of her youth while contemplating her future marriage to boyfriend Russell Brand.\n\nMusically, \"Teenage Dream\" is a mid-tempo pop song with a retro sound. It is styled in the genres of power pop and electropop, while taking influence from other genres such as disco, pop rock, and industrial music. Perry starts the song in a high-pitched voice while her vocals grow stronger as the song progresses. Lyrically \"Teenage Dream\" discusses being with a lover that makes one feel young again. \"Teenage Dream\" received generally positive reviews from music critics, some praising its nature and sound, but with others dismissing its lyrics as \"too carefree and immature.\" The song has topped the Billboard Hot 100, becoming Perry's third number-one single on that chart, and her second consecutive number-one single after California Gurls (2010). \"Teenage Dream\" has been certified four times platinum in the United States, as well as receiving platinum and multi-platinum certifications in other countries.\n\nA music video for the song was filmed in various locations around Perry's hometown in Santa Barbara, California and was directed by Yoann Lemoine. The video premiered on August 10, 2010, the video showcases Perry being in love with her high school sweetheart. Perry has performed the song on Saturday Night Live, the 2010 Teen Choice Awards, 53rd Grammy Awards and others. \"Teenage Dream\" was nominated for the Grammy Award for Best Female Pop Vocal Performance, becoming Perry's third nomination in the category. Rolling Stone listed the song as the fourth best song of 2010. The song is featured in the Best Buy edition of Just Dance 3. The song has been covered numerous times appearing on such as American Idol, The Voice , and Glee. The song was also covered by Justin Bieber, Lady Antebellum, and Keith Urban.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/suvrpq1359422475.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=98WtmW-lfeE", "strMusicVidDirector": "Yoann Lemoine", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "242993381", "intMusicVidLikes": "999230", "intMusicVidDislikes": "39313", "intMusicVidFavorites": "0", "intMusicVidComments": "67092", "intTrackNumber": "1", "intLoved": "2", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "832736", "intTotalPlays": "7689825", "strMusicBrainzID": "8cf81f4a-05fd-4688-bb8c-eb59df2026a0", "strMusicBrainzAlbumID": "e6f683c9-fc85-412c-a352-d6e411fc2603", "strMusicBrainzArtistID": "122d63fc-8671-43e4-9752-34e846d62a9c", "strLocked": "Unlocked"}]}