{"track": [{"idTrack": "32723949", "idAlbum": "2109594", "idArtist": "111236", "idLyric": "0", "idIMVDB": null, "strTrack": "Telephone", "strAlbum": "The Fame Monster", "strArtist": "Lady Gaga", "strArtistAlternate": null, "intCD": null, "intDuration": "221000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Telephone\" is a song co-written and performed by Lady Gaga. It was released from her third extended play (EP) and second major release The Fame Monster (2009). The song, with American R&B singer Beyoncé Knowles, was written by Gaga and Rodney Jerkins. Inspired by her \"Fear of Suffocation Monster\", Gaga explained that the lyrics portray herself preferring the dance floor instead of answering her lover's phone call and noted that the telephone addressed in the lyrics of the song is, in reality, a person telling her to continue working harder. Musically, \"Telephone\" consists of an expanded bridge, verse-rap and an epilogue where the voice of an operator announces that the phone line is unreachable. Knowles appears in the middle of the song, singing the verses in a rapid-fire way, accompanied by double beats.\n\nA critical success, most contemporary critics frequently noted \"Telephone\" as a stand-out track from The Fame Monster and it was Grammy-nominated for Best Pop Collaboration with Vocals in 2011. \"Telephone\" charted in a number of countries due to digital sales following the album's release, namely in the United States, Australia, Canada, the Netherlands, New Zealand, Sweden and Hungary. The song was particularly successful in Europe where it reached the top of the charts in Belgium, Denmark, Hungary, Ireland, Netherlands, Norway and the United Kingdom. According to the International Federation of the Phonographic Industry, the single sold 7.4 million digital copies worldwide in 2010, making it one of Gaga's best-selling singles.\n\nThe accompanying music video is a continuation of the video for her 2009 song \"Paparazzi\" and is also shot as a short film. After being bailed out of prison by Beyoncé, she and Gaga go to a diner where they kill the guests having breakfast. Upon escape from the diner, the two end up in a high speed police chase. The video referenced Quentin Tarantino and his films Kill Bill: Vol. 1 (2003) and Pulp Fiction (1994). Many critics praised the video, but some criticized its violence and themes. In memory of Alexander McQueen, Gaga performed an acoustic rendition of \"Telephone\" mixed with \"Dance in the Dark\" at the 2010 BRIT Awards. It was also added to the set list of The Monster Ball Tour in 2010. A Britney Spears demo of \"Telephone\" leaked onto the web in May 2010.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/yptpst1359181716.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=EVBsypHzF3U", "strMusicVidDirector": "Jonas Akerlund", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "212785529", "intMusicVidLikes": "437048", "intMusicVidDislikes": "62100", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "6", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "4daf26b7-7cf3-4752-bebc-9bb23a4648e1", "strMusicBrainzAlbumID": "d8707dc0-18ad-4f04-8d84-e81ceda4c681", "strMusicBrainzArtistID": "650e7db6-b795-4eb5-a702-5ea2fc46c848", "strLocked": "Unlocked"}]}