{"track": [{"idTrack": "32855509", "idAlbum": "2120835", "idArtist": "112817", "idLyric": "270611", "idIMVDB": null, "strTrack": "TiK ToK", "strAlbum": "Animal", "strArtist": "Ke$ha", "strArtistAlternate": "Kesha", "intCD": null, "intDuration": "199693", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Tik Tok\" (styled as \"TiK ToK\") is the debut single by American recording artist Kesha. The song was produced by Benny Blanco and Dr. Luke and co-written by Blanco, Dr. Luke and Kesha. It was released on August 7, 2009 as the lead single from Kesha's debut studio album, Animal. The opening line of the song came from an experience where Kesha woke up surrounded by beautiful women, to which she imagined Diddy being in a similar scenario. The experience triggered the writing of the song which she later brought to her producer, Dr. Luke, who was then contacted by Diddy in hopes of a collaboration; he came to the studio the same day and recorded his lines and the song was completed.\n\nAccording to Kesha the song's lyrics are representative of her and based on her life; the song has a carefree message and talks about not letting anything bring you down. The song is a dance-pop and electropop song that uses a minimalist video-game beat interspersed with handclaps and synths. The song's verses use a rap-sing vocal style while the chorus is sung; throughout the song the use of Auto-Tune is prominent. Musically, the song has been compared to Lady Gaga, Uffie, and Fergie.\n\nThe song generated mixed to generally positive reviews from music critics upon its release. Critics generally praised the lyrics and celebration of party lifestyle; the song's production was generally well received although some critics criticized the song for sounding irritating and being too similar to some tracks performed by other artists like Lady Gaga and Uffie. It achieved commercial success by topping the charts in eleven countries. In the United States the song broke the record for the biggest single-week sum of all time for a female artist selling 610,000 digital downloads in one week. \"Tik Tok\" was certified 5× platinum by the Recording Industry Association of America (RIAA) for sales of five million copies and has sold over six million copies in the United States. The song was the best-selling single worldwide in 2010, selling 12.8 million copies in that year alone, and has sold about 14 million copies to date, becoming the second best-selling single in the digital history – being the most sold single in history by a female solo artist.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xvxyxx1357657613.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=iP6XpLQM2Cs", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "204630087", "intMusicVidLikes": "527443", "intMusicVidDislikes": "56457", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "2", "intScore": "9.33333", "intScoreVotes": "6", "intTotalListeners": "1392322", "intTotalPlays": "10595741", "strMusicBrainzID": "ff62ccac-eec1-445e-a00e-75ca6eb6bb36", "strMusicBrainzAlbumID": "ff7b68e9-ba2f-4a11-8004-52f1f358856a", "strMusicBrainzArtistID": "fab34286-b8e1-4879-bce3-194e1358fbd2", "strLocked": "Unlocked"}]}