{"track": [{"idTrack": "32855508", "idAlbum": "2120835", "idArtist": "112817", "idLyric": "270612", "idIMVDB": null, "strTrack": "Your Love Is My Drug", "strAlbum": "Animal", "strArtist": "Ke$ha", "strArtistAlternate": "Kesha", "intCD": null, "intDuration": "187133", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Your Love Is My Drug\" (styled as Your L♥ve Is My Drug) is a song by American recording artist and songwriter Kesha, from her debut album, Animal. It was released as the album's third single on May 14, 2010. The song was written by Kesha, Pebe Sebert, with Ammo, who co-produced the song with Dr. Luke and Benny Blanco. \"Your Love Is My Drug\"'s initial writing took place during a plane ride. Kesha stated the song had a carefree message and was not meant to be taken too seriously. The song's inspiration came from Kesha and her ex-boyfriend; it is about their psychotic relationship with their love for one another being compared to a drug. According to Kesha, the song sounds happy but also contains a dark undertone, an obsession for someone and is about being heartbroken.\n\nCritical reception of the song has been generally positive. Critics complimented the hook but had mixed reactions with the chorus. Some praised Kesha for knowing her way around a strong pop chorus, while others called it predictable and dull. Prior to the release of Animal, the song charted in the United States, the United Kingdom, and Canada. After being released as a single the song reached the top five in Australia and the United States, as well as reaching the top ten in Canada. It has gone on to sell over three million copies in the US alone.\n\nKesha performed the song alongside \"Tik Tok\" on the thirty-fifth season of Saturday Night Live where she was covered in glow in the dark tribal-like make-up. In the music video, Kesha is portrayed in the desert while being chased around by her love interest. The main idea behind the video is being so in love with someone that you lose your head, comparable to love being a drug. The video features a digital animation aspect which was inspired by The Beatles' Yellow Submarine.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/ysqwqy1357657793.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=QR_qa3Ohwls", "strMusicVidDirector": "Honey", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "74922033", "intMusicVidLikes": "189798", "intMusicVidDislikes": "15188", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "1", "intScore": "9.6", "intScoreVotes": "5", "intTotalListeners": "694533", "intTotalPlays": "4496332", "strMusicBrainzID": "9fff929b-c0cc-4ae8-a01d-d0a6ae84b86b", "strMusicBrainzAlbumID": "ff7b68e9-ba2f-4a11-8004-52f1f358856a", "strMusicBrainzArtistID": "fab34286-b8e1-4879-bce3-194e1358fbd2", "strLocked": "Unlocked"}]}