{"track": [{"idTrack": "32912579", "idAlbum": "2125330", "idArtist": "113545", "idLyric": "213227", "idIMVDB": null, "strTrack": "All I Wanna Do Is Make Love to You", "strAlbum": "Brigade", "strArtist": "Heart", "strArtistAlternate": null, "intCD": null, "intDuration": "310893", "strGenre": "Classic Rock", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"All I Wanna Do Is Make Love to You\" (also titled \"All I Wanna Do\") is a song recorded by American rock band Heart. It was composed by veteran songwriter and producer Robert Lange and released as the first single from the band's tenth studio album Brigade, as well as their first hit single of the 1990s. The song was first recorded as \"All I Want to Do Is Make Love to You\" by Dobie Gray in 1979, though with completely different lyrics.\n\nIn the track, singer Ann Wilson sings of a one-night stand with a man, only to reveal later in the song that her intent all along was to use the encounter as a way to become pregnant. The lyrics explain later, when she reunites with the one-time lover, that her child is the result of their tryst and she did it only because the man she really loves is not able to give her children.[citation needed]\n\n\"All I Wanna Do Is Make Love to You\" was a success, spending two weeks at number two on the U.S. Billboard Hot 100, peaking at number eight in the UK Singles Chart, and reaching #1 in Canada and Australia. It reached #1 in Sweden in May 12, 1990. It was also nominated for a Grammy Award for Best Group Pop Vocal Performance, and is the only one of Heart's singles to have been certified Gold by the RIAA. On the Adult Contemporary chart, the song climbed to number six, becoming the third of Heart's four top-ten AC hits (after \"These Dreams\" and \"Alone\").\n\nIn the liner notes of Heart's album The Road Home, Ann Wilson commented on the band's dislike for the song, stating, \"Actually we had sworn off it because it kind of stood for everything we wanted to get away from. It was a song by \"Mutt\" Lange, who we liked, and it was originally written for Don Henley, but there was a lot of pressure on us to do the song at the time.\"\n\nThe single was Heart's last pop chart top ten hit. The band had one more top ten Adult Contemporary chart hit with the follow-up, \"Stranded\"; \"Stranded\" and 1994's \"Will You Be There (In The Morning)\" were also top 10 Album Rock hits.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xsuxvt1352166729.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=OAfxs0IDeMs", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "9681726", "intMusicVidLikes": "43318", "intMusicVidDislikes": "885", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": "109535", "intTotalPlays": "411813", "strMusicBrainzID": "1859df00-7561-4626-9202-32ab3cb3b3fe", "strMusicBrainzAlbumID": "c2e6f148-1299-3eca-8e7f-b0986b327ab4", "strMusicBrainzArtistID": "bdbd48f5-abf3-4a4f-9a21-4551dbc3fde9", "strLocked": "Unlocked"}]}