{"track": [{"idTrack": "33332485", "idAlbum": "2159644", "idArtist": "119232", "idLyric": "389136", "idIMVDB": "0", "strTrack": "Another Day in Paradise", "strAlbum": "...But Seriously", "strArtist": "Phil Collins", "strArtistAlternate": null, "intCD": null, "intDuration": "322000", "strGenre": "Progressive Rock", "strMood": "Good Natured", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Another Day in Paradise\" is a song recorded by English singer-songwriter Phil Collins. Produced by Collins along with Hugh Padgham, it was released as the first single from his number-one album ...But Seriously (1989). As with his song for Genesis, \"Man on the Corner\", the track has as its subject the problem of homelessness; as such, the song was a substantial departure from the dance-pop music of his previous album, No Jacket Required (1985).\n\nCollins sings the song from a third-person perspective, as he observes a man crossing the street to ignore a homeless woman, and he implores listeners not to turn a blind eye to homelessness because, by drawing a religious allusion, \"it's just another day for you and me in paradise\". Collins also appeals directly to God by singing: \"Oh Lord, is there nothing more anybody can do? Oh Lord, there must be something you can say?\"\n\nThe song was Collins' seventh and final Billboard Hot 100 number-one single, and the first number-one single of the 1990s. It was also a worldwide success, eventually becoming one of the most successful songs of his solo career. It won Collins and Padgham the Grammy Award for Record of the Year at the 1991 awards ceremony, while it was also nominated for Song of the Year, Best Pop Vocal Performance, Male and Best Music Video, Short Form. \"Another Day in Paradise\" also won an award for Best British Single at the 1990 BRIT Awards. Despite the awards gained following its release, the song also generated controversy over its subject matter and has received a largely negative reaction from music critics.\n\nCollins and David Crosby's live performance of the song at the 1991 Grammy Awards was released on the 1994 album Grammy's Greatest Moments Volume I. In 2009, Collins's version was listed at 86th on Billboard's Greatest Songs of All Time. \"Another Day in Paradise\" has since been covered by several artists, including Brandy, her brother Ray J, Jam Tronik, Axxis, Novecento, and Hank Marvin.\n\nThe song was another massive hit for Collins. On 23 December 1989, it became his seventh (and to date, final) No. 1 single in the U.S. The song was also the final No. 1 song of the 1980s in the U.S., and remained at No. 1 for four weeks, which classifies the song as a hit from the 1990s as well. This song is notable for keeping Janet Jackson's \"Rhythm Nation\" from ever reaching number one. It also saw out the 1980s and saw in the 1990s at the top of the German singles chart. The song had already reached No. 2 in the UK in November of that year. The single version is slightly different from the album version in that it uses a shorter intro. David Crosby also appears performing backing vocals.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uvqsyx1488465422.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=ftlYLcEW_I4", "strMusicVidDirector": "Jim Yukich", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "8422167", "intMusicVidLikes": "14859", "intMusicVidDislikes": "387", "intMusicVidFavorites": "0", "intMusicVidComments": "2475", "intTrackNumber": "7", "intLoved": "1", "intScore": "9.25", "intScoreVotes": "8", "intTotalListeners": "451146", "intTotalPlays": "2255609", "strMusicBrainzID": "4777b119-4892-4cfc-8def-b6ec76a2e0f6", "strMusicBrainzAlbumID": "822d9247-6059-3716-b1f9-f7b95526f721", "strMusicBrainzArtistID": "401c3991-b76b-499d-8082-9f2df958ef78", "strLocked": "Unlocked"}]}