{"track": [{"idTrack": "32958086", "idAlbum": "2129079", "idArtist": "114115", "idLyric": "0", "idIMVDB": null, "strTrack": "Blaze of Glory", "strAlbum": "Blaze of Glory", "strArtist": "Jon Bon Jovi", "strArtistAlternate": "John Francis Bongiovi", "intCD": null, "intDuration": "347546", "strGenre": "Rock", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Blaze of Glory (Theme from Young Guns II)\" is a song by Jon Bon Jovi which reached No. 1 on the Billboard Hot 100 and the Mainstream rock chart in 1990, his only chart-topper away from his band Bon Jovi. The song also reached No. 1 on the Billboard Album Rock Tracks chart. \"Blaze of Glory (Theme from Young Guns II)\" also topped the ARIA music chart in Australia for a total of six weeks, and reached No. 13 on the UK Singles Chart.\n\nThe song remains a crowd favorite with Bon Jovi fans, despite the fact that the song was not released as one of the band's singles, and only by Jon. The track is notable for the performance of Jeff Beck on guitar.\n\nIn October 2005, \"Blaze of Glory (Theme from Young Guns II)\" was voted as \"Best Song to Ride a Horse to in Slow Motion\" by Blender Magazine.\n\nIt first appeared in the motion picture Young Guns II, for which it was originally recorded. It later appeared as the title track on his solo album Blaze of Glory. Next, it appeared on Cross Road, Bon Jovi's Greatest Hits album. It appeared on Bon Jovi's live DVD Live From London. and their 2010 Greatest Hits album.\n\nThe song was sung by Phil Stacey on American Idol.\n\nThe song is referenced in the 2008 romantic comedy My Best Friend's Girl, where Jason Biggs' character is told by a babysitter he has been \"Shot down.... in a blaze of glory\" after insulting the woman he was about to go out on a date with.\n\nIn 2009, the song became the theme song for Storm Chasers season 3.\n\nThe song, as performed by Jeffster, was featured in the third season finale of the NBC television series Chuck.\n\nBlaze of Glory was covered by 2010 X Factor Australia winner Altiyan Childs for his self-titled debut album.\n\nIt was also featured in the It's Always Sunny in Philadelphia episode \"Mac & Charlie Die (Part One)\", where Mac and Charlie play the song on the car radio right before staging their deaths.\n\nDespite not being performed by Bon Jovi, the song made an appearance on the band's 2010 Greatest Hits album.\n\nThe lyrics to the song were also featured in the horror game Silent Hill 2, on the back of a letter written by James Sunderland's dead wife Mary.\n\nIn a mission where the Protoss make the final stand in the widely popular video-game Starcraft 2, the player can unlock the 'Blaze of Glory' achievement if he manages to kill 2250 Zerg before the last Protoss unit falls.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/typquq1358722631.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=MfmYCM4CS8o", "strMusicVidDirector": "Wayne Isham", "strMusicVidCompany": "The Company", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "14673907", "intMusicVidLikes": "51819", "intMusicVidDislikes": "1019", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "3", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "110301", "intTotalPlays": "373126", "strMusicBrainzID": "97a8bbf5-1931-4d1a-ad06-c518da3ac159", "strMusicBrainzAlbumID": "c455d389-9624-311b-a596-d7195f4036a7", "strMusicBrainzArtistID": "5ace9b0c-cc21-4d8f-8e08-a70234439f2a", "strLocked": "Unlocked"}]}