{"track": [{"idTrack": "32832847", "idAlbum": "2119049", "idArtist": "112534", "idLyric": "53803", "idIMVDB": null, "strTrack": "Cradle of Love", "strAlbum": "Charmed Life", "strArtist": "Billy Idol", "strArtistAlternate": "William Michael Albert Broad", "intCD": null, "intDuration": "281373", "strGenre": "Post-Punk", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\n\"Cradle of Love\" is a rock song written by Billy Idol and David Werner for Idol's 1990 fourth studio album Charmed Life. The song is the album's sixth track, and was released as its first single. The song became one of Idol's biggest hits in the United States, where it reached #2 on the Billboard Hot 100, but stalled at #34 in Idol's native UK. It was also Idol's first, and (so far) only #1 hit on the Mainstream Rock Tracks chart in the U.S.\n\nThe song was featured on the soundtrack of The Adventures of Ford Fairlane. It was nominated for Rock Vocal Performance, Male at the 32nd Grammy Awards. It was well received by critics, and was frequently cited as a highlight of the album. Alvin and the Chipmunks covered this song as the opening track to their 1991 album The Chipmunks Rock the House. In 1992, \"Weird Al\" Yankovic included the chorus as the first song in his polka medley \"Polka Your Eyes Out\" from his album Off the Deep End.\n\nThe video, directed by David Fincher, features footage of Idol singing in large frames throughout an apartment. The director made the decision to film Idol from the waist up as he was unable to walk from a motorcycle accident that had happened in February 1990. It also features Betsy Lynn George as a teenager who tries to seduce a modest and mild mannered businessman played by Joshua Townshend-Zellner. The film makes use of clips from The Adventures of Ford Fairlane, but as Andrew Dice Clay (who played Fairlane) had been banned from MTV, he is not shown in any of the clips. The video was a huge hit and was placed in heavy rotation on MTV. Idol and George recreated the opening of the video for the 1991 American Music Awards.\n\nAt the 1990 MTV Video Music Awards, the video was nominated for Best Male Video and Best Special Effects and won the award for Best Video from a Film.\n\nThis video was voted #33 on VH1's 50 Sexiest Video Moments.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rqxxwr1359589211.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=NCZuYS-9qaw", "strMusicVidDirector": "David Fincher", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "4044303", "intMusicVidLikes": "16886", "intMusicVidDislikes": "287", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "6", "intLoved": "0", "intScore": "7.5", "intScoreVotes": "2", "intTotalListeners": "104567", "intTotalPlays": "420598", "strMusicBrainzID": "7e6129f1-0f0b-4cdc-b6c8-9b4de02ae996", "strMusicBrainzAlbumID": "c269307e-8269-3dca-9401-614c067633b2", "strMusicBrainzArtistID": "47c8f88b-987a-4b64-9175-2b1b57809727", "strLocked": "Unlocked"}]}