{"track": [{"idTrack": "32732899", "idAlbum": "2110493", "idArtist": "111295", "idLyric": "128209", "idIMVDB": "0", "strTrack": "Enjoy the Silence", "strAlbum": "Violator", "strArtist": "Depeche Mode", "strArtistAlternate": null, "intCD": null, "intDuration": "372973", "strGenre": "Synthpop", "strMood": "Moody", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Enjoy the Silence\" is a song by English electronic music band Depeche Mode. Recorded in 1989, it was released as the second single from their seventh studio album, Violator (1990), on 16 January 1990. The single is Gold certificated in the US and Germany. The song won Best British Single at the 1991 BRIT Awards.\n\nThe Anton Corbijn-directed music video for \"Enjoy the Silence\" references the themes and storyline of the philosophical children's book The Little Prince from Antoine de Saint-Exupéry. Footage of Dave Gahan dressed as a stereotypical king wandering the hillsides of the Scottish Highlands, the coast of Algarve in Portugal and finally the Swiss Alps with a deck chair is intercut with black-and-white footage of the band posing. Brief flashes of a single rose (which is also on the album cover of Violator) appear throughout the scenes.\n\nThere are two edited versions of the Corbijn-directed video. One version begins with Andy Fletcher looking towards his right as the song begins. Shots of Dave Gahan dressed as a king singing directly to the camera are intercut with scenes of his walking through the Scottish Highlands, the coast of Portugal and the Swiss Alps. The video ends with Gahan singing the last line, \"Enjoy the silence\", then putting his finger in front of his lips as if to quiet the viewer. This video is blocked in Japan, Mexico, United States. The second version begins with Martin Gore looking to his right as the song begins. This version omits the shots of Gahan singing directly to the camera. In this version, the only lines Gahan is shown singing are \"Words are very unnecessary/They can only do harm.\" The video ends with Gahan sitting on a deck chair in the snow while the last line, \"Enjoy the silence\", is sung. There are also differences in the group shots of the band standing together between the two versions.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vquytu1342289349.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=aGSKrC7dGcY", "strMusicVidDirector": "Anton Corbijn", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "162411946", "intMusicVidLikes": "750952", "intMusicVidDislikes": "19290", "intMusicVidFavorites": "0", "intMusicVidComments": "25045", "intTrackNumber": "6", "intLoved": "2", "intScore": "9", "intScoreVotes": "5", "intTotalListeners": "941334", "intTotalPlays": "7547771", "strMusicBrainzID": "6058976e-2120-47bb-92df-2fd2fd1b542f", "strMusicBrainzAlbumID": "71f1482e-e63f-3b2c-811b-939f62708f2a", "strMusicBrainzArtistID": "8538e728-ca0b-4321-b7e5-cff6565dd4c0", "strLocked": "Unlocked"}]}