{"track": [{"idTrack": "32734532", "idAlbum": "2110657", "idArtist": "111303", "idLyric": "197676", "idIMVDB": "728413601249", "strTrack": "Here We Are", "strAlbum": "Cuts Both Ways", "strArtist": "Gloria Estefan", "strArtistAlternate": "Gloria María Milagrosa Fajardo García", "intCD": null, "intDuration": "291200", "strGenre": "Pop", "strMood": "...", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Here We Are\" is a song by Cuban American singer-songwriter Gloria Estefan. It was released in 1989 in the United States and in 1990 to the rest of the world as the third single of the album, Cuts Both Ways. It is one of many successful ballads performed by Estefan. The single was released with a B-side song: \"Don't Let the Sun Go Down on Me\", that was included on the European version, later to appear on the Hold Me, Thrill Me, Kiss Me album. A Portuguese version of the song, \"Toda Pra Você,\" is included on the compilation Exitos De Gloria Estefan as well as the Brazilian edition of the Cuts Both Ways album. As a duet for her special television concert All The Way Concert, Celine Dion performed this song, while Estefan sang Dion's song, \"Because You Loved Me.\" A new Spanish version was released in July 2019 on YouTube by Gloria called \"Tu y yo\" celebrating the 30th anniversary of the song. This was included in the Brazil305 album.\n\nCritical reception\nMatthew Hocter from Albumism said \"Here We Are\" is the \"epitome of what ‘80s ballads executed with pure perfection were all about\". He picked it as one of the \"highlights\" of Cuts Both Ways. AllMusic editor Jason Birchmeier deemed it as a \"super\" song. Maryann Scheufele from AXS called it a \"beautiful love song\", adding that it \"suggests how quickly time passes and love happens. Gloria Estefan has a powerful voice in this love song as she sings that there is \"nothing I can do to keep from loving you\" believably. Be reassured by love as you listen.\" Bill Coleman from Billboard noted that \"beautifully etched acoustic guitar strumming frames Estefan's warm and inviting vocals\". A reviewer from Entertainment Weekly said the song \"croon along smoothly\". British newspaper Lennox Herald described it as a \"ballad of heartbreaking lament\", where Estefan demonstrates her \"glorious feel for a ballad.\" They added that the Carpenters \"would have been proud of you\". Also Pop Rescue noted that \"acoustic guitars gently strum in the background, and a scattering of piano help this song step back and let Gloria’s vocals shine.\"\n\nChart performance\n\"Here We Are\" continued Estefan's success on the Billboard Hot 100 chart. The song was Estefan's ninth Top 10 single, peaking at number 6 in 1990. \"Here We Are\" went to number 1 on the American adult contemporary chart and remained in the top spot for five weeks. Overseas, the song peaked at number 23 on the UK Singles Chart.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/gm9bip1639240397.jpg", "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "https://www.youtube.com/watch?v=Wf9DYeePLJY", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "15733170", "intMusicVidLikes": "80111", "intMusicVidDislikes": "3000", "intMusicVidFavorites": "0", "intMusicVidComments": "4292", "intTrackNumber": "2", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": "27613", "intTotalPlays": "84989", "strMusicBrainzID": "cdfc9bfa-93ec-4de8-aeaf-e48a7732579b", "strMusicBrainzAlbumID": "7a4913d2-fde8-3199-90d7-2afaf2d85941", "strMusicBrainzArtistID": "becd8cc6-a453-4183-af88-dedaaec859a6", "strLocked": "Unlocked"}]}