{"track": [{"idTrack": "32730899", "idAlbum": "2110292", "idArtist": "111282", "idLyric": "71609", "idIMVDB": "0", "strTrack": "From the Bottom of My Broken Heart", "strAlbum": "...Baby One More Time", "strArtist": "Britney Spears", "strArtistAlternate": "Britney", "intCD": null, "intDuration": "313000", "strGenre": "Pop", "strMood": "Party", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"From the Bottom of My Broken Heart\" is a song recorded by American singer Britney Spears for her debut studio album, ...Baby One More Time (1999). It was released on December 15, 1999 by Jive Records as the fifth and final single from the album. After Spears recorded an unused song from Toni Braxton and sent it through Larry Rudolph to several labels, executives from Jive Records commented that it was very rare to hear someone so young who could deliver emotional content and commercial appeal, appointing the singer to work with producer Eric Foster White. The teen pop ballad was written and produced by White, and features Spears singing about the loss of a first love and how breaking up can be hard.\n\n\"From the Bottom of My Broken Heart\" received mixed to positive reviews from music critics, who noted the song as a classic hit and competent single, despite considering it unremarkable like other ballads on the album and calling it \"another rejection ballad that refers to kissing but nothing else\". \"From the Bottom of My Broken Heart\" achieved moderate success, peaking at number 37 in Australia, and 23 in New Zealand. Through imports, the song managed to peak at number 174 in the United Kingdom. In the United States, \"From the Bottom of My Broken Heart\" reached number 14 on Billboard Hot 100, and 17 on Pop Songs, being later certified Platinum by the Recording Industry Association of America (RIAA) on March 28, 2000, for shipping 1,000,000 physical units of the single. It was the 8th best-selling physical single of the 2000s in the country.\n\nAn accompanying music video, directed by Gregory Dark, was released on December 17, 1999. It portrayed Spears packing her belongings as she readies herself to move away from home, and feeling upset because she knows that she is going to miss her first love. The video was the subject of controversy among the press, who panned the singer for hiring an adult filmmaker to direct her video. A Spears representative commented that they were only aware of Dark doing music videos. The singer performed \"From the Bottom of My Broken Heart\" in a few live appearances, including at the 2000 Grammy Awards, in a medley with \"...Baby One More Time\", and in three of her concert tours.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rxqvsq1531143206.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=fHPnGqXXUmI", "strMusicVidDirector": "Gregory Dark", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "24933159", "intMusicVidLikes": "76996", "intMusicVidDislikes": "2591", "intMusicVidFavorites": "0", "intMusicVidComments": "6294", "intTrackNumber": "6", "intLoved": "0", "intScore": "3", "intScoreVotes": "1", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "2e658b2f-3bc2-4e4c-8834-4d976b02590b", "strMusicBrainzAlbumID": "faeb8741-2ca0-3ca6-8a1a-70bab1e67c82", "strMusicBrainzArtistID": "45a663b5-b1cb-4a91-bff6-2bef7bbfdd76", "strLocked": "Unlocked"}]}