{"track": [{"idTrack": "32974166", "idAlbum": "2130430", "idArtist": "114306", "idLyric": "290074", "idIMVDB": "0", "strTrack": "I Need You", "strAlbum": "I Need You", "strArtist": "LeAnn Rimes", "strArtistAlternate": "Margaret LeAnn Rimes", "intCD": null, "intDuration": "228333", "strGenre": "Country", "strMood": "Good Natured", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"I Need You\" is a song written by Dennis Matkosky and Ty Lacy, and performed by American country pop artist LeAnn Rimes. It was released on July 18, 2000 as a single from Jesus: Music From and Inspired by the Epic Mini-Series. The song also contains a tribute to the 1989 Don Bluth/United Artists film All Dogs Go to Heaven.\n\nThe song spent 25 weeks on the Billboard Hot 100 charts and peaked at number 11.\n\nA music video was released in 2000.\n\n\"I Need You\" was released on July 18, 2000 as a single from Jesus: Music From & Inspired by the Epic Mini-Series. The song was re-released in 2002 by her label, Curb, in the album, I Need You, along with the Graham Stack Radio Edit, and included on her 2003 Greatest Hits album. Also in 2003, the song was included on CMT Most Wanted Volume 1. The song was included on her Best of album in 2004 and the Dave Aude Radio Edit was included on the remix edition. A new remix by Digital Dog was featured on Rimes' 2014 greatest hits album, Dance Like You Don't Give a.... Greatest Hits Remixes. On February 3, 2015, it was included on her All-Time Greatest Hits album.\n\nRimes donated her artist fees and royalties from this song to fund and build a therapeutic rehabilitation wing — the “LeAnn Rimes Adventure Gym” — at the Vanderbilt Children’s Hospital in Nashville, Tennessee (Remz).\n\nAlthough the single was released on July 18, 2000, it was only available as the commercial pop version. The country mix version of this song was not available until September 12, 2000 when Curb featured it on the multi-artist compilation album, \"Wings Of A Dove\".\n\nThe music video for the song features Rimes singing solo in a minimally furnished, abandoned house. The first 2/3's of the video features Rimes in a tan and white shirt with tan leather pants while in the darkness lit by a spotlight that travels across the room in the background while different colored leaves are billowing about. There are close-up shots of her face as she’s singing and various poses of her swaying, moving and dancing to the song. After the second verse the spotlight stops in her midsection and the scenes are flooded with light. Then her outfit changes to white but she and the music video continue as before. The video was directed by Joe Rey. On July 22, 2014, as a promotion for her Dance Like You Don't Give a.... Greatest Hits Remixes (2014) album, Rimes released the Digital Dog remix of the music video.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/sptsqx1486822943.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=AA_5sLaTErQ", "strMusicVidDirector": "Joe Rey", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "3700355", "intMusicVidLikes": "16413", "intMusicVidDislikes": "456", "intMusicVidFavorites": "0", "intMusicVidComments": "1073", "intTrackNumber": "2", "intLoved": "1", "intScore": "9.75", "intScoreVotes": "4", "intTotalListeners": "69549", "intTotalPlays": "276713", "strMusicBrainzID": "9e2a8fc1-8598-4fd2-b878-5d41960db68e", "strMusicBrainzAlbumID": "2e093129-eaec-309d-9513-7309d6c3118e", "strMusicBrainzArtistID": "9092d8e1-9b38-4372-a96d-000b8561a8bc", "strLocked": "Unlocked"}]}