{"track": [{"idTrack": "32796618", "idAlbum": "2116150", "idArtist": "112068", "idLyric": "503364", "idIMVDB": null, "strTrack": "Meet Virginia", "strAlbum": "Train", "strArtist": "Train", "strArtistAlternate": null, "intCD": null, "intDuration": "240200", "strGenre": "Pop-Rock", "strMood": "Gritty", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Meet Virginia\" is a song written and recorded by American roots rock band Train. It was released in 1999 as the second single from their eponymous first album, Train. The song reached a peak of number 20 on the Billboard Hot 100 chart in January 2000, becoming their first top-20 hit and their first single to chart on the Hot 100. It also reached the top 20 in Canada, peaking at number 15 on the RPM Top Singles chart.\n\nBackground\nWhen asked whether the girl in the song was real or imaginary, Train's Twitter page said, \"She's real parts of real woman  that make up a woman that I've always wanted to meet\".\n\nSinger Patrick Monahan added that one of the women who inspired the song was bassist Charlie Colin's girlfriend. One day, Train was playing pickup softball with some members of Counting Crows, another Bay area band. Charlie's girlfriend came over from a wedding shower still wearing a long dress and high heels, and proceeded to play shortstop for Train's team. This inspired the line, \"Wears high heels when she exercises\".\n\nReception\nRoxanne Blanford of Allmusic says \"Meet Virginia\" is one of a few songs from the album Train that has \"inspired hooks and reflective lyrics\". Christa L. Titus, of Billboard magazine in her review of their second album, called the song an \"ode to a wrong-side-of-the-tracks girl full of quirky contradictions.\"\n\nMusic video\n\"Meet Virginia\" has a music video that takes place inside a diner and stars actress Rebecca Gayheart. The video was shot at the Merritt Bakery and Restaurant in Oakland, California. Located on the south-western shore of Lake Merritt at 203 East 18th Street. The restaurant closed after a fire in 2016.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "https://www.youtube.com/watch?v=A3Qvb7q9Nm0", "strMusicVidDirector": "Luke Scott", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "11712865", "intMusicVidLikes": "73333", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "1647", "intTrackNumber": "1", "intLoved": "6", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "274944", "intTotalPlays": "1056706", "strMusicBrainzID": "8aaaafcb-383f-4267-925b-8f2d0fea24ee", "strMusicBrainzAlbumID": "cc9eea3f-db80-3579-9499-146e38b0d514", "strMusicBrainzArtistID": "bfd5aec5-62a2-4560-a316-7c46c17babda", "strLocked": "Unlocked"}]}