{"track": [{"idTrack": "32759160", "idAlbum": "2113067", "idArtist": "111507", "idLyric": "410905", "idIMVDB": "0", "strTrack": "Otherside", "strAlbum": "Californication", "strArtist": "Red Hot Chili Peppers", "strArtistAlternate": "RHCP", "intCD": null, "intDuration": "256000", "strGenre": "Alternative Rock", "strMood": "Moody", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Otherside\" is a song by the Red Hot Chili Peppers, released in 2000. It was the third single from their album Californication, and confronts the battles addicts have with their prior addictions. The single was highly successful peaking at number 14 on the Billboard Hot 100, the fourth highest ever for the band; and number one on the US Modern Rock Tracks, which was, at the time, the fifth for the band. The song remained at number one on this chart for 13 consecutive weeks, one of the longest runs at the top of that chart.\n\n\"Otherside\" has remained a constant staple on the band's tours since 1999, making it one of their top ten most performed songs.\n\nThis song refers to one of the band members, Hillel Slovak who died of a heroin overdose on June 25, 1988. This song talks about his struggles from this addiction. The name of the song, \"Otherside\", is also used to say \"afterlife\".\n\nAlthough it is sung by Anthony Kiedis, it is supposed to be Slovak's voice and his perspective towards the situation. This song talks about how Slovak knows how much the drug has affected him and how he must kill himself to end his addiction. This song also shows his struggles to end this addiction by saying, \"I yell and tell it (drugs) that it's not my friend; I tear it down tear it down, and then it's born again.\" His constant struggle is also shown in the music video which shows a man waking up and then finding himself in the same position at the end of the video which means that it is a cycle that never changes and that never will change. The video also shows his struggles by having a scene where the man (Slovak) is fighting against his shadow which shows that he was initially fighting with himself due to the addiction.\n\nThe music video has also been interpreted differently in the past; some sources speculate that the beginning and end scene are one and the same, and that the events between them are flashbacks outlining the protagonist's (Slovak's) journey to this state.\n\nThis song is not only a commentary of Slovak's struggles but also demonstrative of the adverse effects of drug use as a whole.\n\nThe video was directed by Jonathan Dayton and Valerie Faris in a black-and-white/monochrome Gothic style similar to Robert Wiene's The Cabinet of Dr. Caligari, all influenced by German Expressionist art. Elements of Cubism and work by the graphic artist M. C. Escher are also seen in the video.\n\nA cartoonish story line is juxtaposed upon the song; that of a young man's dream sequence. The band members appear dressed in black in unusual locations, with props intended to appear as surreal instruments. Throughout the video Anthony Kiedis with short, platinum hair is seen in a castle tower. His stage persona is different and quite dark when compared to his more energetic performances in other videos. John Frusciante plays a rope down a long corridor as if a guitar. Flea is hanging on high voltage wires and playing them as if they were a bass guitar, and Chad Smith is up on a tower with a rotating medieval clock that serves as his drum kit.\n\nJonathan Dayton: \"We did look at Caligari, and we looked at a lot of German Expressionist film. But it was also very important to avoid 'Caligari.' It was both inspiration and something to work around, because it has such a strong, specific style, and there have been other videos that have completely ripped it off.\"\n\nValerie Faris: \"We didn't look at 'Calagari' all that much, really. We did, but then we just left it. We did look at a lot of the works of the futurist artists from the '30s, and the illustrations of the surrealists and from cubism. We were inspired more by paintings than by films…\"", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=rn_YodiJO6k", "strMusicVidDirector": "Jonathan Dayton", "strMusicVidCompany": "Bob Industries", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "147002730", "intMusicVidLikes": "598852", "intMusicVidDislikes": "11449", "intMusicVidFavorites": "0", "intMusicVidComments": "27644", "intTrackNumber": "4", "intLoved": "1", "intScore": "9", "intScoreVotes": "2", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "7a3e8796-a0b3-4999-b268-4e2d47912e3c", "strMusicBrainzAlbumID": "ca5dfcc3-83fb-3eee-9061-c27296b77b2c", "strMusicBrainzArtistID": "8bfac288-ccc5-448d-9573-c33ea2aa5c30", "strLocked": "Unlocked"}]}