{"track": [{"idTrack": "32742464", "idAlbum": "2111405", "idArtist": "111364", "idLyric": "95511", "idIMVDB": null, "strTrack": "What a Girl Wants", "strAlbum": "Christina Aguilera", "strArtist": "Christina Aguilera", "strArtistAlternate": null, "intCD": null, "intDuration": "233000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"What a Girl Wants\" is a song by American recording artist Christina Aguilera from her debut studio album Christina Aguilera. The single was released after strong commercial interest in her first single \"Genie in a Bottle\" and came at a time when Aguilera was becoming increasingly dissatisfied with her input into her career. The song was written by Shelly Peiken and Guy Roche, the two were improvising with a cassette recorder and after improvising some of the songs lyrics Peiken decided to return to it at a later date. The song was completed and pitched to Ron Fair of RCA under the name of \"What a Girl Needs\" and after agreeing to change the title to \"What a Girl Wants\" Fair delivered the song to Aguilera to become the first track recorded for her debut album.\n\nThe song was released on November 28, 1999 as her second single after it was re-recorded. The song was described as a pop and R&B style track with similarities to her debut single \"Genie in a Bottle\", and her vocals were compared to that of singer Mariah Carey. The song received positive reviews from critics who described it as a \"light\" song. Commercially the song became a success becoming her second consecutive US number one single, in addition to topping charts in New Zealand and Spain. The single earned Gold certifications in countries such as Belgium and Sweden and became a top ten hit in the United Kingdom, Australia and Belgium (Flanders).\n\nA music video was released directed by Diane Martel who had also directed her previous video for \"Genie in a Bottle\". The video presented Aguilera dancing in a room with female friends whilst being viewed by their boyfriends and saw a scene of her dressed as a \"medieval style Princess\". In December 1999 the video reached pole position on the US music video chart TRL. Aguilera has performed the song at events such as the US Jingle Ball and the MTV New Year's Eve Special in 1999.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/syprux1359161608.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=hpspGHeLOPE", "strMusicVidDirector": "Diane Martel", "strMusicVidCompany": "X-Ray Productions", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "16168038", "intMusicVidLikes": "36543", "intMusicVidDislikes": "916", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": "275859", "intTotalPlays": "1213987", "strMusicBrainzID": "6002e85b-46e0-453c-9ef6-12fb383fabfb", "strMusicBrainzAlbumID": "6f47450a-6f77-3af2-80bb-4e7012c07180", "strMusicBrainzArtistID": "b202beb7-99bd-47e7-8b72-195c8d72ebdd", "strLocked": "Unlocked"}]}