{"track": [{"idTrack": "34830315", "idAlbum": "2283541", "idArtist": "143553", "idLyric": null, "idIMVDB": null, "strTrack": "New Rules", "strAlbum": "Dua Lipa", "strArtist": "Dua Lipa", "strArtistAlternate": null, "intCD": null, "intDuration": "212000", "strGenre": "Pop", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"New Rules\" is a song by English singer Dua Lipa from her eponymous debut studio album (2017). The song was written by Caroline Ailin, Emily Warren and Ian Kirkpatrick, and produced by the latter. It was released to contemporary hit radio in the United Kingdom on 21 July 2017 as the album's seventh single. The song's music video was released on 7 July 2017.\n\n\"New Rules\" was written by Caroline Ailin, Emily Warren and its producer Ian Kirkpatrick. It was included in Dua Lipa's self-titled studio album, released in 2017. Lipa worked on the record during three years, stating that the extended process lead her to write and record songs until she felt she had a considerable amount to pick from. Kirkpatrick also engineered and programmed the track, while Chris Gehringer mastered it and Josh Gudwin mixed it. Talking about the song, the artist explained that, \"'New Rules' is quite different to a lot of tracks on the album. I wanted it to feel very new  It's the breakup song that I wish I had when I was breaking up with someone. It sets rules that, these are the rules that I'm going to set for myself. This is me taking charge\".\n\n\"New Rules\" has been described as a tropical house, dance, electropop, bashment and pop song, featuring a drum and horn instrumentation. In the lyrics, the singer sets a list of rules that prevent her from getting back together with a \"bad\" ex-boyfriend. The rules are: \"One: Don't pick up the phone, you know he's only calling 'cause he's drunk and alone. Two: Don't let him in, you'll have to kick him out again. Three: Don't be his friend, you're only going to wake up in his bed in the morning.\" Lipa confessed in an interview with NPR that: \"They're not necessarily rules I've been able to stick by. But  rules that I feel like it's important to be able to tell yourself, to tell your friends... There's a reason people break up, and it's probably the same reason why you shouldn't get back together.\" Songwriter Emily Warren explained through an annotation on website Genius that the track was a self-reminder for people recovering from a break-up to not succumb to a momentary temptation since it is not \"a good idea in the long term\".", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vtuvsu1502356424.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=k2qgadSvNyU", "strMusicVidDirector": "Henry Scholfield", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/qywxss1529934430.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/ryxvvp1529934437.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/rqxxyy1529934501.jpg", "intMusicVidViews": "2336310487", "intMusicVidLikes": "13467913", "intMusicVidDislikes": "606217", "intMusicVidFavorites": "0", "intMusicVidComments": "352131", "intTrackNumber": "10", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "378634", "intTotalPlays": "4875700", "strMusicBrainzID": "76ac63ee-9b00-4f70-b443-1c0c3bd1e445", "strMusicBrainzAlbumID": "93747376-b698-4610-a023-d256de075460", "strMusicBrainzArtistID": "6f1a58bf-9b1b-49cf-a44a-6cefad7ae04f", "strLocked": "Unlocked"}]}