{"track": [{"idTrack": "35037644", "idAlbum": "2304553", "idArtist": "112356", "idLyric": null, "idIMVDB": "2147483647", "strTrack": "No Brainer", "strAlbum": "No Brainer", "strArtist": "DJ Khaled", "strArtistAlternate": null, "intCD": null, "intDuration": "260000", "strGenre": "Hip-Hop", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"No Brainer\" is a song by by American musician DJ Khaled featuring vocals from Canadian singer Justin Bieber and American rappers Chance the Rapper and Quavo. The song was released on July 27, 2018 by We the Best Music Group and Epic Records. The track is the second single off Khaled’s upcoming eleventh studio album Father of Asahd (2018). It marks the second collaboration between Khaled, Bieber, Chance the Rapper, and Quavo, following “I'm the One” off his 2017 album Grateful, which also featured Lil Wayne. It was produced by Davidor alongside Sir Nolan, Nic Nac and Poo Bear.\n\nBackground and release\nIn early July, DJ Khaled shared plans for his song, inspired by his vacation to Cabo San Lucas. “I’m gonna make my own soap,” he said. “So I’m here to announce today—and this is crazy that we’re talking about this—I’m gonna make my own soap.” He also revealed, \"I got a song coming out with Justin Bieber and some more of my great friends on the record. I want it to be a surprise, but it's going to be one of the biggest anthems.\", referencing their previous collaboration on I'm the One from his previous studio album Grateful a year prior. In a series of teasers on Instagram, he gradually rolled out the news. In one video, Justin and his manager, Scooter Braun, joined in and showcased their southern accents. “We’ve always been the best and always will be the best. That’s a statement and a half,” Bieber teased.\n\nMusic video\nThe official music video was released to YouTube on 27 July 2018, just an hour after the song's release. The video begins on the set of a movie in Hollywood with \"We The Best\" replacing the typical white Hollywood Sign. Bieber helms the director chair alongside Khaled and Asahd. One scene is absolutely oozing with Wayne's World vibes as Khaled and Justin stand atop the faux clouds. Product placement is heavily displayed throughout the blockbuster, boasting different liquors from Bumbu to Ciroc and Belaire. Quavo injects himself into the colorful scene taking on the role of an artist, meticulously painting away at his blank canvas with a parrot mysteriously chilling out on his shoulder. Chance is the last of the co-stars to make an appearance, and the setting immediately switches to a Gatsby-themed party, as the squad dances the night away.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rwrxqt1533068170.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=kxloC1MKTpg", "strMusicVidDirector": "Colin Tilley", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "121866155", "intMusicVidLikes": "1922845", "intMusicVidDislikes": "125315", "intMusicVidFavorites": "0", "intMusicVidComments": "150974", "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": "84631", "intTotalPlays": "450529", "strMusicBrainzID": "0da1a8b4-ae3e-46d2-81a3-79ead164f786", "strMusicBrainzAlbumID": "349cd353-a4b9-485d-a48a-c4e4d48f4499", "strMusicBrainzArtistID": "081a2d60-9791-4e05-a075-f1890355eeee", "strLocked": "Unlocked"}]}