{"track": [{"idTrack": "34775377", "idAlbum": "2277991", "idArtist": "111611", "idLyric": null, "idIMVDB": null, "strTrack": "Shape of You", "strAlbum": "÷", "strArtist": "Ed Sheeran", "strArtistAlternate": null, "intCD": null, "intDuration": "233720", "strGenre": "Pop", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"Shape of You\" is a song by English singer-songwriter Ed Sheeran. It was released as a digital download on 6 January 2017 as one of the lead singles from his third studio album ÷ (2017), along with \"Castle on the Hill\".\n\nOn 4 January 2017, Sheeran uploaded a six-second teaser video of a blue background to social media, with lyrics \"the club isn't the best place to find a lover\", which is the first line of \"Shape of You\". On 6 January 2017, when hosting The Radio 1 Breakfast Show, Sheeran revealed that \"Shape of You\" had originally been written with Rihanna in mind. He said:\n\n\" is actually a really random one because I went in to write songs for other people with a guy called Steve Mac and Johnny McDaid, and we were writing this song and I was like 'this would really work for Rihanna,'\" he explained. \"And then I started singing lyrics like 'putting Van The Man on the jukebox' and I was like 'well she's not really going to sing that, is she?' And then we sort of decided halfway through that we were just going to make it for me.\"\n\nHe continued, \"This was the last song that was finished, and I just didn't put two and two together that this was even going to be on the album. I just kind of wrote it and was like 'oh, that was fun.'\"\n\nThe official remix of \"Shape of You\" features newly additional verses and guest vocals by English grime artist Stormzy. The remix premiered during Sheeran and Stormzy's live collaboration at the 2017 Brit Awards at The O2 in London on 22 February 2017. Sheeran announced on Twitter that the remix would be released officially on 24 February 2017. On the same date, various remixes of the song were released on digital music services. Sheeran teased the releases ahead of 2017 Brit Awards ceremony. \"I've got two things dropping on Friday that are pretty interesting,\" he revealed in a BBC Radio 1 interview just hours before the big show. \"One that gets debuted at the Brits, which I think people will go a bit nuts for.” He added, “It's something that I think nobody is expecting. I think it'll be decent.” The Stormzy remix reached No. 1 on The Vodafone Big Top 40. Remixes by Galantis and Major Lazer were also released, the latter of these featuring guest vocals by Jamaican reggae artists Nyla and Kranium, who had both collaborated with Lazer in the past.\n\n\"Shape of You\" is a pop and dancehall song with \"tropical house effects and strummy acoustics.\" In the song, Sheeran sings over a marimba-fueled percussive sway about a budding romance. \"The club isn't the best place to find a lover, so the bar is where I go/ Me and my friends at the table doing shots drinking fast and then we talk slow,\" he sings. \"Come over and start up a conversation with just me/ And trust me I'll give it a chance.\" According to NT News, the song \"tells the story of loved (or lusted) up Sheeran meeting a girl in a bar where he and his mates are doing shots.\" \"Shape of You\" written in the key of C♯ minor with a tempo of 96 beats per minute. The song is composed in the time signature of common time, and follows a basic chord progression of C♯m–F♯m–A–B, and Sheeran's vocals span from G♯3 to G♯5.\n\nTo accompany the song's release, a lyric video for \"Shape of You\" was released on Sheeran's YouTube channel. As of 23 February 2017, the video has amassed over 314 million views in a period of 52 days, making the video one of the fastest to reach both 100 and 300 million views. The video was directed by Charlotte Audrey.\n\nOn 30 January 2017, the song's official music video, starring British boxer Jennie Pegouskie and retired professional sumo wrestler Yamamotoyama Ryūta, was released on Sheeran's channel. It was shot on location in Seattle, and was directed by Jason Koenig. As of 3 March 2017, the video has amassed over 250 million views. Moreover, the lyric video has reached 370 million views.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/tsvtxs1488799563.jpg", "strTrack3DCase": null, "strTrackLyrics": "The club isn't the best place to find a lover\nSo the bar is where I go\nMe and my friends at the table doing shots\nDrinking fast and then we talk slow\nCome over and start up a conversation with just me\nAnd trust me I'll give it a chance now\nTake my hand, stop, put Van the Man on the jukebox\nAnd then we start to dance, and now I'm singing like\nGirl, you know I want your love\nYour love was handmade for somebody like me\nCome on now, follow my lead\nI may be crazy, don't mind me\nSay, boy, let's not talk too much\nGrab on my waist and put that body on me\nCome on now, follow my lead\nCome, come on now, follow my lead\nI'm in love with the shape of you\nWe push and pull like a magnet do\nAlthough my heart is falling too\nI'm in love with your body\nAnd last night you were in my room\nAnd now my bedsheets smell like you\nEvery day discovering something brand new\nI'm in love with your body\nOh—I—oh—I—oh—I—oh—I\nI'm in love with your body\nOh—I—oh—I—oh—I—oh—I\nI'm in love with your body\nOh—I—oh—I—oh—I—oh—I\nI'm in love with your body\nEvery day discovering something brand new\nI'm in love with the shape of you\nOne week in we let the story begin\nWe're going out on our first date\nYou and me are thrifty, so go all you can eat\nFill up your bag and I fill up a plate\nWe talk for hours and hours about the sweet and the sour\nAnd how your family is doing okay\nLeave and get in a taxi, then kiss in the backseat\nTell the driver make the radio play, and I'm singing like\nGirl, you know I want your love\nYour love was handmade for somebody like me\nCome on now, follow my lead\nI may be crazy, don't mind me\nSay, boy, let's not talk too much\nGrab on my waist and put that body on me\nCome on now, follow my lead\nCome, come on now, follow my lead\nI'm in love with the shape of you\nWe push and pull like a magnet do\nAlthough my heart is falling too\nI'm in love with your body\nAnd last night you were in my room\nAnd now my bedsheets smell like you\nEvery day discovering something brand new\nI'm in love with your body\nOh—I—oh—I—oh—I—oh—I\nI'm in love with your body\nOh—I—oh—I—oh—I—oh—I\nI'm in love with your body\nOh—I—oh—I—oh—I—oh—I\nI'm in love with your body\nEvery day discovering something brand new\nI'm in love with the shape of you\nCome on, be my baby, come on\nCome on, be my baby, come on\nCome on, be my baby, come on\nCome on, be my baby, come on\nCome on, be my baby, come on\nCome on, be my baby, come on\nCome on, be my baby, come on\nCome on, be my baby, come on\nI'm in love with the shape of you\nWe push and pull like a magnet do\nAlthough my heart is falling too\nI'm in love with your body\nLast night you were in my room\nAnd now my bedsheets smell like you\nEvery day discovering something brand new\nI'm in love with your body\nCome on, be my baby, come on\nCome on, be my baby, come on\nI'm in love with your body\nCome on, be my baby, come on\nCome on, be my baby, come on\nI'm in love with your body\nCome on, be my baby, come on\nCome on, be my baby, come on\nI'm in love with your body\nEvery day discovering something brand new\nI'm in love with the shape of you", "strMusicVid": "https://www.youtube.com/watch?v=JGwWNGJdvx8", "strMusicVidDirector": "Jason Koenig", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/rpxtxy1529928304.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/ysxwrs1529928351.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/uusuqu1529928359.jpg", "intMusicVidViews": "6077820639", "intMusicVidLikes": "31984671", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "1141073", "intTrackNumber": "4", "intLoved": "0", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "468911", "intTotalPlays": "5156245", "strMusicBrainzID": "d7500dd6-b815-4299-88c6-3fbda358f1fc", "strMusicBrainzAlbumID": "e05f9927-e24b-41c5-928d-d0e008a12444", "strMusicBrainzArtistID": "b8a7c51f-362c-4dcb-a259-bc6e0095f0a6", "strLocked": "Unlocked"}]}