{"track": [{"idTrack": "32780535", "idAlbum": "2114807", "idArtist": "111828", "idLyric": "271688", "idIMVDB": null, "strTrack": "Because of You", "strAlbum": "Breakaway", "strArtist": "Kelly Clarkson", "strArtistAlternate": null, "intCD": null, "intDuration": "219613", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Because of You\" is a song recorded by American singer Kelly Clarkson for her second studio album, Breakaway (2004). It was written by Clarkson along with its producers David Hodges and Ben Moody. It was released on August 16, 2005 by RCA Records, as the third single from Breakaway. Clarkson originally wrote \"Because of You\" when she was 16 years old to cope with the emotional distress caused by her parents' divorce. She wanted the song to be included on her debut studio album, Thankful (2003), but her record label thought that it was not suitable to be included in the album. She then polished the song with Hodges and Moody before successfully convincing her label to include it on Breakaway.\n\nLyrically, \"Because of You\" explores the pain of a deteriorating relationship. Critics noted that the lyrics are Clarkson's ode to her father. The song begins with a piano-led melody and as it launches into the chorus, the sound of a roaring guitar becomes apparent. Critically, \"Because of You\" garnered positive reviews by music critics, who praised its expressive lyrics, creative arrangement and Clarkson's vocal prowess. It became Clarkson's most successful single around the world; in the United States, it peaked at number seven on the Billboard Hot 100 and sold over 1.5 million digital downloads. It was certified platinum by the Recording Industry Association of America (RIAA). Internationally, \"Because of You\" topped the charts in the Netherlands, Denmark and Switzerland as well as reaching the top ten in Australia, Austria, Canada, Germany, Belgium, Hungary, Ireland, and the United Kingdom.\n\nThe song's accompanying music video was directed by Vadim Perelman. Clarkson wrote the treatment for the video herself in order to reflect the pain that she felt due to her parents' divorce. The video's plot centers on Clarkson engaging in a heated argument with her husband in front of her child before realizing that she was repeating her parents' mistake. It won in the category for Best Female Video at the 2006 MTV Video Music Awards. \"Because of You\" was performed live at numerous venues, including the My December Tour (2007) as well as the All I Ever Wanted Tour (2009). It was covered by several artists including Ronan Parke, who is a runner-up in the fifth series of Britain's Got Talent. In 2007, the song was recorded by Reba McEntire as a duet with Clarkson, which was released as a lead single for McEntire's album Reba: Duets.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rvqvvs1383078553.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=Ra-Om7UMSJc", "strMusicVidDirector": "Vadim Perelman", "strMusicVidCompany": "Tate USA", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/rxpvwp1383084116.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/urvwpx1383084278.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/rwyquy1383084375.jpg", "intMusicVidViews": "91898452", "intMusicVidLikes": "373185", "intMusicVidDislikes": "6007", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "4", "intLoved": "2", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "678659", "intTotalPlays": "4150477", "strMusicBrainzID": "0181b0f1-93c1-4495-b5fa-52b6549c9e96", "strMusicBrainzAlbumID": "0d0ddce6-a611-3dc0-923c-60ac3da72ad8", "strMusicBrainzArtistID": "d339efbb-77b9-4147-ba9e-59f2f24550b2", "strLocked": "Unlocked"}]}