{"track": [{"idTrack": "32778212", "idAlbum": "2114642", "idArtist": "111786", "idLyric": "198109", "idIMVDB": "0", "strTrack": "Crazy", "strAlbum": "St. Elsewhere", "strArtist": "Gnarls Barkley", "strArtistAlternate": null, "intCD": null, "intDuration": "180400", "strGenre": "Soul", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Crazy\" is the debut single by Gnarls Barkley, a musical collaboration between Danger Mouse and CeeLo Green, taken from their 2006 debut album St. Elsewhere. It peaked at number two on the Billboard Hot 100, and topped the charts in the United Kingdom, Denmark, Canada, the Republic of Ireland, New Zealand and other countries.\n\nThe song was leaked in late 2005, months before its regular release, and consequently received massive airplay on BBC Radio 1 in the United Kingdom, most notably by radio DJ Zane Lowe, who also used the song in television commercials for his show. When it was finally released in March 2006, it became the first single to top the UK Singles Chart on download sales alone. The song remained at the top of the British charts for nine weeks (which no other song had achieved in over ten years, and was only surpassed by Rihanna's \"Umbrella\" in July 2007) before the band and their record company decided to remove the single from music stores in the country so people would \"remember the song fondly and not get sick of it.\" In spite of this deletion, the song became best-selling single of 2006 in the UK. Due to continued download sales, it reached a million sales in January 2011.\n\nThe song won a Grammy Award for Best Urban/Alternative Performance in 2007, and was also nominated for The Record of the Year in the United Kingdom, which it lost to \"Patience\" by Take That. It was also nominated and further won a 2006 MTV Europe Music Award for Best Song. The song was also named the best song of 2006 by Rolling Stone and by the Village Voice's annual Pazz & Jop critics poll. The song was listed at #11 on Pitchfork Media's top 500 songs of the 2000s. The song is also in the #45 place in the list of the best songs ever of Acclaimed Music. In 2010, it was placed at #100 in the \"updated\" version of Rolling Stone '​s list of \"The 500 Greatest Songs of All Time\" and ranked at the top position of Rolling Stone '​s top 100 songs of the decade (2000–2009). \"Crazy\" was notably performed at the 2006 MTV Movie Awards, with the band members dressed as various Star Wars characters.\n\nThere are two different music videos for this song.\n\nGoing along with the psychiatric theme of the song, Gnarls Barkley's music video for \"Crazy\" is done in the style of the Rorschach inkblot test. Animated, mirrored inkblots morph into another, while taking on ambiguous shapes. Both Cee-Lo and Danger Mouse appear in the shapes, as do the band's gunshot/heart logo, \"Satan\", a cranium and various animals, including centipedes, birds, bats, spiders, and insects.\n\nThe inkblot illustrations were done by art director and motion graphic designer Bryan Louie, whose other works include commercial campaigns for the Scion tC, and produced by motion design studio Blind, Inc. The music video for \"Crazy\" was directed by Robert Hales, who had previously directed music videos for Jet, Nine Inch Nails and Richard Ashcroft, amongst others.\n\nThe video was nominated for three 2006 MTV Video Music Awards: Best Group Video, Best Direction, and Best Editing, and won the latter two. It was also nominated for a 2006 MTV Europe Music Award for Best Video, but lost to \"We Are Your Friends\" by Justice vs. Simian.\n\nBefore the final music video was finished, the band's UK label released a different video to media outlets such as the BBC. This early promo, directed by Mina Song, is also completely animated and features several symbols from many cultures and religions that appear in a disjointed harmony to the lyrics. Lyrics of the song, and again the band's gunshot/heart logo also appear prominently. The video also includes elements of the single's cover art.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=bd2B6SjMh_w", "strMusicVidDirector": "Robert Hales", "strMusicVidCompany": "HSI Productions", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "53436178", "intMusicVidLikes": "259985", "intMusicVidDislikes": "4626", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "1164797", "intTotalPlays": "7811615", "strMusicBrainzID": "a5d1633c-127d-424b-a1e1-9168b9f77832", "strMusicBrainzAlbumID": "3c47e22a-82a6-3e49-baf8-70519b6097b7", "strMusicBrainzArtistID": "a47c3aa2-7d87-475c-a2c7-1e2047dafb09", "strLocked": "Unlocked"}]}