{"track": [{"idTrack": "33040817", "idAlbum": "2135827", "idArtist": "115258", "idLyric": "91316", "idIMVDB": null, "strTrack": "Do It to It", "strAlbum": "Unappreciated", "strArtist": "Cherish", "strArtistAlternate": null, "intCD": null, "intDuration": "226000", "strGenre": "", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "Cherish is an R&B vocal group from Atlanta, Georgia founded by Farrah, Neosha, Felisha and Fallon King (Felisha and Fallon are twins). Farrah and Neosha left the group in 2009, leaving them as a duo. This crunk track is their biggest hit.\nThe song features Sean P of the Southern hip-hop duo Youngbloodz. Like Cherish, Sean P hails from Atlanta and the five are proud to represent their hometown.\n\nNo need to ask where I'm from, you already know\nI represent the \"A\" from my head to my toes\nThe Jazze-Pha-founded label Sho'nuff Records released the song as Cherish's lead single from Unappreciated. The group's debut album, it debuted at #5 on the Billboard 200 and was certified Platinum by the RIAA for shipping one million units to stores.\nDon Vito produced the track. Critics compared his production to the tracks Jazze Pha produced for Ciara's Goodies album, including the hit single \"1, 2 Step.\"\nThe song features on the soundtrack of the 2006 American coming-of-age comedy-drama film, ATL.\nOrlando-based DJ and producer Acraze released a rework on August 20, 2021. Credited to \"Acraze featuring Cherish,\" it features a sample of Cherish's vocals laid over his sultry house production. His version peaked at #9 in the UK and #12 in the US.\nGerman-Russian DJ and producer Zedd created a remix of Acraze's version by mashing it up with the theme song of Netflix's hit series Squid Game.\nThe genesis of Acraze's house reworking occurred in bed one morning. While watching Instagram stories, the Florida DJ saw a clip in which a friend flaunted her new car with \"Do It To It\" playing as a backing track. \"I was like, 'Wait, this could be sick!'\" he recalled to Billboard.\n\nAcraze switched on his computer and within an hour had produced a rough house edit of Cherish's song with added drums and pitched-down vocals. After he debuted his version of \"Do It To It\" at a 2021 New Year's Eve show, it immediately garnered interest from other DJs.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/s2cg0x1670599383.jpg", "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "https://www.youtube.com/watch?v=dPCS68n0s2I", "strMusicVidDirector": "Benny Boom", "strMusicVidCompany": "FM Rocks", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "16565748", "intMusicVidLikes": "192772", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "4997", "intTrackNumber": "2", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": "21507", "intTotalPlays": "104798", "strMusicBrainzID": "5c4589ca-c205-4d5d-842a-d9ee881ba8d8", "strMusicBrainzAlbumID": "aa2f4db0-39c2-3d3a-b239-6a47470540f1", "strMusicBrainzArtistID": "e82500a8-70ce-46ad-a028-b0690420d560", "strLocked": "Unlocked"}]}