{"track": [{"idTrack": "32832191", "idAlbum": "2118997", "idArtist": "111520", "idLyric": "353779", "idIMVDB": "2147483647", "strTrack": "Unwritten", "strAlbum": "Unwritten", "strArtist": "Natasha Bedingfield", "strArtistAlternate": null, "intCD": null, "intDuration": "255026", "strGenre": "Pop", "strMood": "...", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Unwritten\" is a song by English singer-songwriter Natasha Bedingfield for her debut studio album of the same name. It was released on 29 November 2004 as the third single from the record. The song was written by Bedingfield, Danielle Brisebois, and Wayne Rodrigues and produced by Wayne Rodrigues and Danielle Brisebois. The single was released as the album's third UK single (November 2004) and second US single (September 2005). In 2006, \"Unwritten\" became the theme song for the reality television series The Hills. It reached number five on the Billboard Hot 100, becoming her first top-ten hit in the United States.\n\n\"Unwritten\" was the most played song on U.S. radio during 2006 as confirmed before her performance at the Diana concert, and as of March 2006, was certified platinum in the U.S. The song is Bedingfield's most successful single in the US, along with \"Pocketful of Sunshine\"; both songs peaked at number five on the Billboard Hot 100. The song earned Bedingfield a Grammy nomination in Grammy Award for Best Female Pop Vocal Performance at the 49th Grammy Awards but she lost to Christina Aguilera's \"Ain't No Other Man\".\n\nTwo different music videos were made for the promotion of the song: one was shot in 2004 in the UK to promote it internationally; the other one was shot in New York in 2006 to promote the single in North America. Both versions received airplay in Latin America.\n\nOriginal version\nIt was directed by Michael Gracey, shows Bedingfield as the cover of a small animated book in a large library as it climbs an amazingly large bookshelf. As it gets higher the shelf becomes more like a cliff, even snowing at the top. At the top the book sees a dove and falls off. As the small book is torn apart in the fall, people pick up the pages and look up into the sky. The video may be seen to elaborate the lyric as an oblique spiritual narrative of striving to ascend (and reach a heavenly dove), while the lyric also reflects Bedingfield's concerns at this time with the process of writing, concerns perhaps more clearly expressed in \"These Words\", another song featured on the \"Unwritten\" album.\n\nNorth American version\nIt was directed by Chris Applebaum, shows Bedingfield on an elevator, and as the elevator stops, she experiences new things in her life on some floors of the hotel building (singing with a church choir, seeing a couple kiss madly, watching a janitor throw away his money and watches, and blowing up a balloon in the hotel and the balloon explodes, comforting a goth who later grows happy and shares her joy with a man who comes in the elevator) Natasha is having a fiesta party in the hotel and writing Anonymous on the carpets and even finds a love interest, and putting the fireworks on inside the hotel (that stops with her in the first floor, with their end being \"unwritten\"). According to an TRL interview, Bedingfield chose to make a scene where she gets wet because while filming the North American version of her \"These Words\" video it was a very hot and sunny day in Rio de Janeiro. This scene occurs the second time Bedingfield sings \"Feel the rain on your skin.\" She and several children jump and dance as they are sprayed by water.\n\nLegacy\nBedingfield performed this song at the Concert for Diana. Natasha performed this, along with \"Pocketful of Sunshine\" in the season 7 finale of Degrassi: The Next Generation. It is the theme song to the globally popular MTV series, The Hills. Bedingfield later re-recorded another, slower version of \"Unwritten\" with production team Carney for use in the final episode of The Hills. \"Unwritten\" has been featured in the following motion pictures: Ice Princess, The Da Vinci Code, Because I Said So, and The Sisterhood of the Traveling Pants. 2006 World Champion figure skater Kimmie Meissner has done multiple exhibition programs to the song as well. The song appears in the video games Karaoke Revolution Presents: American Idol and Thrillville: Off the Rails. While the Johnny Vicious remix appears in Dance Dance Revolution SuperNova 2 along with its original video. The song was used for the 2006-2007 Pantene shampoo television and radio advertisements in English-speaking and other markets. The song is the theme for Ayla Besemer's video weblog, From the PilotHouse (about life on the ship Three@Sea). The song appears in the \"Running Around\" episode of Cold Case. This song was popularized and used in Pantene shampoo commercials in France, Spain, Poland, Indonesia, Malaysia and the Philippines. It is featured in the Pretty Little Liars season 5 finale \"Welcome to the Dollhouse\". It was also very popular at special events such as Graduations, Sweet 16s, and Weddings.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qvruyt1487960456.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=b7k0a5hYnSI", "strMusicVidDirector": "Chris Applebaum", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "52611619", "intMusicVidLikes": "220675", "intMusicVidDislikes": "4269", "intMusicVidFavorites": "0", "intMusicVidComments": "17006", "intTrackNumber": "3", "intLoved": "1", "intScore": "9.42857", "intScoreVotes": "7", "intTotalListeners": "577244", "intTotalPlays": "2866920", "strMusicBrainzID": "baef363a-3bb9-49be-bc53-e92b611b5e3a", "strMusicBrainzAlbumID": "46d21809-97f1-439a-8808-89fdaa2df540", "strMusicBrainzArtistID": "8b477559-946e-4ef2-9fe1-446cff8fdd79", "strLocked": "Unlocked"}]}