{"track": [{"idTrack": "32761336", "idAlbum": "2113252", "idArtist": "111534", "idLyric": "236451", "idIMVDB": "0", "strTrack": "You're Beautiful", "strAlbum": "Back to Bedlam", "strArtist": "James Blunt", "strArtistAlternate": null, "intCD": null, "intDuration": "213000", "strGenre": "Pop-Rock", "strMood": "Good Natured", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"You're Beautiful\" is a song co-written by the British singer James Blunt, Sacha Skarbek, and Amanda Ghost for Blunt's debut album, Back to Bedlam (2004). It was released as the third single from the album in 2005.\nIn the United Kingdom and Australia, the song reached number one and number two respectively. When released as the debut single from Back to Bedlam in Canada and the United States, it reached number one on both charts and received widespread airplay. In 2006, the song won an Ivor Novello Award for airplay. The song has sold 625,000 copies in the United Kingdom as stated by the Official Charts Company, and by October 2012 over three million in the United States. It remains Blunt's biggest hit single in the United States to date, and his only one to reach the top 40 of the Billboard Hot 100. In 2012, a new version of the single was issued in Japan. \nNewspapers have claimed that \"You're Beautiful\" is about a former girlfriend of Blunt's, Dixie Chassay, casting director for the Harry Potter films, although Blunt refuses to confirm nor deny this. On 8 March 2006 on The Oprah Winfrey Show, Blunt said of the song, \"It's kind of miserable. It was about seeing my ex-girlfriend on the Underground in London with her new man, who I didn't know existed. She and I caught eyes and lived a lifetime in that moment, but didn't do anything about it and haven't seen each other since.\" Several versions of the song exist. One lyrical version has an explicit word in it (\"She could see from my face that I was fucking high\") which was released on Back to Bedlam and most of the \"You're Beautiful\" singles. The radio edit of the song replaces the explicit lyric, changing it to \"She could see from my face that I was flying high\". Acoustic, live and DVD versions have also been released. However, because of the word in question, the album was given a Parental Advisory sticker. When asked about the song, Blunt responded, \"It's probably one of the least meaningful songs on the album and by no means people's favourite. The album is like a book covering various aspects of life in a specific order.\" In an interview with HitQuarters, co-writer Sacha Skarbek said their collaboration on the song began when Blunt brought the title and the approach of the chorus to a songwriting session. Skarbek's contribution largely focused on the music aspect to the track, contributing chord ideas for the verses, honing the melodies, and making sure the song stuck to, \"a couple of key hooks rather than making it too complicated\".\nIn the beginning of the song, Blunt sings the first line twice (\"My life is brilliant\"). The mistimed delivery was left in the final recording, but omitted in radio versions. This is parodied in \"Weird Al\" Yankovic's song \"You're Pitiful\": After the initial start, he says \"What, was I too early? Oh, sorry. Should I...Do you wanna start over? Or, keep going? Okay. Now? Now?\" and then begins the song.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rwswrq1517732618.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=oofSnsGkops", "strMusicVidDirector": "Sam Brown", "strMusicVidCompany": "Flynn Productions", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "201050826", "intMusicVidLikes": "1262579", "intMusicVidDislikes": "29205", "intMusicVidFavorites": "0", "intMusicVidComments": "64544", "intTrackNumber": "2", "intLoved": "1", "intScore": "9.57143", "intScoreVotes": "7", "intTotalListeners": "857006", "intTotalPlays": "5184756", "strMusicBrainzID": "407a1156-5f02-4038-8780-f8c7f5953862", "strMusicBrainzAlbumID": "aa0f8959-1f47-3f9d-9a7d-28de21ab3956", "strMusicBrainzArtistID": "ebee61b4-bbdd-4087-9bcb-d5aa099088ec", "strLocked": "Unlocked"}]}