{"track": [{"idTrack": "32971078", "idAlbum": "2130157", "idArtist": "111290", "idLyric": "91067", "idIMVDB": null, "strTrack": "Believe", "strAlbum": "Believe", "strArtist": "Cher", "strArtistAlternate": "Cherilyn Sarkisian LaPiere", "intCD": null, "intDuration": "240026", "strGenre": "Pop", "strMood": "Gritty", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Believe\" is a song recorded by American singer Cher for her 22nd album, Believe (1998), released by Warner Bros. Records. It was released as the lead single from the album on October 19, 1998. It was written by Brian Higgins, Stuart McLennen, Paul Barry, Steven Torch, Matthew Gray, Timothy Powell, and Cher, and was produced by Mark Taylor and Brian Rawling.\n\n\"Believe\" departed from Cher's pop rock style of the time for an upbeat dance-pop style. It featured a pioneering use of the audio processing software Auto-Tune to distort Cher's vocals, which became known as the \"Cher effect\". The lyrics describe empowerment and self-sufficiency after a painful breakup.\n\n\"Believe\" reached number one in the United States, the United Kingdom, France, Germany, Australia, Canada, Ireland, Scotland, New Zealand, Spain, Italy, Greece, Norway, Sweden, Denmark, Belgium, Hungary, Switzerland, Poland and the Netherlands. It earned Cher a place in the Guinness Book of World Records as the oldest female solo artist to top the Billboard Hot 100 chart, and became the highest-selling single by a solo female artist in the United Kingdom. It is one of the best-selling singles, with sales of over 11 million copies worldwide. Reviewers praised its production and catchiness and named it one of Cher's most important releases. It was nominated for the Grammy Award for Record of the Year and won Best Dance Recording.\n\nThe music video, directed by Nigel Dick, has Cher performing in a nightclub. Cher has performed the song a number of times, including four of her concert tours, most recently the Here We Go Again Tour in 2018. It has been covered by a number of artists, and has been featured in several elements of popular culture. Scholars and academics noted the way in which Cher was able to re-invent herself and remain fresh and contemporary amidst the more teen pop-based music of the period. They also credited \"Believe\" for restoring Cher's popularity and cementing her position as a pop culture icon.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rwruqr1483625669.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=nZXRV4MezEw", "strMusicVidDirector": "Nigel Dick", "strMusicVidCompany": "A Band Apart", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "339684702", "intMusicVidLikes": "1976525", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "51904", "intTrackNumber": "1", "intLoved": "0", "intScore": "9.6", "intScoreVotes": "5", "intTotalListeners": "507382", "intTotalPlays": "2535169", "strMusicBrainzID": "251f6d72-a1d9-4b9d-944a-2df9b26f6212", "strMusicBrainzAlbumID": "550fe869-84da-38af-8c7c-f7770ade37da", "strMusicBrainzArtistID": "bfcc6d75-a6a5-4bc6-8282-47aec8531818", "strLocked": "Unlocked"}]}