{"track": [{"idTrack": "32724295", "idAlbum": "2109624", "idArtist": "111240", "idLyric": "244098", "idIMVDB": "0", "strTrack": "If You Had My Love", "strAlbum": "On the 6", "strArtist": "Jennifer Lopez", "strArtistAlternate": null, "intCD": null, "intDuration": "265733", "strGenre": "Pop", "strMood": "In Love", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"If You Had My Love\" is the debut single by American actress and singer Jennifer Lopez. It was released on May 11, 1999 as the lead single from her debut album On the 6 (1999). The song was written by LaShawn Daniels, Cory Rooney, and its producer Rodney Jerkins. Michael Jackson had also showed interest in recording it, but he felt that it was better suited for a female singer. \"If You Had My Love\" is a midtempo pop and R&B song that also features Latin and hip hop influences. Its lyrics revolve around the beginning of a new relationship, during which Lopez confronts her admirer with a number of ground rules. \nCritics reacted positively to \"If You Had My Love\", praising its \"silky groove\" and \"edgy\" production. Upon its release, it generated instant attention and became a commercial success, peaking at number one on the US Billboard Hot 100 for five weeks. It became one of the best-selling singles of 1999, selling over 1.2 million units in the US alone. It was also an international success, topping the charts in Australia, Canada, Finland, Greece, Hungary and New Zealand. Its success came as a surprise to critics, making Lopez one of few actors to successfully crossover into the music industry. It also contributed to the growing popularity of Latin artists in Northern America. In retrospect, \"If You Had My Love\" has been described as an \"R&B classic\", and it is considered one of Lopez's best songs. \nThe song's accompanying music video (directed by Paul Hunter) features a voyeuristic internet concept, wherein Lopez's spectators are able to direct her through cyberspace. The provocative video received heavy rotation on MTV networks internationally, allowing Lopez to \"push the envelope\" in a field that was primarily dominated by Janet Jackson and Madonna. The clip was nominated for four MTV Video Music Awards and five Billboard Music Awards. Lopez promoted the song through performances at the Blockbuster Entertainment Awards and VH1/Vogue Fashion Awards in 1999. She has subsequently performed it on a number of occasions, including her Let's Get Loud concerts in 2001, and her Dance Again World Tour in 2012, where she performed an acoustic version of the song. It also serves as the opening number to her Las Vegas residency show, Jennifer Lopez: All I Have.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rrswss1558620691.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=lYfkl-HXfuU", "strMusicVidDirector": "Paul Hunter", "strMusicVidCompany": "Sony", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "99637955", "intMusicVidLikes": "275135", "intMusicVidDislikes": "12478", "intMusicVidFavorites": "0", "intMusicVidComments": "13469", "intTrackNumber": "1", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "333023", "intTotalPlays": "1164682", "strMusicBrainzID": "52ec5151-ab66-463f-b98a-dbbb04a34f13", "strMusicBrainzAlbumID": "b49f2176-899b-3262-9b08-0a2aa0f5fbd6", "strMusicBrainzArtistID": "f0602f55-1770-483d-89bd-4bae0d0ac086", "strLocked": "Unlocked"}]}