{"track": [{"idTrack": "32768065", "idAlbum": "2113811", "idArtist": "111314", "idLyric": "445179", "idIMVDB": null, "strTrack": "Man! I Feel Like a Woman!", "strAlbum": "Greatest Hits", "strArtist": "Shania Twain", "strArtistAlternate": "Eilleen Regina Edwards", "intCD": null, "intDuration": "233733", "strGenre": "Country", "strMood": "Bittersweet", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Man! I Feel Like a Woman!\" is a song by Canadian singer-songwriter Shania Twain from her third studio album, Come On Over (1997). Written by Twain and her longtime collaborator and then-husband Robert John \"Mutt\" Lange, who also produced the track, the song was released first to North American country radio stations in March 1999 as the eighth single from the album, and it was released worldwide later the same year. \"Man! I Feel Like a Woman!\" is a country pop song with lyrics about female empowerment.\n\nThe song received generally favorable reviews from music critics, who praised the song's attitude and hook as well as Twain's vocals. Commercially, the song was also successful, reaching the top-ten in six countries, while reaching the top-twenty in Canada and number 23 on the US Billboard Hot 100 chart. It was even more successful on the Hot Country Songs chart, reaching the top-five and was certified Platinum by the Recording Industry Association of America (RIAA) for 1,000,000 digital downloads. The song also won a Grammy for Best Female Country Vocal Performance in 2000.\n\nThe accompanying music video for \"Man! I Feel Like a Woman!\" was released on March 3, 1999, and it pays homage to Robert Palmer's \"Addicted to Love\" music video, featuring Twain dancing with buffed and blank-eyed male models. It was the opener on both the Come On Over and Up! tours, as well as Twain's headline on the Super Bowl XXXVII Halftime show, and as the closer on the rest of her tours. It was also used to comic effect in a 2004 Chevrolet Colorado TV commercial, as well as being on the soundtrack of Brazilian telenovela Laços de Família. The song was also performed by American Idol winner Carrie Underwood during the fourth season, and by Britney Spears in her first movie Crossroads (2002).\n\nThe title and thus the lyrics of the song were based on Shania Twain's experience while working at Deerhurst Resort in Huntsville, Ontario to provide for her brothers and sisters after their parents died in a car crash. Twain recalls seeing some drag performers working at the resort and credits them as the source of her inspiration. Later in 1993, after being signed to Mercury Nashville and releasing her first album Shania Twain, Twain met Robert John \"Mutt\" Lange, whom she would collaborate extensively with and marry at the end of the year. In 1994, while composing songs for what would become her second studio album The Woman in Me, Lange played to Twain a riff he had been working on and Twain sang lyrics for what would become \"Man! I Feel Like a Woman!\". Speaking of the writing of the song, she stated \"There was no time to waste on ideas that wouldn't make the album, but something like  was just there. I was inspired right off the bat with that one, for example, by a riff Mutt had going, and the lyrics and phrasing just came out of the blue.\"\n\nAfter reaching domestic success in the United States, and selling over fifteen million copies with The Woman in Me, Twain was determined to become an international star and decided to do whatever was necessary to achieve her goal. In order to achieve a worldwide success, Twain recorded her third studio album, Come On Over, with the intention of being \"international\". After completing the album and delivering it to Mercury Records, Lange spent four months remixing 70 percent of the album for its international edition, diluting and removing the twang elements. While writing for the album, Twain and Lange revisited \"Man! I Feel Like a Woman!\" and insisted on having the track on the album. The track was then the final song recorded for Come On Over. The song is the opening track of the U.S. edition of Come On Over, however, the international edition starts with \"You're Still the One\", since the song has country elements. Initially, \"Man! I Feel Like a Woman!\" was only released to country radio as the album's seventh single in the United States in March 1999. After the song's success there, it was eventually released to mainstream radio in the U.S. In the United Kingdom, the song was issued as a CD single and cassette single on September 20, 1999.\n\nThe music video for \"Man! I Feel Like a Woman!\" was shot in New York City and directed by Paul Boyd. It debuted on March 3, 1999, on CMT. The video is a role-reversed version of Robert Palmer's \"Addicted to Love\" and \"Simply Irresistible\" music videos. In the music video, Twain stands in front of a group of men, all dressed alike, one playing electric guitar, one playing bass, one playing drums, one playing the two neck guitar, and one playing keyboard, complete with buffed and blank-eye, meant to imitate the women from Palmer's videos. Twain starts the video dressed in a long coat and a veiled top hat, white dress shirt, black tie, but throughout the video she strips off items of clothing until she is left wearing a black corset, mini skirt, thigh-high boots, a black choker, and black gloves. Twain even has black eyeshadow on. \n\nThe video won the MuchMoreMusic Video of the Year award at the MuchMusic Video Awards in 2000. The video uses the 'Alternate Mix', which tones down the guitar and synth parts and blends them into the background. The 'Alternate Mix' of the video is available on Twain's compilations Come On Over: Video Collection (1999) and The Platinum Collection (2001), though an alternate version of the video using the 'International Version' was used as a backdrop for Twain's performance of the song on her Top of the Pops special in 1999. On YouTube, \"Man! I Feel Like a Woman!\" is Twain's most-viewed video with 322 million views as of November 2022. On November 1, the music video of \"Man I Feel Like A Woman\" has been remastered in HD, to commemorate the 25th anniversary of the parental album \"Come On Over\".", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": null, "intMusicVidLikes": null, "intMusicVidDislikes": null, "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "6", "intLoved": "0", "intScore": "10", "intScoreVotes": "3", "intTotalListeners": "242604", "intTotalPlays": "947553", "strMusicBrainzID": "f89b57c0-f0c2-4cf7-af44-c2531b6027a1", "strMusicBrainzAlbumID": "a979f644-2c62-3446-9579-47ade07d5aaf", "strMusicBrainzArtistID": "faabb55d-3c9e-4c23-8779-732ac2ee2c0d", "strLocked": "Unlocked"}]}