{"track": [{"idTrack": "32759159", "idAlbum": "2113067", "idArtist": "111507", "idLyric": "410910", "idIMVDB": "0", "strTrack": "Scar Tissue", "strAlbum": "Californication", "strArtist": "Red Hot Chili Peppers", "strArtistAlternate": "RHCP", "intCD": null, "intDuration": "219000", "strGenre": "Alternative Rock", "strMood": "Moody", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Scar Tissue\" is the first single from the American rock band Red Hot Chili Peppers' seventh studio album Californication, released in 1999. It is one of their most successful songs, spending a then-record 16 consecutive weeks on top of the Billboard Hot Modern Rock Tracks chart, as well as 10 weeks at the top of the Billboard Mainstream Rock Tracks chart and reached number 8 on Billboard Hot 100 Airplay. It peaked at number 9 on the Billboard Hot 100. In the UK, the song reached number 15 on the UK Singles Chart. It won a Grammy Award for Best Rock Song in 2000. The song is notable for its mellow intro guitar riff and for its slide guitar solos throughout. Guitar World placed the guitar solo 63rd in its list of the \"100 Greatest Guitar Solos\".\n\n\"Scar Tissue\" is considered to be representative of the new, more melodic rock sound the band experimented with on Californication (in contrast to the psychedelic One Hot Minute, and dry funk of Blood Sugar Sex Magik).\n\nIn 2004 Anthony Kiedis published Scar Tissue. Co-written by Larry Sloman, it was an autobiography with the principal theme of sex, drugs and rock-'n-roll. In the book he talks about the consequences of drugs (especially heroin) and in which way this can destroy somebody's life.\n\nThe music video for \"Scar Tissue\" was directed by Stéphane Sednaoui, who also directed the video for \"Give It Away\".\n\nThe opening shot is of John Frusciante driving, a metaphor for Frusciante's return to the band (he does not drive in real life). But the four of them are battered, beaten and bandaged. They are traveling in a rusty wreck and playing broken instruments on the comeback trail. The video ends after an emotional thirty second Frusciante guitar solo at the moment of sunset, with John tossing the broken guitar from the car. The car Frusciante drove for the video was a 1967 Pontiac Catalina convertible. A very similar concept was considered, then scrapped, for the earlier \"Soul to Squeeze\" video. Prior to the video shoot Kiedis had his hair cut and bleached his brown hair platinum blond.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vrpupt1486577420.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=mzJj5-lubeM", "strMusicVidDirector": "Stéphane Sednaoui", "strMusicVidCompany": "Propaganda Films", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/qyssrx1527677635.jpg", "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "93543716", "intMusicVidLikes": "332830", "intMusicVidDislikes": "5819", "intMusicVidFavorites": "0", "intMusicVidComments": "12701", "intTrackNumber": "3", "intLoved": "2", "intScore": "9.66667", "intScoreVotes": "3", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "a542705d-0c76-4da4-8466-2dafb9425511", "strMusicBrainzAlbumID": "ca5dfcc3-83fb-3eee-9061-c27296b77b2c", "strMusicBrainzArtistID": "8bfac288-ccc5-448d-9573-c33ea2aa5c30", "strLocked": "Unlocked"}]}