{"track": [{"idTrack": "32927826", "idAlbum": "2126489", "idArtist": "113746", "idLyric": "54142", "idIMVDB": null, "strTrack": "Achy Breaky Heart", "strAlbum": "The Definitive Collection", "strArtist": "Billy Ray Cyrus", "strArtistAlternate": null, "intCD": null, "intDuration": "203866", "strGenre": "Rock", "strMood": "...", "strStyle": "Country", "strTheme": "...", "strDescriptionEN": "\"Achy Breaky Heart\" is a song written in 1990 by Don Von Tress. First released in 1991 by the Marcy Brothers with the title \"Don't Tell My Heart\", it was later recorded by American singer and actor Billy Ray Cyrus and released on his debut album, Some Gave All (1992). The song is Cyrus' debut single and signature song. It became the first single ever to achieve triple platinum status in Australia and also 1992's best-selling single in the same country. In the United States, it became a crossover hit on pop and country radio, peaking at No. 4 on the Billboard Hot 100 and topping the Hot Country Songs chart, becoming the first country single to be certified platinum since \"Islands in the Stream\" by Kenny Rogers and Dolly Parton in 1983. The single topped in several countries, and after being featured on Top of the Pops in the United Kingdom, peaked at No. 3 on the UK Singles Chart. It was Cyrus' biggest hit single in the U.S. until he was featured on \"Old Town Road\" by rapper Lil Nas X, which peaked at No. 1 on the Billboard Hot 100 27 years later.\n\nThe music video for the song led to the explosion of the line dance into the mainstream. The song is considered by some as one of the worst songs of all time, featuring at No. 2 on VH1 and Blender's list of the \"50 Most Awesomely Bad Songs Ever\". However, it later became a cult classic.\n\nTwo very similar versions of the video for the song exist. Directed by Marc Ball, it was filmed during a live performance at the Paramount Arts Center in Ashland, Kentucky. The version released to country stations begins with a shot of the theater and ends with extended applause from the audience. The version released to MTV (which is the version found on Cyrus' YouTube account), begins with Cyrus exiting a limo, and the ending cheer from the audience is much shorter.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "", "strMusicVidDirector": "Marc Ball", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": null, "intMusicVidLikes": null, "intMusicVidDislikes": null, "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "167402", "intTotalPlays": "486107", "strMusicBrainzID": "c864c98a-f4bd-43f9-a7b1-643174a57213", "strMusicBrainzAlbumID": "092f9359-ac50-3bba-8aab-ff059e80202d", "strMusicBrainzArtistID": "63e8d6f9-e247-45c9-aaf2-e079cddbdd54", "strLocked": "Unlocked"}]}