{"track": [{"idTrack": "32822909", "idAlbum": "2118217", "idArtist": "112424", "idLyric": "333118", "idIMVDB": null, "strTrack": "Black or White", "strAlbum": "Dangerous", "strArtist": "Michael Jackson", "strArtistAlternate": null, "intCD": null, "intDuration": "256160", "strGenre": "Pop", "strMood": "Quirky", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Black or White\" is a single by American singer-songwriter Michael Jackson. The song was released by Epic Records on November 11, 1991, as the first single from his eighth studio album, Dangerous. He co-wrote, composed, and produced it with Bill Bottrell. The song is a fusion of pop rock, dance and hip hop. Epic Records described the song as \"a rock 'n' roll dance song about racial harmony\".\n\n\"Black or White\" peaked at number one on the Billboard Hot 100 on December 7, 1991, making it the fastest chart topper since the Beatles' \"Get Back\". It stayed there for a total of seven weeks. Jackson became the first artist to have number one hits in the 1970s, 1980s and 1990s with the song. It is certified 2x Platinum by the Recording Industry Association of America (RIAA). Around the world, \"Black or White\" hit number one in 20 countries, including the US, the UK, Canada, Mexico, Cuba, Turkey, Zimbabwe, Australia, New Zealand, Belgium, Denmark, Finland, France, Ireland, Israel, Italy, Norway, Spain, Sweden, Switzerland and the Eurochart Hot 100. It was the best-selling single worldwide of 1992.\n\nThe music video for \"Black or White\" premiered on MTV, BET, VH1, and Fox, which gave them their highest Nielsen ratings ever at the time, as well as the BBC's Top of the Pops in the UK on November 14, 1991. The video was directed by John Landis, who previously directed Thriller. It was co-choreographed by Jackson and Vincent Paterson. It premiered simultaneously in 27 countries, with an audience of 500 million viewers, the most ever for a music video.\n\n\"Black or White\" was honored with the first Billboard No. 1 World Single. The music video of the song appears on the video albums: Dangerous: The Short Films (long version), Video Greatest Hits – HIStory (long version, without graffiti on VHS version but with graffiti on DVD version), Number Ones (short version), and Michael Jackson's Vision (long version without graffiti). In 2003, Q magazine ranked \"Black or White\" at number 84 in their list of the \"1001 Best Songs Ever\".", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xe6h751618332474.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=cG0oM4a0AgI", "strMusicVidDirector": "John Landis", "strMusicVidCompany": "Apogee", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "727", "intMusicVidLikes": "39", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "23", "intTrackNumber": "8", "intLoved": "1", "intScore": "9.66667", "intScoreVotes": "6", "intTotalListeners": "680430", "intTotalPlays": "3557279", "strMusicBrainzID": "43a8d041-d666-4b14-807a-5ac0df35a69a", "strMusicBrainzAlbumID": "d6b52521-0dfa-390f-970f-790174c22752", "strMusicBrainzArtistID": "f27ec8db-af05-4f36-916e-3d57f91ecf5e", "strLocked": "Unlocked"}]}