{"track": [{"idTrack": "33058276", "idAlbum": "2137174", "idArtist": "115537", "idLyric": "415804", "idIMVDB": "0", "strTrack": "Hazard", "strAlbum": "Stories to Tell", "strArtist": "Richard Marx", "strArtistAlternate": null, "intCD": null, "intDuration": "254000", "strGenre": "Pop-Rock", "strMood": "Gritty", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Hazard\" is a 1992 hit song written and performed by American singer/songwriter/producer Richard Marx. It peaked at #9 on the Billboard Hot 100 and reached #6 in the Cash Box charts.\n\nIn addition, the song was Richard's third #1 on the Billboard Adult Contemporary chart. Internationally, it topped charts throughout the world, hitting #1 in Australia and #3 in the United Kingdom.\"Hazard\" tells the story of a relationship of some kind between a narrator and a woman named Mary. Mary disappears in suspicious circumstances, and the narrator, shunned by many in the small town since his childhood (\"That boy's not right.\"), is immediately considered the main suspect. The narrator, however, maintains his innocence throughout the song, and the question of such is left open to the listener's interpretation.\n\nThe music video for \"Hazard\" reveals additional video cues and other details that led viewers to speculate about the question of the protagonist's innocence while still following the song's lyrics and ultimately leaving the outcome open to interpretation. The narrator also refers to the state of Nebraska, United States, and specifically a town called Hazard, NE. \"Miss Mary\" is played by actress Renee Parent\n\nThe music video opens with several older men teasing the protagonist's character as a child with his mother in the background; the description of his character as \"not right\" may imply slight mental illness or simply being different. The video then shows Mary, who is depicted as having features very similar to the protagonist's mother. Various scenes in this sequence can cause the viewer to become unclear about the nature of their relationship. As the story continues, the town's sheriff is shown taking photographs of the couple and following one or both of them in his vehicle.\n\nIt is implied that the protagonist goes to see Mary but catches her making love to an unidentified person. Again, the video flashes back to his childhood, where he sees his mother committing adultery. In present time, the sheriff arrives and sees the protagonist, who then flees, leaving his scarf behind on the branch of a bush. He returns home and weeps about Mary.\n\nMary is then shown alone near the river spoken of in the song. She turns to face the camera with a look of surprise on her face, and it is then made to look as if she lay in water. The next morning (as the song states), several people assist in arresting the male character in regard to her disappearance.\n\nWhile in the interrogation room, he is shown a white cloth, which the sheriff identifies as the item used to strangle Mary. He then denies that he and Mary were romantically involved, and the sheriff asks if Marx was jealous. At this point, the video reveals a larger picture of the protagonist's childhood: that after his mother's affair, his father leaves her for another woman. He is then shown as a child running out of a burning house, although it is unclear whose it is or if he actually set the fire.\n\nLocals are shown vandalizing the male character's home, breaking windows and setting fire to it. It is implied that he cannot be proven guilty when the sheriff drops him off at his ruined home. As the video ends, a woman walking by covers her young son's eyes, again implying he is an outcast or implicated in her disappearance.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=gdmHHoI9beM", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "10100913", "intMusicVidLikes": "46235", "intMusicVidDislikes": "1195", "intMusicVidFavorites": "0", "intMusicVidComments": "3413", "intTrackNumber": "3", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "100577", "intTotalPlays": "468338", "strMusicBrainzID": "7269054f-e84a-4f57-8243-62281aa28fa5", "strMusicBrainzAlbumID": "3a1bb22a-5b62-425f-947a-e8fde8e93e0b", "strMusicBrainzArtistID": "e33c460f-011a-469a-b934-08932a3729c4", "strLocked": "Unlocked"}]}