{"track": [{"idTrack": "32794754", "idAlbum": "2115998", "idArtist": "112045", "idLyric": "509443", "idIMVDB": null, "strTrack": "One", "strAlbum": "Achtung Baby", "strArtist": "U2", "strArtistAlternate": null, "intCD": null, "intDuration": "276133", "strGenre": "Pop-Rock", "strMood": "Political", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"One\" is a song by Irish rock band U2. It is the third track from their 1991 album Achtung Baby, and it was released as the record's third single in February 1992. During the album's recording sessions at Hansa Studios in Berlin, conflict arose between the band members over the direction of U2's sound and the quality of their material. Tensions almost prompted the band to break up until they achieved a breakthrough with the improvisation of \"One\"; the song was written after the band members were inspired by a chord progression that guitarist the Edge was playing in the studio. The lyrics, written by lead singer Bono, were inspired by the band members' fractured relationships and the German reunification. Although the lyrics ostensibly describe \"disunity\", they have been interpreted in other ways.\n\n\"One\" was released as a benefit single, with proceeds going towards AIDS research. The song topped the Irish Singles Charts, the Canadian RPM Top Singles chart and the US Billboard Album Rock Tracks and Modern Rock Tracks charts. It also peaked at number three in New Zealand, number four in Australia, number seven on the UK Singles Chart and number ten on the Billboard Hot 100. In promotion of the song, the band filmed several music videos, although they were not pleased until a third was created.\n\nThe song was acclaimed by critics upon its release, and it has since been featured in polls of the greatest songs of all time. U2 has performed \"One\" at most of their tour concerts since the song's live debut in 1992, and it has appeared in many of the band's concert films. In a live setting, \"One\" is often used by the group to promote human rights or social justice causes, and the song lends its namesake to Bono's charitable organisation, the ONE Campaign. In 2005, U2 re-recorded the song as part of a duet with R&B recording artist Mary J. Blige on her album The Breakthrough.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xptxxr1582040031.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=ftjEcrrf7r0", "strMusicVidDirector": "Mark Pellington", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/ryrrxx1582040071.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/qytstu1582040087.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/xtpqrq1582040094.jpg", "intMusicVidViews": "118526082", "intMusicVidLikes": "482400", "intMusicVidDislikes": "20653", "intMusicVidFavorites": "0", "intMusicVidComments": "17073", "intTrackNumber": "3", "intLoved": "2", "intScore": "9.75", "intScoreVotes": "8", "intTotalListeners": "860819", "intTotalPlays": "5106041", "strMusicBrainzID": "44135d7f-f5d6-4ef9-8518-ed11f5b705e7", "strMusicBrainzAlbumID": "744c7a1b-ac79-35c4-bd92-7e2c6a24c8d8", "strMusicBrainzArtistID": "a3cb23fc-acd3-4ce0-8f36-1e5aa6a18432", "strLocked": "Unlocked"}]}