{"track": [{"idTrack": "32726216", "idAlbum": "2109828", "idArtist": "111255", "idLyric": "311038", "idIMVDB": "0", "strTrack": "Frozen", "strAlbum": "Ray of Light", "strArtist": "Madonna", "strArtistAlternate": "Madonna Louise Veronica Ciccone", "intCD": null, "intDuration": "372693", "strGenre": "Pop", "strMood": "Happy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Frozen\" is a song by American singer Madonna from her seventh studio album Ray of Light (1998). It was released as the lead single from the album on February 23, 1998, by Maverick and Warner Bros. Records. The song was also included on the compilation albums GHV2 (2001) and Celebration (2009). \"Frozen\" was written by Madonna and Patrick Leonard, and it was produced in collaboration with William Orbit. A mid-tempo electronica ballad, \"Frozen\" talks about a cold and emotionless human being. In 2005, a judge in Belgium ruled that \"Frozen\" was plagiarized from a song by Salvatore Acquaviva, and it was banned from the region. This ruling was overturned in 2014, lifting the Belgium ban on the song.\n\nThe accompanying music video for \"Frozen\" was directed by Chris Cunningham in a desert in California, portraying Madonna as an ethereal, witch-like, melancholy persona, who shapeshifts into a flock of birds and a black dog. The music video received a MTV Video Music Award for \"Best Special Effects\" in 1998.\n\nThe music video for \"Frozen\" was filmed at Cuddeback Lake within the Mojave Desert in California during January 7–11, 1998. The video introduces a sober, contemplative side of Madonna, revealing a mature mysticism. It begins with the camera skimming along a cracked, desiccated desert floor, and within seconds Madonna appears, hovering just above the ground in the distance. Her hands are covered with mehndi and an enigmatic symbol on one palm. In the video, she slowly gestures and sways her arms toward the sky, desperately pleading to her cold lover cited in the song. At one point, Madonna falls backward, hits the ground, and transforms into a flock of large, dark birds. Later, she transforms into a black dog. Three Madonnas also appear walking and crawling amid the desert throughout the video. As the song progresses, the sky darkens, and Madonna levitates from the ground. Her form then changes to a shiny black liquid, which runs along the desert floor and appears to be absorbed by the tattooed hands of another Madonna, who is curled up on the crenellated ground. The video ends with a desperate and melancholy Madonna.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vrtxwq1363828716.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=XS088Opj9o0", "strMusicVidDirector": "Chris Cunningham", "strMusicVidCompany": "Black Dog Films", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "34190552", "intMusicVidLikes": "193189", "intMusicVidDislikes": "8233", "intMusicVidFavorites": "0", "intMusicVidComments": "13999", "intTrackNumber": "9", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "459082", "intTotalPlays": "3004296", "strMusicBrainzID": "bcde755b-0d7d-4d6e-a20e-1364b2800ebd", "strMusicBrainzAlbumID": "cb93e87f-5d21-3447-a6e8-22d44f9b0d7a", "strMusicBrainzArtistID": "79239441-bfd5-4981-a70c-55c3f15c1287", "strLocked": "Unlocked"}]}