{"track": [{"idTrack": "32974213", "idAlbum": "2130434", "idArtist": "114306", "idLyric": "290073", "idIMVDB": "0", "strTrack": "How Do I Live", "strAlbum": "Sittin' on Top of the World", "strArtist": "LeAnn Rimes", "strArtistAlternate": "Margaret LeAnn Rimes", "intCD": null, "intDuration": "298000", "strGenre": "Country", "strMood": "Good Natured", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"How Do I Live\" is a song written by Diane Warren. It was originally performed by LeAnn Rimes and the extended version of the song was later featured on her album You Light Up My Life: Inspirational Songs in 1997 and later performed by Trisha Yearwood. Both versions were released on May 27, 1997.\n\nIn the U.S., Rimes's version peaked at No. 2 for four non-consecutive weeks in late 1997 and early 1998, behind \"Candle in the Wind 1997\" by Elton John, and \"Truly Madly Deeply\" by Savage Garden. It set a record for staying on the Billboard Hot 100 chart for 69 weeks, a record it held until \"I'm Yours\" by Jason Mraz set a new record of 76 weeks. The Rimes recording also set the record for the most time in the Billboard Hot 100's top 5 at 25 consecutive weeks, the record for Billboard Hot 100's top 10 at 32 consecutive weeks, and the record for Billboard Hot 100's top 40 at 62 consecutive weeks; all records still hold to this day. It ranks at No. 4 on Billboard's All Time Top 100, the only single on the top 10 of this list not peaking at No. 1. The only songs that finished ahead of it were Bobby Darin's cover of \"Mack the Knife\", Santana's song \"Smooth\", and Chubby Checker's version of \"The Twist\". It has been certified 3× Platinum by the RIAA for shipments of 3 million copies in the United States, the highest certified country single of that time, to be surpassed twelve years later by \"Love Story\" from artist Taylor Swift, which has been certified 8× Platinum.\n\nDespite only peaking as high as No. 7 in the UK Singles Chart, Rimes' version of \"How Do I Live\" spent 34 weeks on the chart, ending up as the 6th best selling single of 1998. As of August 2014, the song has sold 710,000 copies in the UK.\n\n\"How Do I Live\" was also covered by F.I.R. (Faye and Real featuring LeAnn Rimes). F.I.R. invited Rimes to record a portion of the song for their third album Flight Tribe in 2006.\n\nThe song was originally intended for release as a single for the 1997 action blockbuster Con Air soundtrack.\n\nAccording to LeAnn Rimes, Warren wrote the song with her in mind, promising it to Rimes \"no matter what.\" Walt Disney Pictures, the parent company of Touchstone Pictures, decided that Rimes' recording had too much of a \"pop\" feel to it and, because she was 14, that she was too young for the subject matter expressed in the song. Trisha Yearwood was ultimately chosen to re-record the song, utilizing a more throaty, country-western vibe. Yearwood's version was released on May 27, 1997 to country radio and appeared in the film. According to Yearwood, she had no idea of Rimes' recording prior to being approached by Touchstone Pictures to do the song.\n\nWhen Wilbur Rimes (Leann's father and then manager) heard of the release, her version was quickly released to mainstream pop radio. Neither Rimes' nor Yearwood's version of the song was included on the soundtrack album for the film (which consists of the score by Trevor Rabin and Mark Mancina).\n\nRimes' version was released on a CD and cassette tape single, with the original rendition of the song plus an extended version, the latter of which was later re-issued on Rimes' You Light Up My Life: Inspirational Songs, while the former was issued on her Greatest Hits in 2003 in the US, The Best of LeAnn Rimes in 2004 internationally and again in the US on her All-Time Greatest Hits album in 2015. The CD single was later re-issued with the original version of the song as the A-side track with the B-side being replaced by the Mr. Mig's Dance Radio Edit, which would later be featured on the remix edition of The Best of LeAnn Rimes in 2004, while in 2014 her Dance Like You Don't Give A...Greatest Hits Remixes featured a new remix by Cahill.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": "0", "intMusicVidComments": "0", "intTrackNumber": "1", "intLoved": "2", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "134025", "intTotalPlays": "496539", "strMusicBrainzID": "2459a758-046a-4886-b42d-b496a5ad3d2a", "strMusicBrainzAlbumID": "5864fc2e-1e43-3c86-8cf3-16cbca601e37", "strMusicBrainzArtistID": "9092d8e1-9b38-4372-a96d-000b8561a8bc", "strLocked": "Unlocked"}]}