{"track": [{"idTrack": "33128518", "idAlbum": "2142920", "idArtist": "111268", "idLyric": "6309", "idIMVDB": null, "strTrack": "I Don't Want to Miss a Thing", "strAlbum": "O, Yeah! Ultimate Aerosmith Hits", "strArtist": "Aerosmith", "strArtistAlternate": null, "intCD": "2", "intDuration": "299626", "strGenre": "Hard Rock", "strMood": "Philosophical", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"I Don't Want to Miss a Thing\" is a power ballad performed by American hard rock band Aerosmith for the 1998 film Armageddon which Steven Tyler's daughter Liv Tyler starred in. Written by Diane Warren, the song debuted at number one on the U.S. Billboard Hot 100 (the first #1 for the band after 28 years together). It is one of three songs performed by the band for the film, the other two being \"What Kind of Love Are You On\" and \"Sweet Emotion\". The song stayed at number one for four weeks from September 5 to 26, 1998. The song also stayed at number 1 for several weeks in several other countries. It sold over a million copies in the UK and reached number four on the UK Singles Chart.\n\nThis song was also featured in the 2013 video game Saints Row IV. The track was also heard in an episode of \"Jewelpet Sunshine\" which is the third season of the Jewelpet franchise.\n\nThis song was Aerosmith's biggest hit, debuting at number 1 on the U.S. Billboard Hot 100, where it stayed for four weeks in September, and reaching number 1 in many countries around the world, including Australia, the Philippines, Germany, Ireland, Austria, Norway, Italy, the Netherlands, and Switzerland.\n\nThe chorus of the song is highly reminiscent of an earlier song Diane Warren co-wrote, \"Just Like Jesse James\", which appeared on Cher's 1989 album Heart of Stone.\n\nThe song helped open up Aerosmith to a new generation and remains a slow dance staple.\n\nIt was one of many songs written by Warren in that time period. The original version was a collaboration between Chicago musician Phil Kosch of Treaty of Paris and Super Happy Fun Club, and nephew of chart topping writer Lou Bega. Bega introduced the two and they penned the initial track, but ultimately Kosch was left uncredited.\n\nThe song is notable for having been nominated for both an Academy Award for Best Original Song and a Golden Raspberry Award for Worst Original Song.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qxtuyt1484909384.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=JkK8g6FMEXE", "strMusicVidDirector": "Francis Lawrence", "strMusicVidCompany": "DNA", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "534874927", "intMusicVidLikes": "3070634", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "72658", "intTrackNumber": "9", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "874928", "intTotalPlays": "4997659", "strMusicBrainzID": "2e2e66bd-a016-4713-bd7f-dbb4037cc9b8", "strMusicBrainzAlbumID": "46b0f87b-0665-3110-ad6c-8fcf1811cd3a", "strMusicBrainzArtistID": "3d2b98e5-556f-4451-a3ff-c50ea18d57cb", "strLocked": "Unlocked"}]}