{"track": [{"idTrack": "33753376", "idAlbum": "2194021", "idArtist": "111969", "idLyric": "436028", "idIMVDB": "2147483647", "strTrack": "Truly Madly Deeply", "strAlbum": "Truly Madly Completely", "strArtist": "Savage Garden", "strArtistAlternate": null, "intCD": null, "intDuration": "279400", "strGenre": "Pop-Rock", "strMood": "Gritty", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Truly Madly Deeply\" is a song by Australian pop band Savage Garden, released as the third single from their self-titled debut album in March 1997 by Columbia Records, Roadshow Music and Sony Records. It won the 1997 ARIA Music Award for Single of the Year and Highest Selling Single along it nominated of ARIA Music Award for Song of the Year. Written by bandmates Darren Hayes and Daniel Jones, the song is a reworking of a song called \"Magical Kisses\" that the pair wrote together long before recording began on their debut album. It was used as the main theme from the soundtrack of the 1998 film Music from Another Room, starring Jude Law and Gretchen Mol.\n\nThe song reached number one in Australia in 1997 and in the United States the following year. Two music videos were filmed for the track—one for its original Australian release, and another for the international market shot in Paris.\n\nThere are two distinct versions of the song. The first was made available on the Australian version of the group's album, whereas the second version appears on the release of the album in Europe and America. This version was composed in 1996, and features a drum machine track instead of the more acoustic-sounding music featured on the Australian version. The European version also features on the group's greatest hits compilation, Truly Madly Completely.\n\nTwo music videos were made for the song. The original Australian video, which presents Darren Hayes with long hair, features the band in a white room with several other people. Darren is on a red sofa singing the song while Daniel performs on the piano. The video used for the European market, which presents Darren Hayes with short hair, was filmed in Paris. It was directed by Adolfo Doring. The video depicts the story of two lovers, a young man and a lady, who have been separated by circumstances. The woman arrives in Paris, possibly at Gare du Nord station, in search of her lover, who is also waiting for her. He is wandering in various places within the Montmartre area, including the Soleil de la Butte restaurant. In between the scenes involving the two lovers, Darren Hayes can be seen walking around Paris, in locations such as the Place de la Concorde and the Jardin des Tuileries. He is singing, thereby acting as a narrator to the story involving the two lovers. Towards the end of the video, Hayes enters a small concert hall where Daniel Jones is playing guitar. Shortly afterwards, the young lady manages to find her lover, right in the centre of Paris. They are both filled with emotion on seeing each other again. The video ends with Hayes and Jones coming out of the concert hall, and coming across the two lovers who are rejoicing in their reunion. The video was released on 25 October 2009. As of January 2017, the video has received over 107 million views.\n\nThe song was a major and sustained success in the U.S. beginning in 1997. Entering the Billboard Hot 100 singles chart at No. 26 on 6 December 1997, it peaked at No. 1 for two weeks in January 1998 and lingered for a full year on the chart. The song spent half a year in the top ten alone. It hit No. 1 on the Billboard Hot 100 Airplay chart and No. 2 on the Hot Adult Top 40 Tracks chart. It also went Top 10 on the Rhythmic Top 40 chart. On the Billboard Top 40 Mainstream chart the song hit number one for one week on 31 January before dropping to number two as Celine Dion assumed the top spot with the theme to the hit film Titanic, \"My Heart Will Go On\". Savage Garden's single held at No. 2 for ten weeks, before returning to the number one spot again the week of 18 April.\n\nThe song eventually set a record for the most weeks of any single in history on the U.S. Hot Adult Contemporary chart. In 1998 the song logged eleven weeks at number one on this chart, but its full chart span lasted 123 weeks. That record would stand for just under two years, when another of the group's ballads spent its 124th week on the chart. The song was \"I Knew I Loved You\", from the album Affirmation. After leaving the main Adult Contemporary chart, the song entered the Hot Adult Contemporary Recurrents chart where it charted for another 202 weeks. The song was so popular that it re-entered Billboard's Hot Singles Sales chart in March 2002 and—four and a half years after its release—again became a U.S. Top 30 bestseller, remaining on that chart until late July 2002. The original version logged its final week on the Hot Adult Contemporary Recurrents chart on 17 June 2006. In 2013, the song was listed at No. 35 on Billboard's All Time Top 100.\n\nThe song also reached No. 1 in their home country of Australia and in Canada. Savage Garden's single hit No. 2 in Norway, Sweden, Austria and Ireland and went top ten in France, Switzerland, the Netherlands, Belgium and the UK, where it peaked at No. 4. In 1998, the song was certified a Gold single in France, for sales of 200,000 copies. In May 2001 the Australasian Performing Right Association (APRA), as part of its 75th Anniversary celebrations, named \"Truly Madly Deeply\" as one of the Top 30 Australian songs of all time.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=WQnAxOQxQIU", "strMusicVidDirector": "Adolfo Doring", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "112867863", "intMusicVidLikes": "473876", "intMusicVidDislikes": "11832", "intMusicVidFavorites": "0", "intMusicVidComments": "17478", "intTrackNumber": "8", "intLoved": "2", "intScore": "10", "intScoreVotes": "6", "intTotalListeners": "411247", "intTotalPlays": "2072523", "strMusicBrainzID": "30fd0f08-8406-4117-a337-1e9d3b3301ed", "strMusicBrainzAlbumID": "94c05bd0-f2bb-32ad-8230-68b9775ce421", "strMusicBrainzArtistID": "a871fd87-50f7-4032-b06d-da56779edcce", "strLocked": "Unlocked"}]}