{"track": [{"idTrack": "33650189", "idAlbum": "2185606", "idArtist": "111260", "idLyric": "317069", "idIMVDB": null, "strTrack": "All I Want for Christmas Is You", "strAlbum": "The Ballads", "strArtist": "Mariah Carey", "strArtistAlternate": null, "intCD": null, "intDuration": "242000", "strGenre": "R&B", "strMood": "In Love", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"All I Want for Christmas Is You\" is a song recorded by American singer Mariah Carey for her fourth studio album and first holiday album, Merry Christmas (1994). Written and produced by Carey and Walter Afanasieff, the song was released as the lead single from the album on October 29, 1994. The track is an uptempo love song that includes bell chimes, backing vocals and synthesizers. The song has become a Christmas standard and continues to surge in popularity each holiday season.\n\n\"All I Want for Christmas Is You\" received critical acclaim, with The New Yorker describing it as \"one of the few worthy modern additions to the holiday canon\". The song became a global success, topping the charts in twenty-six countries including Australia, Canada, France and Germany. In 2019, it topped the US Billboard Hot 100 for the first time, 25 years after its original release, thereby breaking several records, including the longest trip to number one. The following year, it also topped the charts in the United Kingdom for the first time, spending a record 69 weeks in its top 40 prior to reaching number one. With an estimated sales of over 16 million copies worldwide, \"All I Want for Christmas Is You\" is the best-selling holiday song by a female artist, and one of the best-selling physical singles in music history. The song is certified Diamond by RIAA, denoting sales of 10 million copies in the United States, becoming the first and only holiday song to accomplish this feat. By 2017, it had reportedly earned $60 million in royalties.\n\nTwo music videos were originally commissioned for the song. The primary video features grainy home-movie-style footage of Carey, her dogs and family during the holiday season, as well as Carey dressed in a Santa suit frolicking on a snowy mountainside. Carey's then-husband Tommy Mottola makes a cameo as Santa Claus, bringing Carey a gift and leaving on a red sleigh. The second video was filmed in black and white, and features Carey dressed in 1960s style in homage to the Ronettes, alongside backup singers and female dancers. A third music video directed by Joseph Kahn was released in 2019 to commemorate the 25th anniversary of the song.\n\nCarey has performed \"All I Want for Christmas Is You\" during numerous live television appearances and tours throughout her career. In 2010, Carey re-recorded the song for her second holiday album, Merry Christmas II You (2010), known as the \"Extra Festive\" version. Carey also re-recorded the song as a duet with Canadian singer Justin Bieber for his 2011 album Under the Mistletoe, known as the \"SuperFestive!\" version.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vxu7ks1606593772.jpg", "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": null, "intMusicVidLikes": null, "intMusicVidDislikes": null, "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "18", "intLoved": "5", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "814461", "intTotalPlays": "5237305", "strMusicBrainzID": "a6fab057-cf3a-4456-950e-d3edaf219326", "strMusicBrainzAlbumID": "ed92fd95-44b7-380d-83ca-9fd8fff3c9fc", "strMusicBrainzArtistID": "494e8d09-f85b-4543-892f-a5096aed1cd4", "strLocked": "Unlocked"}]}