{"track": [{"idTrack": "35734999", "idAlbum": "2368441", "idArtist": "112024", "idLyric": null, "idIMVDB": null, "strTrack": "Take My Breath", "strAlbum": "Take My Breath", "strArtist": "The Weeknd", "strArtistAlternate": null, "intCD": null, "intDuration": "220196", "strGenre": "R&B", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"Take My Breath\" is a song by Canadian singer the Weeknd. It was released on August 6, 2021, as the lead single from his upcoming fifth studio album. It was universally acclaimed for its nostalgic '80s beats and synths. A portion of the song's instrumental was first teased by the Weeknd on social media platforms on August 2, 2021.\n\nBackground and promotion\nThe Weeknd first teased that he was working on a new album in September 2020, via an interview with Rolling Stone in which he stated \"I might have another album ready to go by the time this quarantine is over\". Later on during the 2021 Billboard Music Awards in May, he went on to state in his acceptance speech \"I just want to say the After Hours are done and The Dawn is coming.\" The Weeknd continued mentioning the upcoming project under the working name \"The Dawn\" on social media, throughout June and July, with him revealing a new style for his next chapter and dropping the collaborations \"You Right\" and \"Better Believe\", respective collaborations with Doja Cat, and Belly and Young Thug, during that period to showcase it in the visuals for the two tracks.\n\nOn August 2, 2021, a snippet of \"Take My Breath\" with a visual of a sunrise titled \"The Dawn Is Coming\" and a GQ interview was released in promotion of the track, with the single's release date of August 6, 2021 being confirmed through the release of a Tokyo Olympics 2020 promotional video later that day.\n\nCritical reception\n“Take My Breath” received universal acclaim. The vocals and production of the track received praise from Billboard's Joe Lynch, who compared the latter aspect's usage of a synthesizer to the synth riff that was used in Donna Summer's 1977 single \"I Feel Love\". Ben Beaumont-Thomas of The Guardian gave the song a five-star rating, stating that it is \"an instant disco-pop masterpiece\".\n\nMusic video\nThe music video for \"Take My Breath\" was first teased by the Weeknd on social media via self-released images of the visual during the week leading up to the release of the single. It originally was supposed to play before IMAX showings of The Suicide Squad, but was reportedly pulled due to epilepsy concerns in regards to the \"intense strobe lighting\" featured in the clip. The video was released alongside the song.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/2wb8101628509141.jpg", "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "https://www.youtube.com/watch?v=rhTl_OyehF8", "strMusicVidDirector": "Cliqua", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "12415379", "intMusicVidLikes": "646377", "intMusicVidDislikes": "7952", "intMusicVidFavorites": "0", "intMusicVidComments": "41692", "intTrackNumber": "1", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "1dd3bee1-652b-4658-9d89-14dd762ab4a1", "strMusicBrainzAlbumID": "f0e7ea1e-098a-44a9-8e6f-e449d0ebf6c6", "strMusicBrainzArtistID": "c8b03190-306c-4120-bb0b-6f2ebfc06ea9", "strLocked": "Unlocked"}]}