{"track": [{"idTrack": "32785800", "idAlbum": "2115212", "idArtist": "111909", "idLyric": "83686", "idIMVDB": null, "strTrack": "Before He Cheats", "strAlbum": "Some Hearts", "strArtist": "Carrie Underwood", "strArtistAlternate": null, "intCD": null, "intDuration": "199946", "strGenre": "Country", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Before He Cheats\" is a song written by Chris Tompkins and Josh Kear and the third wide-release single from Carrie Underwood's debut album, Some Hearts. It was the fifth release from the album overall. It was named the 2007 Single of the Year by the Country Music Association. It is Underwood's most successful single as of March 2013, with sales of 3,735,000 digital downloads, making it the third best-selling song by an American Idol contestant in the United States (behind Kelly Clarkson's \"Stronger (What Doesn't Kill You)\" with 4 million), and fifth best-selling country song of all time (behind Lady Antebellum's \"Need You Now\", with 6.198 million, Florida Georgia Line's \"Cruise\", with 5.638 million, Taylor Swift's \"Love Story\", with 5.609 million and Swift's \"You Belong with Me\", with 4.12 million). Its longevity also made it the fourth longest-charting single in the history of the Hot 100 as well as coming in on CMT's 40 Greatest Songs of the Decade at number 25, along with Underwood's other signature hit, \"Jesus, Take the Wheel\", which ranked number four.\n\n\"Before He Cheats\" tells the story of a woman taking revenge on her potentially unfaithful boyfriend/husband.\n\nShe imagines him hanging out and flirting with a \"bleach-blonde\" girl, shooting pool, buying her a drink, dancing, and hoping to \"get lucky\" with her. In retaliation, she vandalizes his customized four-wheel drive vehicle by keying the sides, carving her name into its leather seats, smashing the headlights with a Louisville Slugger baseball bat and slashing all four tires. She hopes that this will make him \"think before he cheats\" again.\n\n\"Before He Cheats\" has sold over 3,731,000 downloads as of March 2013, making it the fourth-most downloaded country song after \"Need You Now\" by Lady Antebellum; \"Love Story\" and \"You Belong with Me\" by Taylor Swift. The song was certified 2× Platinum in digital sales by the RIAA in February 2008, making it the first country song to ever to do so. It was the best-selling single from an American Idol contestant until Kelly Clarkson's \"Stronger (What Doesn't Kill You)\" surpassed it in the spring of 2012, and is still Underwood's best selling single to date. It has sold over one million ringtones. In Canada, it is officially certified as Platinum. On May 9, 2013, the song was officially cetified 4× Platinum by RIAA.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wxqvwt1384795730.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=WaSy8yy-mr8", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/uwvtww1384796114.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/uxwpuq1384796121.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/wyqyws1384796131.jpg", "intMusicVidViews": "51905969", "intMusicVidLikes": "146746", "intMusicVidDislikes": "3668", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "7", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "362107", "intTotalPlays": "1788522", "strMusicBrainzID": "5c020130-6d01-4e9c-9551-91947ce53040", "strMusicBrainzAlbumID": "cc41abcc-f5d5-3e73-a1d2-7c39ea903dd4", "strMusicBrainzArtistID": "70f0e309-5418-49b6-a130-666e2f76eecd", "strLocked": "Unlocked"}]}