{"track": [{"idTrack": "32819668", "idAlbum": "2117983", "idArtist": "112401", "idLyric": "0", "idIMVDB": "0", "strTrack": "Give It to Me", "strAlbum": "Shock Value", "strArtist": "Timbaland", "strArtistAlternate": null, "intCD": null, "intDuration": "234000", "strGenre": "Hip-Hop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Give It to Me\" is a song performed by American producer, songwriter and rapper Timbaland, released as the first single from his second studio album Shock Value (2007). The song features vocals by Canadian singer and songwriter Nelly Furtado and American singer Justin Timberlake. All three artists co-wrote the song together with American rapper Attitude and American producer Danja, who produced the song with Timbaland. Mosley Music Group, in association with Blackground Records and Interscope Records, serviced the song to contemporary hit and rhythmic radios in the United States on 4 February 2007 and later to urban radios on 10 March 2007. \"Give It to Me\" is an electro song that embodies the sensibilities of club music. The song features the protagonists addressing their critics about their successes in the music industry.\n\nThe song has been noted for its notable diatribe in Timbaland's verse against American producer Scott Storch, who has worked with the producer in the past. It received positive reviews from music critics, many praising it for its club-oriented sound, Timbaland's production and the lyrics. The song experienced successful commercial outcomes in the United States as well as internationally. \"Give It to Me\" reached the top position on the Billboard Hot 100, becoming his first and only number one solo single in the United States (second overall after \"Promiscuous\"). It has sold nearly two million downloads in the United States, remaining as his third-best-selling single there. The song also topped the charts in Denmark and the United Kingdom. It experienced a lengthy chart run in Austria and Switzerland, where the song attained top ten positions on the chart. The song also attained top ten positions in European countries like Germany, Ireland, and the Netherlands.\n\nThe accompanying music video was directed by Paul \"Coy\" Allen and Timbaland. It features footage of the singers performing live at the 2007 Grammy Awards and the singers in their tour bus and on a balcony. The single was nominated Grammy Award for Best Pop Collaboration with Vocals at the 2008 Grammy Awards.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "191829", "intTotalPlays": "723199", "strMusicBrainzID": "97e92778-b873-400a-89d5-9b9807bbf26a", "strMusicBrainzAlbumID": "54b13731-592c-340e-b7dc-339691ba54ab", "strMusicBrainzArtistID": "daa09819-5da5-4c7a-8bef-eb372bb27ff1", "strLocked": "Unlocked"}]}