{"track": [{"idTrack": "33517270", "idAlbum": "2174757", "idArtist": "114364", "idLyric": "50755", "idIMVDB": null, "strTrack": "Irreplaceable", "strAlbum": "B'Day", "strArtist": "Beyoncé", "strArtistAlternate": "Beyonce", "intCD": null, "intDuration": "228000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Irreplaceable\" is a song recorded by American R&B singer Beyoncé Knowles for her second studio album, B'Day (2006). The song was written by Knowles, Shaffer \"Ne-Yo\" Smith, Tor Erik Hermansen, Mikkel S. Eriksen, Espen Lind, Amund Bjørklund, and produced by Stargate and Knowles. \"Irreplaceable\" was originally a country record; it was re-arranged as a mid-tempo pop ballad with R&B influences by modifying the vocal arrangements and instrumentation. During the production and recording sessions, Knowles' and Ne-Yo wanted to create a record that people of either gender could relate to. The song's lyrics are about the breakdown of a relationship with an unfaithful man and the song contains a message about female empowerment.\n\nFollowing the moderate chart performances of \"Déjà Vu\" and \"Ring the Alarm\", \"Irreplaceable\" was released on December 5, 2006 in the United States as the album's third single, and the second single in other countries. The single was released through Columbia Records. \"Irreplaceable\" was well received by contemporary music critics, who cited its distinct production compared with most songs featured on the album, and complimented its hook, \"To the left, to the left\". Pitchfork Media and Rolling Stone placed it on their lists of Best Songs of the 2000s. \"Irreplaceable\" won several awards including, Best R&B/Soul Single at the 2007 Soul Train Music Award. It was nominated for the Record of the Year award at the 50th Grammy Awards.\n\nThe single was commercially successful worldwide. It became Knowles' fourth number-one in the US, was B'Day's most successful release, and remained at the top of the US Billboard Hot 100 chart for ten consecutive weeks. \"Irreplaceable\" was the best-selling US single of 2007, the twenty-fifth most successful song of the 2000s (decade) in the US, and was certified double-platinum by the Recording Industry Association of America (RIAA). It became Knowles' second single to achieve 200 million audience impressions in 2006. She is the second singer to achieve this feat in the US, the first being Mariah Carey in 2005. \"Irreplaceable\" peaked at number one in Australia, at number four in the United Kingdom, and reached the top twenty in several European countries. \"Irreplaceable\" was 2007's tenth best-selling digital single with over 4.6 million copies sold worldwide.\n\nThe single's accompanying music video was directed by Anthony Mandler and served as the debut performance of Knowles' all-female band, Suga Mama. The video was included on the 2007 B'Day Anthology Video Album and a video edit was produced for \"Irreemplazable\", the Spanish version of the song. It won the Video of the Year award at the 2007 Black Entertainment Television (BET) Awards, and was nominated for the MTV Video Music Award for Video of the Year at the 2007 MTV Video Music Awards. \"Irreplaceable\" has regularly featured in Knowles' tours and live performances since 2006. The American Society of Composers, Authors, and Publishers (ASCAP) recognized the song as one of the most performed ones of 2007 at the ASCAP Pop Music Awards.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/trrruv1381180153.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=2EwViQxSJJQ", "strMusicVidDirector": "Anthony Mandler", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/rxqrwt1381180363.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/wprqxx1381180375.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/rtsptq1381180385.jpg", "intMusicVidViews": "108031543", "intMusicVidLikes": "253152", "intMusicVidDislikes": "8090", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "0", "intScore": "9.8", "intScoreVotes": "5", "intTotalListeners": "825623", "intTotalPlays": "4357361", "strMusicBrainzID": "db0ec4fd-6770-4ce6-a998-5b7a1686e9f7", "strMusicBrainzAlbumID": "9fdbccb2-9b51-36b7-b643-c7ae586b797d", "strMusicBrainzArtistID": "859d0860-d480-4efd-970c-c05d5f1776b8", "strLocked": "Unlocked"}]}