{"track": [{"idTrack": "32780598", "idAlbum": "2114812", "idArtist": "111828", "idLyric": "271725", "idIMVDB": null, "strTrack": "Never Again", "strAlbum": "My December", "strArtist": "Kelly Clarkson", "strArtistAlternate": null, "intCD": null, "intDuration": "217000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Never Again\" is a song recorded by American singer Kelly Clarkson for her third studio album, My December (2007). Clarkson co-wrote the song with Jimmy Messer while production was helmed by American producer and musician David Kahne. Clarkson stated that the song was written as a counterpart to the songs from her second studio album Breakaway (2004), and was almost removed because of its harsh lyrical nature. RCA Records serviced the song to mainstream radios in the United States on April 24, 2007. \"Never Again\" features a stronger rock sound than Clarkson's previous releases, but maintains some pop undertones. It relies on strings, guitar riffs and drums and is centered around angry, abrasive lyrics.\n\n\"Never Again\" received positive reviews from music critics, with many citing it as a darker counterpart to \"Since U Been Gone\" (Breakaway, 2004) and as one of her best releases. The song fared well in international as well as domestic markets, but failed to mimic the success of her previous lead singles. It peaked at number eight on the Billboard Hot 100 and was certified gold by the Recording Industry Association of America (RIAA). It was also certified gold in Canada and Australia while peaking within the top ten in both regions. The song has sold over one million downloads in the United States. The accompanying music video for \"Never Again\" was released on May 1, 2007 in the United States. It portrays Clarkson being drowned in a bathtub and in various scenes acting as a ghost, haunting her ex-boyfriend following the end of their relationship.\n\nThe music video, directed by Joseph Kahn, was shot in Los Angeles from April 11 to 13, 2007. Kahn directed two of Clarkson's previous videos: \"Behind These Hazel Eyes\" and \"Walk Away\". The video premiered on TRL on May 1, 2007, peaked at number one on May 10, 2007, and held the top position four times. It also debuted at number 8 on VH1's V-Spot countdown and has since climbed to number 3 on V-Spot's latest episode. The music video was made available for download on the U.S. iTunes Store on May 11, 2007.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/tpurrw1383079766.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=GVYesEpMr84", "strMusicVidDirector": "Joseph Kahn", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "29289530", "intMusicVidLikes": "42196", "intMusicVidDislikes": "840", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": "231876", "intTotalPlays": "1443920", "strMusicBrainzID": "24639d54-7196-4a65-8a53-15f86dd5425d", "strMusicBrainzAlbumID": "f1d0083d-9bc4-3046-a41e-790cee0ec999", "strMusicBrainzArtistID": "d339efbb-77b9-4147-ba9e-59f2f24550b2", "strLocked": "Unlocked"}]}