{"track": [{"idTrack": "32831764", "idAlbum": "2118964", "idArtist": "112518", "idLyric": "15001", "idIMVDB": "2147483647", "strTrack": "No One", "strAlbum": "As I Am", "strArtist": "Alicia Keys", "strArtistAlternate": null, "intCD": null, "intDuration": "253000", "strGenre": "R&B", "strMood": "Smooth", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"No One\" is a song by American singer and songwriter Alicia Keys, taken from her third studio album, As I Am (2007). It was written and produced by Keys, Kerry Brothers, Jr., and George M. Harry, and released as the album's lead single in September 2007. This is one of Keys' biggest songs, having topped several singles charts, including the Billboard Hot 100 for five consecutive weeks and the Hot R&B/Hip-Hop Songs chart for ten consecutive weeks. It is her second solo number-one single in the United States after 2001's \"Fallin'\".\n\nIn 2008, \"No One\" was ranked at number forty-two on The Billboard Hot 100 All-Time Top Songs and number fourteen on the Top Billboard Hot 100 R&B/hip-hop songs. In 2009, the song placed at number six on the Billboard Hot 100 decade-end chart. It also placed at number 48 on Billboard's \"Hot 100 55th Anniversary: The All-Time Top 100 Songs\".\n\nThe song won Best Female R&B Vocal Performance and Best R&B Song at the 2008 Grammy Awards on February 10, 2008. During the ceremony, Keys performed it in a duet with John Mayer. \"No One\" was also the most listened song on U.S. radio of 2008 with 3.08 billion listeners. According to the International Federation of the Phonographic Industry, \"No One\" is the eight biggest selling single of 2008 with sales over 5.6 million.\n\n\"No One\" was written and produced by Alicia Keys, Kerry Brothers, Jr., and George M. Harry. Keys told MTV News Canada that the song \"is really talking about the way that in relationships, the way that so many things are around you all the time to try to distract you. And even though people may talk and say whatever they may want to say, but then no one can get in the way of this.\" Keys said that it was a song that \"just wrote itself\". It was one of the last songs written for the album.\n\nThe song was first heard in August 2007 after Keys included a clip of the song in a newsletter on her official website and fan club. It was released officially on September 10, 2007, and its radio premiere was on Atlanta's WVEE on August 29. Keys performed a medley of \"No One\" with George Michael's \"Freedom! '90\" at the 2007 MTV Video Music Awards on September 9. Remixes of the song featuring Lil' Kim, Damian Marley, Junior Reid, Beenie Man, Barbee, and Kanye West exist. The official remix has a different but similar beat from the original version and features rapper Cassidy; it was produced by Swizz Beatz.\n\nThe song's music video, directed by Justin Francis, premiered on BET on September 24, 2007; it debuted on 106 and Park at number ten the following day, and has since peaked at number one. It premiered on Yahoo! Music on September 25 at number five and peaked at number one, and it premiered on Total Request Live on October 4 and peaked at number one. It debuted on VH1's VSpot Top 20 Countdown at number three, peaking at number one. The video was ranked at number twenty-two on VH1's \"Top 40 Videos of 2007\" and at number two on BET's \"Notarized: Top 100 Videos of 2007\".\n\nThe video for \"No One\" consists of four settings: the first one shows Keys lying on a chair in an empty room; the second one is a musical instrument-decorated room in which Keys sings accompanied by a Roland Jupiter-8 keyboard; in the third one Keys is initially alone, playing the piano on a rainy street, and she later finds herself surrounded with dozens of people; in the fourth and final one Keys is in a blue-lit nightclub. The video ends with a gear divided into four fractions, each one featuring a previously shown setting, and with Keys lying on the chair in the same room shown at the very beginning of the video.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wuqypq1342624333.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=rywUS-ohqeE", "strMusicVidDirector": "Justin Francis", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "257979400", "intMusicVidLikes": "703719", "intMusicVidDislikes": "19049", "intMusicVidFavorites": "0", "intMusicVidComments": "30977", "intTrackNumber": "4", "intLoved": "2", "intScore": "9.28571", "intScoreVotes": "7", "intTotalListeners": "687563", "intTotalPlays": "3867185", "strMusicBrainzID": "83fa4748-2c91-4981-b480-23a764d69fc7", "strMusicBrainzAlbumID": "b8387dc6-5576-3984-abea-8f54f7c53489", "strMusicBrainzArtistID": "8ef1df30-ae4f-4dbd-9351-1a32b208a01e", "strLocked": "Unlocked"}]}