{"track": [{"idTrack": "33339218", "idAlbum": "2160282", "idArtist": "119334", "idLyric": "447954", "idIMVDB": null, "strTrack": "Party Like A Rockstar", "strAlbum": "Rockstar Mentality", "strArtist": "Shop Boyz", "strArtistAlternate": null, "intCD": null, "intDuration": "253400", "strGenre": "Hip-Hop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Party Like a Rockstar\" is a rap song recorded by Shop Boyz. It was released as the lead single from their debut album Rockstar Mentality (2007). It reached high success during summer 2007 and was successful in the United States, peaking in the top five on the Billboard Hot R&B/Hip-Hop Songs, Hot Rap Tracks, and Hot 100 charts. The song was nominated for Best Rap Performance by a Duo or Group at the 50th Grammy Awards.\nThe song is based around two electric guitar riffs (taken from \"Crazy Train\" by Ozzy Osbourne). It also makes references to certain rock figures such as Marilyn Manson, The Osbournes, Kiss, Queen, Bruce Springsteen, Red Hot Chili Peppers, and Travis Barker.\nFor a time, \"Party Like a Rockstar\" was the most played rhythmic, and rap song in the United States, according to Radio & Records It was featured in the video game NBA Live 08.\nThe official remix features Lil Wayne, Jim Jones and Chamillionaire with more guitar riffs included. Jones' verse didn't make it to iTunes' remix, although Lil Wayne's verse and Chamillionaire's verse did. Another unofficial remix has been produced by Lil Jon and the Swedish composer Jay Orpin, who also wrote the first remix, but had Lil' Jon make changes for the beat for this remix. That remix has been unofficially called the Orpinz Old Duff WWE Remix because some feel it resembles a professional wrestlers entrance music. There is also a freestyle version by J. R. Writer of Dipset as well as a remix by Trina and another one by rapper Bow Wow.\nThe song gained some airplay in the UK on BBC Radio 1, and was added to the B-List on its playlist.\n\n\n\n\nThe video opens with a clip of the group performing doughnuts in a black 1968 Pontiac GTO. It then progresses to show the group performing at a crowded concert, with inter-mixed clips of an actual rock band playing and clips of the group performing in a hotel room reminiscent of Avenged Sevenfold's hit song Bat Country.\nCristal Athena Steverson from VH1's \"Flavor of Love\" and Flavor of Love Girls: Charm School appears in the song's music video.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=82vpIsQ3lX8", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "4582573", "intMusicVidLikes": "19094", "intMusicVidDislikes": "871", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "62006", "intTotalPlays": "273043", "strMusicBrainzID": "b4dd27b4-95ca-4cb5-9a29-a4cf937dc478", "strMusicBrainzAlbumID": "7d1c680c-0490-3bac-a0a4-686324862cc7", "strMusicBrainzArtistID": "bfad839c-ed95-4be6-bdf5-ae7578fb174e", "strLocked": "Unlocked"}]}