{"track": [{"idTrack": "32783461", "idAlbum": "2110811", "idArtist": "111882", "idLyric": "357380", "idIMVDB": "2147483647", "strTrack": "Say It Right", "strAlbum": "LOOSE", "strArtist": "Nelly Furtado", "strArtistAlternate": null, "intCD": null, "intDuration": "223080", "strGenre": "Pop", "strMood": "...", "strStyle": "...", "strTheme": "...", "strDescriptionEN": "\"Say It Right\" is a song by Canadian singer Nelly Furtado from her third studio album Loose (2006). Written by Furtado, Tim \"Timbaland\" Mosley and Nate \"Danja\" Hills, the song was inspired by, as Furtado described it, the \"spooky, keyboard-driven pop sound\" of the band Eurythmics, specifically their 1983 song titled, \"Here Comes the Rain Again\". The song released as the album's third single in North America and Australia (see 2006 in music). The song served as the album's fourth single in certain European and Asian countries. It was released digitally in the United Kingdom in March 2007. It was the album's fifth single in Latin America.\n\n\"Say It Right\" attained worldwide success, topping the charts in more than seven countries, including the United States, France, New Zealand and many European countries. The accompanying music video for the song, directed by Rankin & Chris, portrays Furtado singing in various costumes and in various locations. The song has been performed on a number of live appearances by Furtado, including her third headlining Get Loose Tour.\n\nIt received a Grammy Award nomination for Best Female Pop Vocal Performance at the 2008 Grammy Awards but lost to Amy Winehouse's \"Rehab\".\n\nThe process of creating the song began in the recording studio one morning at around 4:00 a.m., when Timbaland recommended that Furtado should go home because she was tired. Furtado, who had heard that the band U2 (a band she says she deeply admires) wrote many of their songs in the studio control room, said \"Really? I'll show you\", put on her hoodie and began to \"jam\". Nate Hills and Timbaland soon joined her, writing and producing as they went, and according to Furtado, this process intensified as she sang. The team used four microphones in the live room and moved them around during recording, about which Furtado said, \"...when you listen to it—there's a lot of dimension. It kind of sounds like  in another country\". Afterwards, they picked the best vocals and \"perfected\" them, before inserting \"reverbs and weird alien sounds\" onto them. \"e experimented a lot with depth and different sounds\", Furtado said of the making of the song. \" affected my vocals a whole lot.\"\n\n\"Say It Right\" is performed with a moderate techno groove and is written in F minor. It is set in common time; in 4/4 count. The chord progression is Fm–E♭–D♭–B♭m. Furtado's vocal range spans from Ab3 to F5. Furtado has cited the \"spooky, keyboard-driven pop sound\" of the band Eurythmics, particularly their 1983 song \"Here Comes the Rain Again\", as an influence on \"Say It Right\" and other tracks on Loose. \"I'm not 100 percent sure what  about, but it always takes me away to another place, and I love it\", she said. In fact the song deals with mystic or transcendental experiences as she explains in an interview in 2007. \"It is a kind of a magical song. It has a mystery to it, that I have not quite figured out. It has a haunting twist to it.\"\n\nIn other interviews she said that she does not really know what \"Say It Right\" is about, \"but it captures the feeling I had when I wrote it, and it taps into this other sphere.\" The song was played during the Miss Universe 2007 Introductory Ceremony, the 2006 American Music Awards, and Concert for Diana.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wwvvwu1404583778.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": "0", "intMusicVidComments": "0", "intTrackNumber": "8", "intLoved": "2", "intScore": "9.57143", "intScoreVotes": "7", "intTotalListeners": "745822", "intTotalPlays": "4937284", "strMusicBrainzID": "ac105a7f-c97b-4f9d-850f-46616f8cd915", "strMusicBrainzAlbumID": "09c235ff-b756-3ff7-8676-64c73f6e3217", "strMusicBrainzArtistID": "13655113-cd16-4b43-9dca-cadbbf26ee05", "strLocked": "Unlocked"}]}