{"track": [{"idTrack": "32740971", "idAlbum": "2111259", "idArtist": "111352", "idLyric": "485061", "idIMVDB": null, "strTrack": "Teardrops on My Guitar", "strAlbum": "Taylor Swift", "strArtist": "Taylor Swift", "strArtistAlternate": null, "intCD": null, "intDuration": "204000", "strGenre": "Country", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Teardrops on My Guitar\" is a song by American country pop singer-songwriter Taylor Swift. The song was co-written by Swift, alongside Liz Rose and produced by Nathan Chapman with Swift's aid. \"Teardrops on My Guitar\" was released on February 19, 2007 by Big Machine Records, as the second single from Swift's eponymous studio album, Taylor Swift (2006). The song was later included on the international release of Swift's second studio album, Fearless (2008), and released as the third single from the album in the United Kingdom. It was inspired by Swift's experience with Drew Hardwick, a classmate of hers for whom she had feelings. He was completely unaware and continually spoke about his girlfriend to Swift, something she pretended to be endeared by. Years afterwards, Hardwick appeared at Swift's house, but Swift rejected him. Musically, the track is soft and is primarily guided by a gentle acoustic guitar. Some critics have queried the song's classification as country music.\n\nCritics received the track generally positively, complimenting Swift's vocal delivery and songwriting style. The song is considered to be Swift's breakthrough single, as it spread her popularity throughout the United States. \"Teardrops on My Guitar\" was commercially successful, peaking at number 13 on the Billboard Hot 100, becoming the best-charting single from Taylor Swift on the chart. The single was also certified double platinum by the Recording Industry Association of America (RIAA). Its music video was directed by Trey Fanjoy and features Swift as she sees her love interest develop a relationship with another female. The video received a nomination for MTV Video Music Award for Best New Artist, but lost to Tokio Hotel's music video for \"Ready, Set, Go!\". The song was promoted through multiple live performances, some while supporting as opening act for various country artists' concert tours. She also performed \"Teardrops on My Guitar\" on her first headlining tour, the Fearless Tour (2009–10).", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uswvvw1389653105.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=xKCek6_dB0M", "strMusicVidDirector": "Trey Fanjoy", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "65547508", "intMusicVidLikes": "195761", "intMusicVidDislikes": "4989", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "3", "intLoved": "0", "intScore": "5", "intScoreVotes": "1", "intTotalListeners": "237175", "intTotalPlays": "1706928", "strMusicBrainzID": "c752885e-baae-412b-a8f7-b7a0bbf64597", "strMusicBrainzAlbumID": "ba1d0c2a-bb07-38bc-835c-a880f76f1309", "strMusicBrainzArtistID": "20244d07-534f-4eff-b4d4-930878889970", "strLocked": "Unlocked"}]}