{"track": [{"idTrack": "33014348", "idAlbum": "2133701", "idArtist": "111305", "idLyric": "0", "idIMVDB": null, "strTrack": "Umbrella", "strAlbum": "Good Girl Gone Bad", "strArtist": "Rihanna", "strArtistAlternate": "Robyn Rihanna Fenty", "intCD": null, "intDuration": "276000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Umbrella\" is a song recorded by Barbadian singer Rihanna, featuring a rap verse by Jay-Z. The song was written by The-Dream, Christopher Stewart, Kuk Harrell and Jay-Z, and was produced by Stewart for Rihanna's third studio album, Good Girl Gone Bad (2007). The song was originally written with recording artist Britney Spears in mind, however her label rejected it. \"Umbrella\" is a pop and R&B song and lyrically it refers to a romantic and platonic relationship and the strength of that relationship. It is also listed on The 500 Greatest Songs of All Time at 412.\n\n\"Umbrella\" was acclaimed by music critics, many of whom appreciated the \"ella, ella\" hook as well as the convincing vocals with which she delivered the chorus. Entertainment Weekly ranked the song number one on the 10 Best Singles of 2007, while Rolling Stone and Time listed the song at number three on the 100 Best Songs of 2007. The song has earned Rihanna several awards and nominations. In 2007, the song won two awards at the MTV Video Music Awards, when it was nominated for four. At the 50th Grammy Awards, \"Umbrella\" also earned Rihanna and Jay-Z a Grammy Award for Best Rap/Sung Collaboration in addition to receiving nominations for Record of the Year and Song of the Year.\nThe song serves as the lead single to the album, and was released worldwide on March 29, 2007 through Def Jam Recordings. \"Umbrella\" was a commercial success, topping the charts in Australia, Canada, Germany, the Republic of Ireland, Sweden, Switzerland, the United Kingdom, and the United States. In the United Kingdom, where the song's chart performance generated controversy when the country was experiencing excessive flooding and large amounts of rain at the time, it is deemed an iconic song and was one of the most played songs on radio in the 2000s (decade). It managed to stay at number one on the UK Singles Chart for ten consecutive weeks, the longest run at number one for any single of that decade. The single was one of the highest digital debuts in the United States and remained at the top of the US Billboard Hot 100 for seven consecutive weeks.\n\nThe single's accompanying music video was directed by Chris Applebaum and features Rihanna's nude body covered in silver paint. The video earned Rihanna a Video of the Year at the 2007 MTV Video Music Awards and Most Watched Video on MuchMusic.com at MuchMusic Video Awards. Along with countless amateurs, \"Umbrella\" has been covered by several notable performers from a variety of musical genres, including Taylor Swift, All Time Low, McFly, OneRepublic, Mike Shinoda of Linkin Park, Vanilla Sky and The Baseballs. Rihanna performed the song at the 2007 MTV Movie Awards, 2008 BRIT Awards and was the closing song of the Good Girl Gone Bad, Last Girl on Earth, and Loud Tours.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xyyqtu1359565159.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=CvBfHwUxHIk", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "151913007", "intMusicVidLikes": "344958", "intMusicVidDislikes": "18979", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "973444", "intTotalPlays": "5451592", "strMusicBrainzID": "0b4b1b0c-e057-4d8d-9a47-12a97ff6fb3d", "strMusicBrainzAlbumID": "7e48f018-b774-32e6-a68b-b42db04535c0", "strMusicBrainzArtistID": "73e5e69d-3554-40d8-8516-00cb38737a1c", "strLocked": "Unlocked"}]}