{"track": [{"idTrack": "32780532", "idAlbum": "2114807", "idArtist": "111828", "idLyric": "271690", "idIMVDB": null, "strTrack": "Breakaway", "strAlbum": "Breakaway", "strArtist": "Kelly Clarkson", "strArtistAlternate": null, "intCD": null, "intDuration": "237840", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Breakaway\" is a song recorded by American singer Kelly Clarkson. The song, written by Matthew Gerrard, Bridget Benenate and Avril Lavigne, was originally intended for Lavigne's debut studio album, Let Go (2002). After being deemed unsuitable for the album, it was passed to Clarkson to be recorded as a soundtrack for the film The Princess Diaries 2: Royal Engagement. Clarkson, who was finishing her second studio album at that time, recorded \"Breakaway\" to tide her fans over until the first single from her new album was released. However, the song's success prompted its inclusion on Clarkson's second album where she decided to name the album after the song. \"Breakaway\" was first released by Walt Disney Records as the first single from The Princess Diaries 2 soundtrack on July 19, 2004.\n\n\"Breakaway\" was positively received by music critics, who complimented the song's universal message and its simple lyrics where people could relate to. It incorporates acoustic guitars and airy drums which are interspersed with Clarkson's controlled voice. The lyrics narrate Clarkson's journey as a girl growing up in a small town who follows her dream for self-improvement. \"Breakaway\" was a commercial success outside of the United States, where it peaked within the top 20 of multiple European counties, and in the top 10 in Australia, Belgium, Hungary and the Netherlands. In the US, the song peaked at number six on the Billboard Hot 100 chart and became her third top ten song in the chart. It also topped the US Adult Contemporary for 21 non-consecutive weeks, a record that is now shared between herself and Celine Dion's \"A New Day Has Come\".\n\nDirected by Dave Meyers, the accompanying music video for \"Breakaway\" portrays Clarkson as a young girl from a small town who follows her dream and becomes an international star. It also contained scenes interspersed from The Princess Diaries 2: Royal Engagement. Clarkson acted out most of the lyrics in the music video because she felt that the song was autobiographical. Critics responded positively to the music video for being faithful to the central theme shared by the song, the film, and Clarkson's personal biography. Clarkson performed the song in a series of live appearances such as television shows Saturday Night Live, The Oprah Winfrey Show and The Tonight Show with Jay Leno. She has performed the song in her concert tours, including the Stronger Tour. \"Breakaway\" has also been covered by many contestants from reality television singing competitions, notably Katie Stevens, a contestant in the ninth season of American Idol, as well as an English pop duo, Belle Amie who finished eleventh in the seventh season of The X Factor.\n\nThe accompanying music video for \"Breakaway\" was directed by Dave Meyers, which was shot in two days from July 10 to July 11, 2004.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wqxyyw1383077673.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=c-3vPxKdj6o", "strMusicVidDirector": "David Meyers", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "33214366", "intMusicVidLikes": "118021", "intMusicVidDislikes": "1901", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "539435", "intTotalPlays": "2936943", "strMusicBrainzID": "166b84d6-a912-4534-8de9-248364331c1c", "strMusicBrainzAlbumID": "0d0ddce6-a611-3dc0-923c-60ac3da72ad8", "strMusicBrainzArtistID": "d339efbb-77b9-4147-ba9e-59f2f24550b2", "strLocked": "Unlocked"}]}