{"track": [{"idTrack": "32839087", "idAlbum": "2119565", "idArtist": "112595", "idLyric": "9731", "idIMVDB": null, "strTrack": "Locked Up", "strAlbum": "Trouble", "strArtist": "Akon", "strArtistAlternate": null, "intCD": null, "intDuration": "236226", "strGenre": "R&B", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Locked Up\" is the debut single by American singer Akon, taken as the lead single from his debut studio album, Trouble. The single was released in 2004, reaching #8 on the Billboard Hot 100 in the United States and #4 on the UK Singles Chart in the United Kingdom, becoming his first Top 10 hit in both countries.\n\nAlthough it was widely regarded that \"Lonely\" offered the album's best option in terms of commercial breakthrough, SRC Records A&R and producer Knobody chose \"Locked Up\" as the first single because he wanted to break Akon in the streets first, and then work towards a cross-over. In an interview for HitQuarters, he claimed: \"Locked Up\" is a street record. I thought that was the place for us to start to get a fan-base, knowing that weight. We thought really carefully about the record, what touches people and will get people's attention - so we added references of his kin and kith sending him magazines, money-orders, to visit him, ask where his lawyer is, accept his phone calls and ask where're my niggaz on lockdown?.\n\nThe song was designed a breakout hit for Akon, something that could shape the future of his personal life and widely successful musical career. I worked on what I call \"drops\"  “ points in the record where it feels different, to break the monotony and make it a little more interesting.\" Knobody produced an alternate of the song, featuring Taz & Styles P, which appears as both a b-side on the single and as a bonus track on the UK version of the album. In 2004, T-Pain sampled the song in a parody recording \"I'm Fucked Up\". In 2005, the song was sampled in the track \"Won't Let Me Out\" by C-Murder. A music video was produced to promote the single. The video was directed by FlyyKai, and was edited to both the album version and the remix featuring Taz & Styles P.\n", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xrtysr1345028318.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=14PgWitIbSk", "strMusicVidDirector": "Flyy Kai", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "44257587", "intMusicVidLikes": "73713", "intMusicVidDislikes": "2919", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "0", "intScore": null, "intScoreVotes": null, "intTotalListeners": "151292", "intTotalPlays": "438640", "strMusicBrainzID": "03e3c38d-f151-4d5f-a1c1-56ec84915d06", "strMusicBrainzAlbumID": "d516fab2-65e2-3c4b-b576-9c30a5b94d00", "strMusicBrainzArtistID": "1138a764-2212-4d0a-b02d-0dc14df91e08", "strLocked": "Unlocked"}]}