{"track": [{"idTrack": "32760340", "idAlbum": "2113164", "idArtist": "111522", "idLyric": "319957", "idIMVDB": "0", "strTrack": "This Love", "strAlbum": "Songs About Jane", "strArtist": "Maroon 5", "strArtistAlternate": null, "intCD": null, "intDuration": "206786", "strGenre": "Pop-Rock", "strMood": "Gentle", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"This Love\" is a song by the American rock band Maroon 5. The song was written by frontman Adam Levine and keyboardist Jesse Carmichael for their debut album, Songs About Jane (2002). The track is built around a piano-led strut, which is immediately followed by synth percussion, and a repeating guitar sound.\n\nThe song's lyrics are based on Levine's break-up with an ex-girlfriend. He revealed that the song was written in the \"most emotionally trying time\" in his life. He has also described that the lyrics in this song are extremely erotic. \"This Love\" was critically acclaimed by music critics, who noted the track's musicscape. It was released on January 27, 2004, as the second single from Songs About Jane.\n\nThe music video for \"This Love\" premiered on MTV's Total Request Live on January 6, 2004. Directed by Sophie Muller, the video combines performance footage from the band in a courtyard built at Mack Sennett Studios and scenes of Adam Levine parting ways with a woman. According to Levine, the concept behind the music video was based on Prince. \"An overt sexuality confuses people, too. That video was a very 'pop star' thing to do.\" The music video also features Levine and his then-girlfriend, model Kelly McKee in a few intimate scenes. The video used creative camera angles, in an effort to avoid action from the Federal Communications Commission for television broadcasts. A version of the video where a stream of computer-generated flowers obscure the screen further was also created. When asked about the video, Levine said: \"It was surprisingly not weird and surprisingly not sexual. It was totally comfortable. I didn't get horny or anything, which was weird since I shot it with my girlfriend.\" Still, the video was seen as controversial, with Sylvia Patterson of The Daily Telegraph describing it as \"a porno-pop video\". Bass player Michael Madden, asked to comment on the video's reception, referred to the controversy as \"an absurd over-reaction.\"", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/ryvtyp1484321158.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=XPpTgCho5ZA", "strMusicVidDirector": "Sophie Muller", "strMusicVidCompany": "Oil Factory", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "162566502", "intMusicVidLikes": "811710", "intMusicVidDislikes": "18380", "intMusicVidFavorites": "0", "intMusicVidComments": "29803", "intTrackNumber": "2", "intLoved": "2", "intScore": "10", "intScoreVotes": "6", "intTotalListeners": "1115658", "intTotalPlays": "6308813", "strMusicBrainzID": "38dc35cd-6023-43c5-a968-3a932c22517d", "strMusicBrainzAlbumID": "93d5a1d1-73c0-34d3-b7f1-49473c48face", "strMusicBrainzArtistID": "0ab49580-c84f-44d4-875f-d83760ea2cfe", "strLocked": "Unlocked"}]}