{"track": [{"idTrack": "32773094", "idAlbum": "2114206", "idArtist": "111709", "idLyric": "132006", "idIMVDB": "0", "strTrack": "White Flag", "strAlbum": "Life for Rent", "strArtist": "Dido", "strArtistAlternate": null, "intCD": null, "intDuration": "242293", "strGenre": "Pop", "strMood": "Bittersweet", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"White Flag\" is a song by English singer-songwriter Dido, released as the lead single from her second studio album Life for Rent on 1 September 2003. The song is considered one of her signature songs, and helped Life for Rent sell over ten million copies worldwide. The song was nominated for the Best Female Pop Vocal Performance at the 46th Grammy Awards, but lost to Christina Aguilera's \"Beautiful\". It won the Best British Single at the 2004 Brit Awards.\n\nThe song ranked on Blender's list \"The 500 Greatest Songs Since You Were Born\" at number 317. The single fared very well on the charts around the world, peaking at number one in Australia, Austria, Germany, Italy, and Norway; number two on the Irish Singles Chart, and number 18 on the US Billboard Hot 100. The song reached number two in the UK being kept off the top spot by the UK top selling single of the year, \"Where Is the Love?\". The music video, directed by Joseph Kahn features actor David Boreanaz as Dido's love interest.\n\nThe song has been used in several TV series, Smallville, The Inbetweeners, Medium, The Sopranos, Tru Calling, Cold Case, Winners & Losers, and films Perfect Stranger and Mommy. Carly Rae Jepsen performed a cover version of the song on Canadian Idol.\n\n\"White Flag\" was written and produced by Dido, Rollo Armstrong and Rick Nowels. In the song, the protagonist is unwilling to give up, even if they know his or her relationship is over. Regarding the lyric \"I will go down with the ship,\" it is a well-known fact that, if a ship was sinking, the captain of the ship would stay on the ship and sink with it. In a battle, a white flag signals surrender. With regard to the lyric \"there will be no white flag above my door,\" in the 17th Century, if a captain of a ship wanted to surrender, he would hang a white flag outside the captain's cabin, above the cabin's door - this white flag would signal to the victors that the captain has surrendered and is waiting peaceably inside his cabin to be captured. By stating there will be \"no white flag,\" she indicates that she will not deny her feelings of love or pretend that they are gone. Dido wrote the song about a past relationship, but later said that she initially regretted writing it because it caused more problems with the person involved. However, she has said that she now likes to perform the song.\n\n\"White Flag\" begins with a lone synth-chord reminiscent of Sinéad O'Connor's \"Nothing Compares 2 U\". It features \"multi-layered\" sound, delicate piano outro, and strings. According to the sheet music published at Musicnotes.com, it is written in the key of D minor with a tempo of 90 beats per minute, and Dido's vocals range from the low note of A3 to the high note of C5.\n\nThe music video, directed by Joseph Kahn, features actor David Boreanaz as Dido's love interest. The video tells a story about a relationship that is over, but both still in love with each other, meeting everywhere that they go and trying to not see each other. At the end of the video, they return to their apartments and Dido's room is filled with David's photos and David's room is filled with Dido's photos.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vyxuyp1487241607.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=j-fWDrZSiZs", "strMusicVidDirector": "Joseph Kahn", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "69175649", "intMusicVidLikes": "240759", "intMusicVidDislikes": "5012", "intMusicVidFavorites": "0", "intMusicVidComments": "14034", "intTrackNumber": "1", "intLoved": "1", "intScore": "9.5", "intScoreVotes": "6", "intTotalListeners": "641949", "intTotalPlays": "3811803", "strMusicBrainzID": "fa807069-541b-4d6b-855c-6973a95cc9f5", "strMusicBrainzAlbumID": "11402345-2ebb-3d1a-bb01-251b7233cbc8", "strMusicBrainzArtistID": "d1353a0c-26fb-4318-a116-defde9c7c9ad", "strLocked": "Unlocked"}]}