{"track": [{"idTrack": "32743411", "idAlbum": "2111487", "idArtist": "111373", "idLyric": "322112", "idIMVDB": "0", "strTrack": "Family Affair", "strAlbum": "No More Drama", "strArtist": "Mary J. Blige", "strArtistAlternate": "Mary J Blige", "intCD": null, "intDuration": "265866", "strGenre": "R&B", "strMood": "Political", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Family Affair\" is a song by American recording artist Mary J. Blige. It was written by Blige, her brother Bruce Miller, Camara Kambon, Michael Elizondo, and Dr. Dre for her fifth studio album No More Drama (2001), while production was overseen by the latter. \"Family Affair\" is a pumping dance-pop song that incorporates elements of hip hop and R&B. The music for the track was originally created in a jam session between Dre and musicians Mel-Man, Camara Kambon, Mike Elizondo and Scott Storch. Later, Blige heard the song that her brother Bruce Miller, Asiah The Continent and Luchi Lodge created the lyrics and melody to and decided on recording her vocals.\n\nThe single topped the Billboard Hot 100 for six weeks starting from November 3, 2001, ending a ten-week lockup of the top two positions on the chart by Alicia Keys' \"Fallin'\" and Jennifer Lopez's \"I'm Real (Murder Remix)\", which combined have spent the previous eleven weeks atop the chart. It was Blige's first Hot 100 number-one single. In 2008, for Billboard magazine's 50th Anniversary, \"Family Affair\" was listed as the 79th-biggest single on the Billboard Hot 100 All-Time Top Songs. while at the end of 2009 was named the 12th most successful song from 2000 to 2009, on the Billboard Hot 100 Songs of the Decade. Rolling Stone ranked it number ninety-five on their list of 100 Best Songs of the 2000s decade. The song was also responsible for the brief comeback of a new form of hip hop soul, a genre that she pioneered in the early 1990s.\n\nThe accompanying music video was directed by Dave Meyers. In 2007, this song was used on a Propel Fitness Water commercial. On September 6, 2012, Blige performed the song at the final night of the Democratic National Convention in Charlotte, North Carolina.\n\nA remix featuring rappers Jadakiss and Fabolous was later released promotionally but never commercially\n\n\"Family Affair\" was written by Blige, her brother Bruce Miller, Camara Kambon, Mike Elizondo, and Dr. Dre. Production was helmed by the latter. Dre created an initial version of the musical portion of \"Family Affair\" in studio on September 13, 2000, using a bass player and a keyboard player. His studio engineers entitled this version of the song \"Fragile\" for record-keeping purposes. Near the end of 2000, he sent Blige the instrumental track. Blige recorded vocals over the music based on lyrics penned by Miller, Kambon and Elizondo. Several weeks later, on January 10, 2001, a near-final but non-lyrical portion of \"Fragile\" was transferred from digital to analog format and renamed \"Family Affair.\" In late May or early June 2001, at Dr. Dre's suggestion, Blige added a bridge to the song, for she penned the lyrics on the own.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/tsrupq1484072121.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "Dave Meyers", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": "0", "intMusicVidComments": "0", "intTrackNumber": "2", "intLoved": "2", "intScore": "10", "intScoreVotes": "6", "intTotalListeners": "401941", "intTotalPlays": "1373316", "strMusicBrainzID": "c0d6b00e-45f2-438b-b54e-a067ff55c65e", "strMusicBrainzAlbumID": "3b158502-4f45-309f-9624-818d7ff613ce", "strMusicBrainzArtistID": "db76c5ca-d555-4f09-b1db-baa1b713d875", "strLocked": "Unlocked"}]}