{"track": [{"idTrack": "32925181", "idAlbum": "2126290", "idArtist": "111349", "idLyric": "160243", "idIMVDB": "0", "strTrack": "Hero", "strAlbum": "Escape", "strArtist": "Enrique Iglesias", "strArtistAlternate": null, "intCD": null, "intDuration": "266346", "strGenre": "Latin", "strMood": "Enlightened", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Hero\" is a song by Spanish singer Enrique Iglesias from his second English-language studio album Escape (2001). It was written by Iglesias, Paul Barry and Mark Taylor. Iglesias first released the song to radio on 3 September 2001 to a positive critical and commercial reception. To the date the single has sold 8 million copies worldwide.\n\nAfter the September 11 attacks on the World Trade Center, which took place eight days after the song's release, it was one of the few songs chosen by radio DJs in New York City to be remixed with audio from police, firefighters, civilians at Ground Zero, and politicians commenting on the attacks. Iglesias was asked to sing the song live at America: A Tribute to Heroes. He had performed the song earlier at that year's Miss Venezuela, but due to the terrorist attacks the show was not aired on television.\n\nThe American television series Glee featured a version of the song as a mashup mixed with the Gipsy Kings' \"Bamboléo\". The release from the twelfth episode (called \"The Spanish Teacher\") in season 3 of the show is named \"Bambolero/Hero\". The main vocals were done by Chord Overstreet (playing the character Sam Evans). An Italian version of this song was covered by Micheal Castaldo, in his studio album Bergamot.\n\nIglesias stated that his high school days were the inspiration for the song. During a 2013 radio interview with Ryan Seacrest, he stated, \"I went back to when I was 17 in high school, and this might be cheesy, but I thought about what would be the song I want to slow dance to with my prom date. When I wrote it, it felt good and ... I thought I know there is something special in this song.\"\n\n\"Hero\" was first released on 3 September 2001, just eight days prior to the September 11 attacks on the World Trade Center. Due to the song's subject matter, it was one of the few songs chosen by radio DJs in New York City to be remixed with audio from police, firefighters, civilians at Ground Zero, and politicians commenting on the attacks. Iglesias was also asked to sing the song live at the America: A Tribute to Heroes, which took place on September 21. His performance was broadcast from a warehouse in New York alongside Bruce Springsteen, Bon Jovi, and Sheryl Crow. The location of the warehouse was kept secret in case of further attacks. It was Iglesias's first televised performance of the song. He had performed the song earlier at that year's Miss Venezuela, but due to the terrorist attacks the show was not aired on television.\n\nThe song has a meaning of love and assurance with a desire to be a hero for the love of a woman.\n\nThe music video for \"Hero\" was directed by Joseph Kahn. It features Iglesias as an honorable criminal hunted by his enemies, whilst Jennifer Love Hewitt plays his love interest and Mickey Rourke plays one of the men hunting him. The video follows Iglesias and Hewitt running from their enemies in the desert. Finally, Iglesias' enemies track him down and confront him outside a church. The confrontation leads to Iglesias being floored by Rourke, before being struck with a baton. The video skips ahead where Iglesias and Hewitt are seen in the rain surrounded by police cars. Iglesias, though heavily injured, walks towards Hewitt and breaks down beside her. The video ends with Iglesias' death.\n\nIn addition to this video, a second video was made for the UK with less violence. The final shot of this video shows Iglesias' legs moving, suggesting that he's not dead. While originally made for the UK, this version has since replaced the original video on many music video stations throughout the world. It is also the version shown on Vevo and YouTube.\n\nAs of January 2017,the video has been viewed over 234 million times on YouTube.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=koJlIGDImiU", "strMusicVidDirector": "Joseph Kahn", "strMusicVidCompany": "SuperMega", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "239668724", "intMusicVidLikes": "753374", "intMusicVidDislikes": "29110", "intMusicVidFavorites": "0", "intMusicVidComments": "47693", "intTrackNumber": "4", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "325178", "intTotalPlays": "1717335", "strMusicBrainzID": "f910bd67-98c0-4a99-aaf1-19557f53921c", "strMusicBrainzAlbumID": "43fd822c-5f5c-36fd-a401-ae92aeea1d45", "strMusicBrainzArtistID": "35f866dc-c061-48ba-8157-cf2e0eac4857", "strLocked": "Unlocked"}]}