{"track": [{"idTrack": "32783471", "idAlbum": "2115043", "idArtist": "111882", "idLyric": "357362", "idIMVDB": "0", "strTrack": "I'm Like a Bird", "strAlbum": "Whoa, Nelly!", "strArtist": "Nelly Furtado", "strArtistAlternate": null, "intCD": null, "intDuration": "243173", "strGenre": "Pop", "strMood": "Happy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"I'm Like a Bird\" is a song written by Canadian singer-songwriter Nelly Furtado, and produced by Gerald Eaton and Brian West, as the first single from her first album, Whoa, Nelly!.\n\nIt was one of the most successful singles of 2001, peaking at number one on the Canadian Singles Chart, as well as number two in Australia and New Zealand, number five in the United Kingdom, and number nine in the United States.\n\nThe song received very positive reviews from music critics for Furtado's singing and the empowering lyrics, and became one of the most critically acclaimed songs of 2001. Many also consider it to be her signature song; Furtado herself commented \"There's a simplicity about it that I love,\" and \"It's my freedom song\". The song was nominated for the Grammy Award for Song of the Year and won the Grammy Award for Best Female Pop Vocal Performance, making Furtado the first female act to win the award for her debut single since Mariah Carey did so ten years earlier and the last to be awarded to a Canadian artist winner in the category. It also won the Juno Award for Single of the Year.\n\n\"I'm Like a Bird\" is composed common time in the key of B♭ major. The song moves at 90 beats per minute, and Furtado's voice spans around an octave and a half, from F3 to B♭4. It is written in verse-chorus form, with a bridge before the second chorus.\n\nIn 2006 Furtado said of the song, \"I've heard it sung at karaoke or by cover bands and it was awesome — I was like, wow, I've got one of those songs. Somebody once called it a 'hairbrush song', one that girls and guys sing in front of the mirror with their hairbrush. I just think I'm lucky I have it — it's paying the bills!\"\n\nMusic video\nThe music video for \"I'm Like a Bird\" was directed by Francis Lawrence. The video begins in the sky where the camera slowly pans down onto Furtado, who is lying in the grass. It then shows her singing on a tree trunk in mid-air. In the chorus she gets up and starts singing to the camera while birds are flying around her. The second verse shows her sitting in mid-air in a forest, while singing to the camera. The chorus consists of flashes of Furtado singing in mid-air, again, while leaning on the tree trunk. During the bridge she is singing to a bug while her eyes change colour. The conclusion of the video shows her falling backwards from a branch into a crowd as she sings the final chorus of the song. The last shot pans out to reveal a crowd of tens of thousands.\n\nThere was made an edited version of the music video for European VH1, where some scenes where changed.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rvpryp1488467667.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=roPQ_M3yJTA", "strMusicVidDirector": "Francis Lawrence", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "42517462", "intMusicVidLikes": "153504", "intMusicVidDislikes": "4546", "intMusicVidFavorites": "0", "intMusicVidComments": "9583", "intTrackNumber": "5", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "446885", "intTotalPlays": "1889531", "strMusicBrainzID": "3071d0c6-4f58-402a-96ad-9bdadcbaa264", "strMusicBrainzAlbumID": "9713ae12-a4e5-3fbb-a660-d152390430ce", "strMusicBrainzArtistID": "13655113-cd16-4b43-9dca-cadbbf26ee05", "strLocked": "Unlocked"}]}