{"track": [{"idTrack": "32724256", "idAlbum": "2109621", "idArtist": "111240", "idLyric": "244060", "idIMVDB": "0", "strTrack": "Love Don't Cost a Thing", "strAlbum": "J.Lo", "strArtist": "Jennifer Lopez", "strArtistAlternate": null, "intCD": null, "intDuration": "222493", "strGenre": "Pop", "strMood": "In Love", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Love Don't Cost a Thing\" is a song recorded by American singer Jennifer Lopez for her second studio album, J.Lo (2001). It was released on December 2, 2000 by Epic Records as the lead single from the album. The song was written by Damon Sharpe, Georgette Franklin, Jeremy Monroe, Amille D. Harris, and Greg Lawson, and was produced by Ric Wake, Richie Jones, and Cory Rooney. At the time of the song's release, Lopez was transitioning into a sex symbol and in a relationship with American rapper Sean Combs. Lyrically, \"Love Don't Cost a Thing\" is described as an \"exploration of love\" in which Lopez is unhappy about her materialistic lover; provoking much media analysis as to whether or not it was an innuendo towards Combs. Ultimately, the pair's courtship ended shortly after its release. Described as \"frothy\" and \"catchy\" by critics, it was noted for its message about love and commercial appeal to women.\n\n\"Love Don't Cost a Thing\" was met with worldwide commercial success, and is considered \"classic Lopez\". It peaked within the top ten in the United States and foreign markets including Australia, France, Germany and Ireland, as well as peaking at number one in Canada, New Zealand and the United Kingdom, among other countries. \"Love Don't Cost a Thing\" was also a radio hit, becoming her first single to top the American Hot 100 airplay chart. The music video for \"Love Don't Cost a Thing\" directed by Paul Hunter and choreographed by Darrin Dewitt Henson was met with acclaim, garnering MTV Video Music Award and ALMA Award nominations. It became one of the year's most-viewed clips, and was highly requested on the music video broadcasting series, Total Request Live. The music video subsequently became notorious after Lopez married Cris Judd, one of the back-up dancers who appeared in it. Lopez has performed \"Love Don't Cost a Thing\" live on numerous occasions, including the 2000 MTV Europe Music Awards and the 2001 MTV Video Music Awards in New York City, held days before 9/11.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/txsrps1487239394.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=4kGvlESGvbs", "strMusicVidDirector": "Paul Hunter", "strMusicVidCompany": "Mars Media", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "66713620", "intMusicVidLikes": "185315", "intMusicVidDislikes": "7399", "intMusicVidFavorites": "0", "intMusicVidComments": "8225", "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "319075", "intTotalPlays": "1024914", "strMusicBrainzID": "12e73e39-c206-493a-946b-aecacd268125", "strMusicBrainzAlbumID": "2b65c975-43ed-3748-8ec1-280b81133c11", "strMusicBrainzArtistID": "f0602f55-1770-483d-89bd-4bae0d0ac086", "strLocked": "Unlocked"}]}