{"track": [{"idTrack": "32826774", "idAlbum": "2118564", "idArtist": "111332", "idLyric": "145296", "idIMVDB": null, "strTrack": "Come Undone", "strAlbum": "Duran Duran", "strArtist": "Duran Duran", "strArtistAlternate": null, "intCD": null, "intDuration": "278733", "strGenre": "New Wave", "strMood": "Dreamy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Come Undone\" is a song by British band Duran Duran. It was released in March 1993 as the second single from the album Duran Duran (The Wedding Album). It is their 24th single overall.\n\nWith their commercial and critical success reestablished by the previous single \"Ordinary World\", \"Come Undone\" continued to showcase more of the band's entry into the adult contemporary radio format. The single proved to be the group's second consecutive US top-ten hit from The Wedding Album, peaking at number seven on the Billboard Hot 100. It was also popular in the United Kingdom and other international markets, reaching number two in Canada, number eight in Italy, number nine in Ireland, and number 13 in the UK.\n\nBackground\nThe group's guitarist at the time, Warren Cuccurullo, is credited with developing the instrumentation for \"Come Undone\", most importantly its guitar hook, which he developed while trying to do a re-interpretation of \"First Impression\" from their 1990 album Liberty. In 2005, Cuccurullo revealed to author Steve Malins that he and Nick Rhodes had originally planned on using the song for a project outside of Duran Duran with Gavin Rossdale, but had changed plans when singer Simon Le Bon took a liking to the music and began to come up with lyrics on the spot.\n\nRhodes expanded on the song's creation during the album's 20th anniversary in 2013.\n\nIt was something that Warren and I started writing alongside some other stuff that we'd been playing around with, and Simon came in and heard what we were doing. He said, 'Wow, I love that!' And so it became a Duran Duran song.  came up with a really great melody – we already had the 'can't ever keep from falling apart' section – and he very quickly made it his, or himself part of it\".\n\nThe song was included as a last minute addition to their self-titled album in 1993, with the lyrics being written by Le Bon as a gift for his wife, Yasmin.\n\nThe group's bassist, John Taylor, did not actually play bass on this track, although he does in the music video. Nick Rhodes and John Jones both contributed synth bass on the track during his absence. Tessa Niles was credited with backing vocals. The song also contains a sample from The Soul Searchers' song \"Ashley's Roachclip\".\n\nAccording to John Jones,\n\nAt the time we had completed and mastered the Wedding Album and had started the cover album \"Thank You\". One day we took the drum loop and bass groove from a demo of mine called \"Face to Face\" and added the ultra cool guitar riff that Warren had come up with for a new \"cover\" version of \"First Impression\". After a couple of hours of tweaking we played the track over the phone to Capitol in Los Angeles and they loved it and said they wanted it on the Wedding album! When Nick arrived that afternoon the intro was carved into a song that we played to Simon that night. He was back the next day with the lyrics and the melody and I think we finished the vocals the day after that. On the fourth day we finished the track detail and sent it to David Richards in Switzerland to be mixed.\n\nLamya Al-Mugheiry sang the backing vocals in the Unplugged version of the song for MTV in November 1993, and during their \"Wedding Album\" tour. Tessa Niles sang background vocals on the actual recording.\n\nMusic video\nThe \"Come Undone\" video was directed by Julien Temple. Shots of the band were filmed in the London Aquarium, prominently featuring Sharks; these were interspersed with short vignettes of people \"coming undone\" in various ways. These vignettes include a little girl seeing her parents together, an older couple who have survived a flood, a little girl hiding under the bed while placing her head on top of her white teddy bear, an alcoholic and a man who is revealed to be a cross-dresser. Also seen in the video is a woman struggling underwater to break free of the chains that bind her. LeBon and Taylor's Vivienne Westwood wardrobe were likely a nod to the band's early New Romantic era.\n\nA portion of the music video can be seen in the \"No Laughing\" episode of the MTV show Beavis and Butt-Head, which was aired on July 1993.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "https://www.youtube.com/watch?v=Epj84QVw2rc", "strMusicVidDirector": "Julien Temple", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "132636856", "intMusicVidLikes": "649343", "intMusicVidDislikes": "25750", "intMusicVidFavorites": "0", "intMusicVidComments": "21716", "intTrackNumber": "6", "intLoved": "5", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "290247", "intTotalPlays": "1738112", "strMusicBrainzID": "68ce02c1-aa32-4d7c-8e97-8ed2b588dc49", "strMusicBrainzAlbumID": "faedc66c-59ae-36ee-a89d-9dda4a9ea393", "strMusicBrainzArtistID": "1a1cd7f3-e5df-4eca-bae2-2757c9e656b5", "strLocked": "Unlocked"}]}