{"track": [{"idTrack": "32728165", "idAlbum": "2110034", "idArtist": "111268", "idLyric": "6270", "idIMVDB": "0", "strTrack": "Cryin'", "strAlbum": "Get a Grip", "strArtist": "Aerosmith", "strArtistAlternate": null, "intCD": null, "intDuration": "308440", "strGenre": "Hard Rock", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Cryin'\" is a song by American hard rock band Aerosmith. It was written by Steven Tyler, Joe Perry, and Taylor Rhodes. It was released by Geffen Records in October 1993 as a single from their April release, Get a Grip. The single went gold and sold 600,000 copies. The song's music video features Alicia Silverstone, Stephen Dorff and Josh Holloway.\n\nThe music video for the song, directed by Marty Callner, features the first appearance of Alicia Silverstone in the band's videos, as well as the band performing in the Central Congregational Church in Fall River, Massachusetts. The Central Congregational Church also happens to be the same church that Lizzie Borden attended.  The song flashes back and forth between the band and Alicia Silverstone, who plays a teen who has a falling out with her boyfriend (played by Stephen Dorff) after catching him cheating. She feigns an attempt to kiss him, but instead leans away annoying him. She then punches him and shoves him out of the car leaving him in the dust. She begins a phase of rebellion and individuality and gets a navel piercing, which has largely been credited as introducing navel piercing to mainstream culture. After having her purse stolen by another young man (played by then-unknown Josh Holloway of Lost), she chases him down and knocks him to the ground. The video then cuts to her standing on the edge of an overpass bridge, contemplating jumping. Her ex-boyfriend arrives on the scene, along with numerous police officers, encouraging her to come down from the overpass. She jumps, but a rope is revealed, arresting her fall and leaving her dangling over the freeway, laughing at Dorff's character. The video ends with the dangling Silverstone looking up at Dorff and giving him the finger.\n\nThe video was a smash success on MTV, becoming one of the most requested videos in 1993, and earning the band several awards at the Video Music Awards.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rwvvpu1435177228.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=qfNmyxV2Ncw", "strMusicVidDirector": "Marty Callner", "strMusicVidCompany": "Cream Cheese Productions", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "9", "intLoved": "1", "intScore": "9.85714", "intScoreVotes": "7", "intTotalListeners": "561489", "intTotalPlays": "2930681", "strMusicBrainzID": "c59758a1-940c-409d-9a0d-bde97048d5ad", "strMusicBrainzAlbumID": "73c6a7b0-1dc2-3ddc-a720-c29505271711", "strMusicBrainzArtistID": "3d2b98e5-556f-4451-a3ff-c50ea18d57cb", "strLocked": "Unlocked"}]}