{"track": [{"idTrack": "32926496", "idAlbum": "2126390", "idArtist": "112696", "idLyric": "529803", "idIMVDB": "0", "strTrack": "I Will Always Love You", "strAlbum": "The Greatest Hits", "strArtist": "Whitney Houston", "strArtistAlternate": null, "intCD": null, "intDuration": "267000", "strGenre": "Soul", "strMood": "In Love", "strStyle": "Urban/R&B", "strTheme": "In Love", "strDescriptionEN": "\"I Will Always Love You\" is a song written, composed, and originally recorded by American singer-songwriter Dolly Parton. The country track was released on June 6, 1974 as the second single from Parton's thirteenth solo studio album, Jolene (1974). The singer wrote the song, which was recorded on June 13, 1973, for her one-time partner and mentor Porter Wagoner, from whom she was professionally splitting at the time.\n\n\"I Will Always Love You\" received positive reviews from critics and attained commercial success, twice reaching number one on the Billboard Hot Country Songs chart. First, in June 1974 and a 1982 rerecording of the song also reached number one October of that year. With that accomplishment, Parton became the first artist ever to earn a number one record twice with the same song. The song also won Parton Female Vocalist at the CMA Awards, in 1975. Parton's 1982 recording of the song is from the soundtrack of the film The Best Little Whorehouse in Texas.\n\nWhitney Houston recorded a cover version of the song for the 1992 film The Bodyguard. Her single spent 14 weeks at number one on the Billboard Hot 100 chart. It has since become one of the best-selling singles of all time. Houston's version of \"I Will Always Love You\" re-charted in 2012 after her death, making it the second single ever to reach the top three on the Billboard Hot 100 in separate chart runs.\n\nDolly Parton wrote the track in 1973 for her one-time partner and mentor Porter Wagoner, from whom she was separating professionally at the time. She recorded it in Nashville on June 13, 1973. Parton later re-recorded the song in 1982, when it was included on the soundtrack of The Best Little Whorehouse in Texas. Author Curtis W. Ellison stated that the song \"speaks about the breakup of a relationship between a man and a woman that does not descend into unremitting domestic turmoil, but instead envisions parting with respect – because of the initiative of the woman.\" According to sheet music published at musicnotes.com by Hal Leonard Corporation, the country love track is set in time signature of common time with a tempo of 66 beats per minute. During an interview, Parton's manager Danny Nozel said that \"one thing we found out from American Idol is that most people don't know that Dolly Parton wrote \".\n\nIn addition to The Best Little Whorehouse in Texas's soundtrack, Parton's original 1974 recording of the song also appeared in Martin Scorsese's film Alice Doesn't Live Here Anymore.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vxwvux1454668192.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=3JWTaaS7LdU", "strMusicVidDirector": "Alan Smithee", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "224620454", "intMusicVidLikes": "1072078", "intMusicVidDislikes": "27618", "intMusicVidFavorites": "0", "intMusicVidComments": "85523", "intTrackNumber": "5", "intLoved": "2", "intScore": "9.75", "intScoreVotes": "4", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "55b77af9-6ae1-448c-abee-f5d3739d22cd", "strMusicBrainzAlbumID": "7762e68d-3397-35b7-a601-6b831b31c2c0", "strMusicBrainzArtistID": "0307edfc-437c-4b48-8700-80680e66a228", "strLocked": "Unlocked"}]}