{"track": [{"idTrack": "32737480", "idAlbum": "2110931", "idArtist": "111327", "idLyric": "0", "idIMVDB": "2147483647", "strTrack": "I'd Do Anything for Love (But I Won't Do That)", "strAlbum": "Bat Out of Hell II: Back Into Hell", "strArtist": "Meat Loaf", "strArtistAlternate": "Marvin Lee Aday", "intCD": null, "intDuration": "721000", "strGenre": "Hard Rock", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"I'd Do Anything for Love (But I Won't Do That)\" is a song composed and written by Jim Steinman, and recorded by Meat Loaf. The song was released in 1993 as the first single from the album Bat Out of Hell II: Back into Hell.\n\nThe last six verses feature a female singer who was credited only as \"Mrs. Loud\" in the album notes. She was later identified as Lorraine Crosby, from North East England. She does not, however, appear in the video, in which her vocals are lip-synched by Dana Patrick. Meat Loaf promoted the single with American vocalist Patti Russo.\n\nThe song was a commercial success, reaching number one in 28 countries. The single was certified platinum in the United States and became Meat Loaf's first number-one single on the Billboard Hot 100 chart and on the UK singles chart, and was the best-selling single of 1993 in the UK. The song earned Meat Loaf a Grammy Award for Best Rock Vocal Performance, Solo.\nThe timings in this article refer to the original album version. There are many shorter single and radio edits.\n\nThe song opens with a guitar played to sound like a revving motorcycle. Roy Bittan's piano begins to play, along with the guitars. The vocals begin at the 1:50 point. Steinman \"alternates ...  style with mellow moments where the hard-hitting piano licks are fleshed out with ethereal synthesizer and choral-styled backing vocals\".\n\nThe opening vocals are accompanied by piano and backing vocals. The song then becomes much louder as the band, predominantly piano, plays the main melody for twenty seconds. An instrumental section follows the first verse and chorus, lasting over 45 seconds, with piano playing the title melody, accompanied by guitar and wordless background vocals by Todd Rundgren, Rory Dodd and Kasim Sulton. The lead vocals recommence with another verse. The phrase \"sex, drugs and rock 'n' roll\" was edited to become \"Some days I just pray to the god of sex and drums and rock and roll\" on the recording (though not always in live shows).\nLorraine Crosby, a singer from North East England, was the guest singer, though Allmusic incorrectly attributes the female vocals to Ellen Foley. Crosby and her partner Stuart Emerson had moved to Los Angeles to work with Jim Steinman, who became their manager. He secured them a contract with Meat Loaf's recording label MCA. While visiting the company's recording studios on Sunset Boulevard, Crosby was asked to provide guide vocals for Meat Loaf, who was recording \"I'd Do Anything for Love\". Crosby recalls, \"in I went and sang it twice and I never thought anything more of it until six months later when I got a phone call saying, 'Would you mind if we used your vocals?'\" Cher, Melissa Etheridge and Bonnie Tyler had been considered for the role. However, as Crosby had recorded her part as guide vocals, she did not receive any royalties from the song.\nMichael Bay directed the music video. He also directed the videos for \"Objects in the Rear View Mirror May Appear Closer than They Are\" and \"Rock and Roll Dreams Come Through\", also from Bat Out of Hell II. Filming took place in Los Angeles County, California in July 1993; the opening chase was filmed at Chávez Ravine, with the interior mansion scenes filmed at Greystone Mansion in Beverly Hills. The cinematographer was Daniel Pearl, particularly known for filming The Texas Chain Saw Massacre in 1973. Pearl says that this video \"is one of my personal all-time favorite projects... I think the cinematography is pure, and it tells a story about the song.\"\n\nThe video is based on Beauty and the Beast and The Phantom of the Opera. Bob Keane did Meat Loaf's make-up, which took up to two hours to apply. The make-up was designed to be simple and scary, yet \"with the ability to make him sympathetic.\" It went over budget, and was filmed in 90 °F (32 °C) heat, across four days. According to one executive, it \"probably had the budget of Four Weddings and a Funeral.\" It is the abridged seven minute single version, rather than the twelve minute (11:58) album version.\n\nThe actress in the video, Dana Patrick, is miming to Crosby's vocals, however, as she would to Patti Russo's in the 1995 song \"I'd Lie for You (And That's the Truth)\". According to the captions aired on Pop-Up Video, Patrick received several offers for record deals after the video aired, by executives who assumed she was actually singing in the video.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/nohsi61616068554.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=9X_ViIPA-Gc", "strMusicVidDirector": "Michael Bay", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "14391988", "intMusicVidLikes": "52113", "intMusicVidDislikes": "1359", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "156238", "intTotalPlays": "722563", "strMusicBrainzID": "52cfbe3a-56a7-49a8-a848-d63c23fa68d0", "strMusicBrainzAlbumID": "758d7dc5-4aa2-3731-b970-549251a98232", "strMusicBrainzArtistID": "b134d1bf-c7c7-4427-93ac-9fdbc2b59ef1", "strLocked": "Unlocked"}]}