{"track": [{"idTrack": "32772422", "idAlbum": "2114152", "idArtist": "111695", "idLyric": "111807", "idIMVDB": "0", "strTrack": "Insane in the Brain", "strAlbum": "Black Sunday", "strArtist": "Cypress Hill", "strArtistAlternate": null, "intCD": null, "intDuration": "211200", "strGenre": "Hip-Hop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Insane in the Brain\" is a 1993 single by the American hip hop group Cypress Hill. In addition to hitting number one on the US rap chart, the song also was a mainstream hit, reaching number 19 on the Billboard Hot 100 in 1993. It earned a gold certification from the Recording Industry Association of America and sold 600,000 copies domestically. It was highly successful in other countries. The song was released on the group's Black Sunday album.\n\nThe popular lyric \"Insane in the membrane\" is sometimes confused for the title.\n\nAccording to B-Real, the song was actually a diss song aimed at Chubb Rock. The group felt Chubb had ridiculed their style on his 1992 album I Gotta Get Mine Yo.\n\nIt is claimed that DJ Muggs produced the song \"Jump Around\" by House of Pain, which was later used to produce this song, with minor changes.\n\nThis song is a resumption of \"Son of a Preacher Man\" of Dusty Springfield, and the song is built around many samples: a repeating sample of a horse from Mel and Tim's \"Good Guys Only Win in the Movies\"; a drum break from organist George Semper's cover version of Lee Dorsey's \"Get Out of My Life, Woman\"; a sample of James Brown grunting from the opening of his song \"Say It Loud - I'm Black and I'm Proud\"; a sample of the line \"insane in the brain\" from Cypress Hill's own song \"Hole in the Head\"; the opening keyboard from Sly & the Family Stone's \"Life\" and a sample of the line \"I think I'm going crazy\" from The Youngbloods's \"All Over the World (La La),\" which concludes the track. In 2008, it was ranked number 34 on VH1's 100 Greatest Songs of Hip Hop.\n\nA video for the track was filmed at San Francisco's DNA Lounge.\n\nIn 1999 Jason Nevins released several remixes of the track under the name \"Jason Nevins vs. Cypress Hill.\" The song was featured in the 2005 film Fun with Dick and Jane.\n\nIn 2012, the song was used to show that axons transmit electricity from sound to chromatophores of a dead Longfin Inshore Squid to create a colourful display of the music.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=RijB8wnJCN0", "strMusicVidDirector": "Josh Taft", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "3", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "29c3d007-4a1f-422a-957e-712a94c99764", "strMusicBrainzAlbumID": "fe860e74-7eb8-4bc3-8b8d-cbf621aed500", "strMusicBrainzArtistID": "51508c1f-8d07-4a00-9cf1-26c570fe7b78", "strLocked": "Unlocked"}]}