{"track": [{"idTrack": "32876802", "idAlbum": "2122448", "idArtist": "113067", "idLyric": "462463", "idIMVDB": null, "strTrack": "Runaway Train", "strAlbum": "Grave Dancers Union", "strArtist": "Soul Asylum", "strArtistAlternate": null, "intCD": null, "intDuration": "266493", "strGenre": "Alternative Rock", "strMood": "Gritty", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Runaway Train\" is a power ballad by American alternative rock band Soul Asylum. Its music video is notable for featuring images of missing people, most of them young children and teenagers. Lead singer Dave Pirner has stated that the lyrics originally described his experience of depression.\n\n\"Runaway Train\" was released in June 1993 as the fourth single from the band's 1992 album, Grave Dancers Union, and became a success around the world. It reached number five on the US Billboard Hot 100 and climbed to the top position on the Canadian RPM Top Singles chart, earning a gold sales certification from the Recording Industry Association of America and selling 600,000 copies in the US. Outside North America, it reached number two in New Zealand, Norway, Sweden, and Switzerland and peaked within the top five on the charts on several other European countries. The song helped bring Grave Dancers Union to a multi-platinum level and won a Grammy Award for Best Rock Song in 1994.\n\nThe music video for the song was directed by Tony Kaye and received heavy airplay on MTV and VH1 during its duration.\n\nSeveral versions of the video were made. The video for the United States version begins with a fade to a black screen with a big, white blocked text reading: \"There are over one million youth lost on the streets of America\", while the UK version begins with \"100,000 youth are lost on the streets of Britain\". The next scene shows a drawing of an adolescent girl, and a Dave Pirner voice-over saying that the drawing is by a girl who had run away more than 110 times. The scene was often omitted when the video was shown, a common practice when videos had additional footage before or after the song.\n\nAfter Pirner spoke, the video continued with various shots of the band playing the song, and Pirner singing. Three concrete scenes are shown interspersed among the other images of the video. During the first verse, a child is shown witnessing his grandfather beating and eventually killing his grandmother, before fleeing in fear. During the second verse, a young teenage girl is pimped as a prostitute, and initially purchased by the aforementioned abuser. Later, she is dragged into a van by a gang; afterwards, she is picked up by paramedics and taken to the hospital, after getting beaten up. During the coda of the song, a small baby is snatched from his stroller by an older woman, with his mother running after the kidnapper's car.\n\nThroughout the music video, various images of children running, or appearing with injuries from abuse, are shown. During the choruses, pictures of missing children would appear on the screen. After each picture was shown, their full name would appear in large capital letters on the screen, along with the year they had been \"missing since...\".\n\nAfter the video, in an ending also not regularly shown, Pirner says in front of the camera, \"If you've seen one of these kids, or you are one of them, please call this number,\" with the following screen showing a number one could contact. MTV cut this part out because they did not want to have the video confused with being a public service announcement. VH1 shows the UK version in its full length.\n\nThere were three original versions of the video in the United States, totaling 36 missing children shown. The children shown varied with the location of the broadcast, using missing children from that area.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=NRtvqT_wMeY", "strMusicVidDirector": "Tony Kaye", "strMusicVidCompany": "Tony Kaye Films", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "185916148", "intMusicVidLikes": "950353", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "28839", "intTrackNumber": "3", "intLoved": "0", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "460623", "intTotalPlays": "2144319", "strMusicBrainzID": "bb7df441-35b2-4c0d-99b5-6560a5bbbc51", "strMusicBrainzAlbumID": "46e50ab7-9428-36cb-b662-6b9556922579", "strMusicBrainzArtistID": "b10db9ad-b4c3-47f3-a7a4-37864b134f65", "strLocked": "Unlocked"}]}