{"track": [{"idTrack": "32731512", "idAlbum": "2110354", "idArtist": "111286", "idLyric": "238398", "idIMVDB": "0", "strTrack": "That's the Way Love Goes", "strAlbum": "janet.", "strArtist": "Janet Jackson", "strArtistAlternate": null, "intCD": null, "intDuration": "265106", "strGenre": "R&B", "strMood": "In Love", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"That's the Way Love Goes\" is a song by American singer Janet Jackson, released as the lead single from her fifth studio album Janet (1993). It was written and produced by Jackson and Jimmy Jam & Terry Lewis. The single saw Jackson transitioning to sensual territory and themes of romantic lust, considered a shocking contrast to her previous releases among critics and the public. The song's slow tempo fused pop, R&B, funk and soul with flourishes of downtempo and hip hop music. It received positive reception from contemporary music critics, who praised it as \"iconic,\" \"hypnotic,\" and an \"extravaganza\" for its production and vocals.\n\nThe song became Jackson's biggest hit to date in the United States and was one of the longest-reigning hits of the year, topping the Billboard Hot 100 for eight weeks, the longest running number one single of any member of the Jackson family on the Hot 100. It also topped the Hot 100 Airplay for ten weeks, as well as spending multiple weeks at number one on several of Billboard's other component charts. The song became the first and only single in history to debut at number one on the Hot R&B/Hip-Hop Airplay chart. Internationally, it placed at number one in Canada, Australia, New Zealand, Hungary, South Africa, Japan, and Europe's Hot 100 Singles chart. It is the seventeenth biggest hit of the nineties and the biggest selling single by a female artist in South Africa. It has sold over three million copies worldwide.\n\n\"That's the Way Love Goes\" received a Grammy Award for Best R&B song in addition to Billboard Awards, BMI Pop Award for Most Played Song, BPI Sales Awards, American Music Awards, and Soul Train Awards. Its accompanying music video received several nominations at the MTV Video Music Awards, including Best Female Video; the music video has also influenced several videos, including releases from Ciara and Prince.\n\n\"That's the Way Love Goes\" has been covered by artists such as Bruno Mars and 'N Sync, cited as an influence by Britney Spears and Nelly Furtado, and inspired or been sampled in songs by Alicia Keys, Destiny's Child, and Utada Hikaru. It is considered to be one of Jackson's signature songs and is included in each of her greatest hits collections: Design of a Decade: 1986–1996 (1995), Number Ones (2009) and Icon: Number Ones (2010).", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wvtrss1488465841.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=NpQ88a6zy8E", "strMusicVidDirector": "Rene Elizondo", "strMusicVidCompany": "Palomar Pictures", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "1238042", "intMusicVidLikes": "10997", "intMusicVidDislikes": "254", "intMusicVidFavorites": "0", "intMusicVidComments": "598", "intTrackNumber": "2", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "260642", "intTotalPlays": "913053", "strMusicBrainzID": "cf6c4727-4e36-4b77-96e0-67f17a1a3d6c", "strMusicBrainzAlbumID": "785e1f49-f5b7-3ca3-a58e-e138a0e5e531", "strMusicBrainzArtistID": "6be2828f-6c0d-4059-99d4-fa18acf1a296", "strLocked": "Unlocked"}]}