{"track": [{"idTrack": "32805525", "idAlbum": "2116888", "idArtist": "112213", "idLyric": "0", "idIMVDB": "187134106230", "strTrack": "Two Princes", "strAlbum": "Pocket Full of Kryptonite", "strArtist": "Spin Doctors", "strArtistAlternate": null, "intCD": null, "intDuration": "258200", "strGenre": "Rock", "strMood": "Gritty", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Two Princes\" is a song by American rock group Spin Doctors, released as the second single from their debut album, Pocket Full of Kryptonite (1991). It peaked at number seven on the Billboard Hot 100 and number three on the Cash Box Top 100. Outside of the US, it topped the charts in Iceland and Sweden, and peaked within the top ten of the charts in Australia, Canada, Germany, the Netherlands, the Republic of Ireland, and the United Kingdom. The song earned them a Grammy Award nomination for Best Rock Performance by a Duo or Group.\nStephen Thomas Erlewine from AllMusic stated that \"Two Princes\" is one of the \"best tracks\" of the album. Larry Flick from Billboard wrote, \"The Doctors' growing legion of fans will devour this treat from Pocket Full of Kryptonite within seconds.\" He explained further, \"Percolating rhythm section, courtesy of Aaron Comess and Mark White, propels Eric Schenkman's scratchy guitars and a pure-pop hook. Engaging vocals by Christopher Barron and lively instrumentation assure instant album-rock and alternative play, with visions of successfully crossing into the pop arena realistically dancing in everyone's heads.\" Randy Clark from Cash Box commented, \"This crunchy rock/funk groove hints of the same raw, unpolished but infectious street quality of the early Rolling Stones except with an unspoiled and urgent alternative style.\" A reviewer from Kingston Informer viewed the song as \"brilliant\".[Music writer James Masterton noted in his weekly UK chart commentary, \"Leaping just as dramatically into the Top 10 come the Spin Doctors, almost 18 months after the track was first heard by the American public. It touches a chord with many as well. Marry him or marry me, I'm the one who loves you baby can't you see....\"\n\nPan-European magazine Music & Media wrote, \"Although the album Pocket Full of Kryptonite was released about two years ago, the singles of the medicals are still doing fine. Put your faith in this one too, as the funky guitar rock of this 'royal' track is as infectious as you could wish for.\" Leesa Daniels from Smash Hits rated it five out of five, adding, \"This is their second bash at the UK charts and it's just marvellous. A thumping drum beat with guitars rocking all over the place, it makes you want to jump onto the nearest table and dance and twirl and swing your head around until you eventually, er, pass out!\" Troy J. Augusto from Variety declared the song as one of their \"undeniable gems\".\n\n\"Two Princes\" was ranked No. 41 on VH1's \"100 Greatest Songs of the '90s\"; conversely, it was ranked No. 21 on Blender magazine's \"50 Worst Songs Ever\".", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/q8vhwk1667432906.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=wsdy_rct6uo", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "103274268", "intMusicVidLikes": "640679", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "20208", "intTrackNumber": "7", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "662900", "intTotalPlays": "3138492", "strMusicBrainzID": "c974df91-798b-403b-ba91-e7e36b87473c", "strMusicBrainzAlbumID": "3e769959-3fd1-34da-925e-943605b32307", "strMusicBrainzArtistID": "1bcb61f3-ca9c-4a26-b16e-0547ad6c21be", "strLocked": "Unlocked"}]}