{"track": [{"idTrack": "32823266", "idAlbum": "2118241", "idArtist": "111287", "idLyric": "192337", "idIMVDB": "0", "strTrack": "Freedom 90", "strAlbum": "Listen Without Prejudice, Volume 1", "strArtist": "George Michael", "strArtistAlternate": null, "intCD": null, "intDuration": "390866", "strGenre": "Pop", "strMood": "Bittersweet", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Freedom '90\" (also known simply as \"Freedom\") is a song written, produced, and performed by George Michael, and released on Columbia Records in 1990. The \"'90\" added to the end of the title is to prevent confusion with a hit by Michael's former band Wham!, also titled \"Freedom\".\n\nIt was the third single taken from Listen Without Prejudice Vol. 1, though released as the second single from the album in Australia. \"Freedom '90\" was one of a few uptempo songs on this album, it was also a major hit and went to #8 in the US. The song is referring to Michael's past success with Wham!, yet also shows a new side of himself as a new man, who is more cynical about the music business than he had been before. Michael refused to appear in the video and allowed a group of supermodels to appear instead.\n\nMichael performed the song during the closing ceremony of the 2012 London Olympics.\n\nBy 1990, Michael had grown weary of the pressures of fame, telling the Los Angeles Times, \"At some point in your career, the situation between yourself and the camera reverses. For a certain number of years, you court it and you need it, but ultimately, it needs you more and it's a bit like a relationship. The minute that happens, it turns you off ... and it does feel like it is taking something from you.\" He decided that he no longer wanted to do photo shoots or music videos, saying, \"I would like to never step in front of a camera again.\"\n\nAlthough he relented and decided to make a video for his new song, he still refused to appear in it. Instead, inspired by Peter Lindbergh's now-iconic portrait of Naomi Campbell, Linda Evangelista, Tatjana Patitz, Christy Turlington, and Cindy Crawford for the January 1990 cover of the British edition of Vogue, Michael asked the five models to appear in the video. While it was not uncommon at the time for models to appear in music videos, usually such models played the love interest of the singer, as with Christie Brinkley's appearance in her then-husband Billy Joel's \"Uptown Girl\" video, or Turlington's appearance in Duran Duran's \"Notorious\" video when she was 17 years old. For \"Freedom '90\", the five models would not portray Michael's on-screen girlfriends, but would lip-synch the song in his place. This idea was already established in 1985 by Bryan Ferry's music video \"Slave to Love\". This music video also included the appearance of five male models: John Pearson, Mario Sorrenti, Scott Benoit, Todo Segalla and Peter Formby.\n\nEvangelista took some persuading before agreeing to appear in the video, saying, \"He thought it would make us into a big deal, that it would be good for us. I was like, 'Please, we're here. We've already arrived!'\" After speaking with Michael, she was convinced, and rearranged her schedule. In a 2015 Vanity Fair article, Evangelista reflected on her decision positively, saying, \"Little did I know that to this day, when someone meets me for the first time, they bring up that video. That's what they remember. So yeah, George was right.\" An initial disagreement over their salaries was resolved when Annie Veltri, who represented Crawford, Evangelista, Campbell, and Patitz at Elite Model Management, made it clear that all of her clients would receive the same compensation—$15,000 a day.\n\nThe video was directed by David Fincher, whose \"dark and graphic style, distinguished by velvety-rich color, moody interiors and crisp storytelling\", had earned him notice for his work on Madonna's \"Express Yourself\" video the previous year. His team for the multi-day \"Freedom! '90\" shoot included Camilla Nickerson, who went on to become a Vogue contributing editor, as the clothes stylist, hair stylist Guido and makeup artist Carol Brown. The video was shot in a vast building in the London Borough of Merton that Nickerson says exhibited \"a grandeur and a Blade Runner feel.\"\n\nThe 92-sketch storyboard called for each model to film on separate days, with the exception of Evangelista and Turlington, who appear in a scene together. Each model was assigned a verse to lip-synch, while for the song's chorus, Fincher envisioned the three iconic items from Michael's 1987 music video \"Faith\" that had come to symbolize his public image: his leather jacket, a Wurlitzer jukebox, and guitar, exploding in a ball of flame at each occurrence of the word \"freedom\" during the chorus. Whereas \"Faith\" had opened with a jukebox phonograph needle touching a vinyl record, \"Freedom! '90\" opens with a compact disc player's laser beam reading a CD.\n\nNickerson envisioned a \"low-key street style\" for the wardrobe, which she characterizes as \"a sort of undone beauty\", in contrast to the prevailing \"vampy, larger-than-life\" direction in which the fashion industry, typified by models doing film work, was moving at the time. The black sweater worn by Evangelista was from Nickerson's own closet, and the studded biker boots worn by Campbell belonged to Nickerson's boyfriend. Most of the wardrobe budget, however, went to the 60-foot-long linen sheet used by Turlington, the nature of which was specified by Fincher. Guido looked to each model's personality to devise hairdos that would effect a sense of their \"true beauty\". Evangelista was up until 3:00am the night before the shoot dying her hair platinum blonde, which reflected the cool-blue lights of the set, while Campbell's hair was curled and pulled up with a headband for a 1960s \"tough chic\" in order to highlight her movement for a shot in which she dances solo. Patitz's hair was framed with soft curls and Turlington's was gelled back to exploit her statuesque form as her character crosses the screen trailing the linen sheet. Brown also tried to bring out each model's personality with makeup, saying, \"Cindy was the sexy one; Christy was the cool, classic one; and Linda was the chameleon. She could do anything.\" Following Fincher's instruction that Crawford's makeup look \"completely trashed, as if she'd been in a steamy atmosphere,\" Brown did Crawford's makeup, and then oiled it down by covering her with glycerin. Crawford spent most of her time topless and sitting in an empty bathtub, resting on an apple box so that enough of her would be visible. Brown recalls, \"The poor girl must have been freezing because it wasn't hot in there. I remember her walking across that studio so fearlessly and proudly and not making any sort of a big deal that she was wearing only a G-string.\"\n\nDespite not appearing in the video, Michael was on set. Guido recalls, \"We'd drink red wine and sing songs in the evening because it kind of went on late, and George was just like one of the gang, in the trailers, hanging out.\" On the last day of shooting, Brown broke her own rule about not asking the celebrities she worked with for autographs. On her copy of the video's production booklet, Michael wrote: \"Thanks, I never looked so good.\"\n\nThe video premiered a few weeks after the shoot, and went into heavy rotation on MTV. Judy McGrath, a former CEO of MTV Networks reminisces, \"I remember watching it and thinking, This is entrancing. The '90s was a time of incredible creative freedom, when you had a generation of directors making a new visual language, and you had musicians driving the pop-culture conversation, and 'Freedom' kind of kicked off that whole period.\" A few months later, at the conclusion of his 1991 fall fashion show in Milan, designer Gianni Versace sent Crawford, Evangelista, Campbell and Turlington down the runway. The four of them stood in a huddle, mouthing along to \"Freedom\". It marked the zenith of the 1990s supermodel era, which would end with the grunge movement, which was ushered in by Nirvana's 1991 album Nevermind.\n\nReflecting on the video in 2015, Crawford stated that at the time, they perceived themselves to simply be making \"a really cool video\", but that in retrospect, the video exhibits a dark humor: As MTV had altered the music industry so that physical beauty was now necessary to sell music, the video used five beautiful faces in lieu of the song's vocalist in order to poke fun at this.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xsvuup1482836322.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=diYAc7gB-0A", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "35799890", "intMusicVidLikes": "109968", "intMusicVidDislikes": "3840", "intMusicVidFavorites": "0", "intMusicVidComments": "9300", "intTrackNumber": "2", "intLoved": "2", "intScore": "9", "intScoreVotes": "3", "intTotalListeners": "106541", "intTotalPlays": "376457", "strMusicBrainzID": "e9ccfb0a-a516-4d25-99ff-699856090e56", "strMusicBrainzAlbumID": "a0467615-94c3-3268-a425-9285273adb24", "strMusicBrainzArtistID": "ccb8f30e-4d71-40c4-8b1d-846dafe73e2c", "strLocked": "Unlocked"}]}