{"track": [{"idTrack": "33116845", "idAlbum": "2141994", "idArtist": "116357", "idLyric": "125780", "idIMVDB": "0", "strTrack": "Groove Is in the Heart", "strAlbum": "World Clique", "strArtist": "Deee-Lite", "strArtistAlternate": null, "intCD": null, "intDuration": "231893", "strGenre": "Funk", "strMood": "Carefree", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Groove Is in the Heart\" is a song by American dance band Deee-Lite. It was released in August 1990 as the lead single from their debut album, World Clique. The song was a hit in many countries.\n\nThough the album version was not recorded until 1990, the song was originally written in the late 1980s; it was performed live as early as 1989.\n\nThe backing track was built around many samples, primarily the main riff from Herbie Hancock's track \"Bring Down the Birds\" from the Blowup soundtrack and Vernon Burch's \"Get Up\", which provided the drum track and also formed the basis for the famous breakdown featuring a slide whistle. Parliament-Funkadelic legend Bootsy Collins played bass guitar and provided guest vocals, and the rap is provided by Q-Tip of A Tribe Called Quest.\n\nSlant Magazine ranked the song second in its 100 Greatest Dance Songs list, adding: \"No song delivered the group's world-conscious Word as colorfully and open-heartedly as \"Groove Is in the Heart,\" which flew up the Billboard charts while goosing stuffed shirts\". NME and The Village Voice's Pazz & Jop annual critics' poll named \"Groove Is in the Heart\" the best single released in the year 1990.\n\nAn immediate smash in nightclubs, the song went to number one on the US Hot Dance Club Play chart and also hit number four on the Billboard Hot 100. It peaked at number 1 for one week in Australia in November 1990.\n\nIn the UK, the record was equally popular and was released as a double A-side with \"What Is Love\", and, with the UK single released with the subtitle \"peanut butter mix\" (because the single was heavily edited and completely omitted the contributions by Bootsy Collins and Q-Tip), it eventually reached number two during September 1990. Its placing second was due to a rule instituted in the UK Singles Chart in the 1980s, which settled any \"ties\" over chart positions due to equal sales: the single with sales that had increased most from the previous week would reside above the other, controversially giving \"The Joker\" by the Steve Miller Band the top place. Following complaints from Deee-Lite's record company, WEA, the rule, of which this had been the only case, was scrapped and joint positions were once again allowed. \"The Joker\" spent a second week at the number one spot and thereafter convincingly outsold \"Groove Is in the Heart\".\n\nThe song was accompanied by a psychedelic music video, with Deee-Lite, Q-Tip, Maceo Parker and Bootsy Collins superimposed over a cartoonish late 1960s-style background of various shifting shapes and colors. The video opens and closes with quotes by the band: Lady Miss Kier has an opening dialog consisting of \"faux-French\" originally spoken in the song's AA-side, \"What Is Love?\", and the ending features Collins saying, \"Don't forget, groove is in the heart, and Deee-Lite have definitely been known to smoke... on stage, that is!\" (itself sampled by Deee-Lite in the song) and Lady Miss Kier exclaiming \"Deee-groovy!\"", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/yprttq1363520471.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=etviGf1uWlg", "strMusicVidDirector": "Hiroyuki Nakano", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "12903862", "intMusicVidLikes": "59011", "intMusicVidDislikes": "1552", "intMusicVidFavorites": "0", "intMusicVidComments": "4014", "intTrackNumber": "9", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "357141", "intTotalPlays": "1508356", "strMusicBrainzID": "5f16c1b0-fc8b-491b-9ebe-af8943039776", "strMusicBrainzAlbumID": "4f625d26-3d84-3d3b-8230-2c98e5d45100", "strMusicBrainzArtistID": "83d401e8-3322-4491-98d3-ec3a567c5047", "strLocked": "Unlocked"}]}