{"track": [{"idTrack": "32846338", "idAlbum": "2120118", "idArtist": "112696", "idLyric": "529781", "idIMVDB": null, "strTrack": "I'm Your Baby Tonight", "strAlbum": "I'm Your Baby Tonight", "strArtist": "Whitney Houston", "strArtistAlternate": null, "intCD": null, "intDuration": "253933", "strGenre": "Soul", "strMood": "In Love", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"I'm Your Baby Tonight\" is a song by American singer Whitney Houston from her third studio album of the same name. Written and produced by L.A. Reid and Babyface, in Australia and most European countries it was released as the album's lead single on September 28, 1990; in the United States, the release date was October 2. Following the release of her second studio album Whitney (1987), Houston became the first woman ever to debut atop the Billboard 200; despite this, critics deemed it safe and formulaic. Additionally, she was booed at the 1989 Soul Train Music Awards and accused of being \"not black enough\"; Houston decided she needed to change her sound if she wanted to recapture black audiences.\n\nFor I'm Your Baby Tonight, she chose to work with Reid and Babyface because of their work on boyfriend Bobby Brown's 1989 album Don't Be Cruel. The title-track marked a departure from Houston's previous works; it is a New jack swing song with pop and R&B influences, and lyrics that talk about sexual desire. Upon release, it was generally well-received by most critics, who applauded its \"street-oriented\" sound and Houston's vocals. \"I'm Your Baby Tonight\" received a nomination for Best Female Pop Vocal Performance at the 33rd Grammy Awards. In retrospective reviews, it is now considered one of her best singles. It was also commercially successful; in the United States, it become Houston's eight number one on the Billboard Hot 100, a feat that tied her with Madonna as the female artist with most number one hits at the time. It performed well internationally, reaching the top five of several countries, including Canada, the United Kingdom, Switzerland, and Italy.\n\nThe accompanying music video was directed by Julien Temple and showed Houston sporting a more \"rebellious\" look, and emulating the style of figures such as Audrey Hepburn, Marlene Dietrich, and The Supremes. Houston performed \"I'm Your Baby Tonight\" on several occasions through the 1990s, including three of her concert tours, and her HBO special Welcome Home Heroes with Whitney Houston. Brandy sang the song at the 2012 BET Awards as tribute to Houston after her death.\n\nThe music video for \"I'm Your Baby Tonight\" was directed by Julien Temple and filmed at a park on the Hudson River on New York's West Side, and at a nightclub called Tatou. Choreography was in charge of Adam Shankman. In the video, Houston emulates Audrey Hepburn's dance sequence from Funny Face (1957), and recreates the looks of Marlene Dietrich and The Supremes. Vice's Tshepo Mokoena pointed out how the music video saw an image change in Houston; dressed in ripped high-waisted jeans and an oversized leather jacket, her style was \"androgynous, slightly rebellious\", a contrast from her previous 1980s videos, which had her in \"Barbie heels and candy-colored dresses\" and focused on her \"onscreen cuteness and clothing-catalogue smile\". Mokoena noticed influence from the music video in the work of artist such as Janelle Monáe, Jessie Ware, Christina Aguilera and M.I.A., among others. \"I'm Your Baby Tonight\" can be found on the video edition of Houston's 2000 compilation Whitney: The Greatest Hits.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "https://www.youtube.com/watch?v=i0oRnyXxIrY", "strMusicVidDirector": "Julien Temple", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "16743723", "intMusicVidLikes": "158809", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "7105", "intTrackNumber": "1", "intLoved": "0", "intScore": "7", "intScoreVotes": "1", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "d5f43dac-7456-4ca3-9d9f-67a3f8bc8e98", "strMusicBrainzAlbumID": "2dc208b0-cd05-3002-bc4b-c6926b0259ea", "strMusicBrainzArtistID": "0307edfc-437c-4b48-8700-80680e66a228", "strLocked": "Unlocked"}]}