{"track": [{"idTrack": "33002496", "idAlbum": "2132719", "idArtist": "114704", "idLyric": "354300", "idIMVDB": null, "strTrack": "O.P.P.", "strAlbum": "Naughty By Nature", "strArtist": "Naughty by Nature", "strArtistAlternate": "The New Style", "intCD": null, "intDuration": "271066", "strGenre": "Hip-Hop", "strMood": "...", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "Arm me with harmony\nDave drop a load on 'em\nverse 1:\nHmm...OPP, how can I explain it\nI'll take you frame by frame it\nTo have y'all all jumpin' shall we singin' it\nO is for Other, P is for People...scratch yo temple\nThe last P Well...that's not that simple\nIt's sorta like a, well, another way to call a cat a kitten\nIt's five little letters that I'm missin' here\nYou get it on occassion if the other party\nisn't game'n it seems I gotta start the explainin'\nBust it\nYou ever had a girl and met her on a nice hello\nYou get her name and number then left feelin' real mellow\nYou get home, wait a day, she's what you wanna know about\nThen you call up and it's her girlfriend's or her cousin's house\nIt's not a front, an F to the R to the O to the N to the T\nIt's just her boyfriend's at her house (Boy, that's what is scary)\nIt's OPP, some other people's pu... You get it?\nThere's no room for relationships there's just room to hit it\nHow many brothers out there know just what I'm gettin' at?\nWho thinks it's wrong 'cos I was splittin' and co-hittin' dat?\nWell if you do, that's OPP and you're not down with it\nBut if you don't, here's your membership\n\nChorus:\nYou down with OPP (Yeah you know me) 3X\nWho's down with OPP (Every last homie)\nYou down with OPP (Yeah you know me) 3X\nWho's down with OPP (All the homies)\nabs thta was fresh x7\nyeah u know me,yeah u know me yeah u know me all da homies!\nverse 2:\nAs for the ladies, OPP means something gifted\nThe first two letters are the same but the last is something\ndifferent\nIt's the longest, loveliest, lean-- I call it the leanest\nIt's another five letter word rhymin' with cleanness and meanness\nI won't get into that, I'll do it...uh...sorta properly\nI'll say the last P...hmm...stands for property\nNow lady here comes a kiss, blow a kiss back to me, now tell me\nexactly\nHave you ever known a brother who had another like a girl or wife\nAnd you just had to stop and just 'cos he look just as nice\nYou looked at him, he looked at you and you knew right away\nHe had someone but he was gonna be yours anyway\nYou couldn't be seen with him and honestly you didn't care\n'Cos in a room behind a door no one but y'all are there\nWhen y'all are finish, y'all can leave and only y'all would know\nAnd y'all could throw that skeleton bone right in the closet do'\nNow don't be shocked 'cos if you're down I want your hands up high\nSay OPP (OPP) I like to say with pride\nNow when you do it, do it well and make sure that it counts\nYou're now down with it, discount\n\nChorus:\nYou down with OPP (Yeah you know me) 3X\nWho's down with OPP (Every last lady)\nYou down with OPP (Yeah you know me) 3X\nWho's down with OPP (All the ladies)\n\nThis gal tried to OPP me\nI had a girl and she knew that, matter-of-fact, hell, my girl was partners\nthat\nHad a fall out, disagreement, yeah an argument\nShe tried to do me, so we did it in my apartment, bust it\nThat wasn't the thing, it must have been the way she hit the ceiling\n'Cos after that she kept on coming back and catchin' feelings\nI said, \"Let's go my girl is coming so you gotta leave\"\nShe said, \"Oh no, I love you Treach\" I said, \"Now child please\"\nYou gots to leave, come grab your coat, right now you gotta go\nI said I'll look you to the stairs and to the stair window\nThis was a thing, a little thing, you shouldn't have brought your heart\n'Cos you knew I was OPP, hell from the very start\nCome on, come on, now let me tell you what it's all about\nWhen you get down, you can't go 'round runnin' off at the mouth\nThat's rule number one in this OPP establishment\nYou keep your mouth shut and it won't get back to her or him\nExciting isn't it, a special kinda business\nMany of you will catch the same sorta OPP visit with him or her\nFor sure, I'm going to admit it:  When OPP comes,\nDamn skippy, I'm wit' it\n\nChorus:\nYou down with OPP (Yeah you know me) 3X\nWho's down with OPP (This whole party)\nYou down with OPP (Yeah you know me) 3X\nWho's down with OPP (This whole party)\n\nBreak it down!\n", "strMusicVid": "https://www.youtube.com/watch?v=idx3GSL2KWs", "strMusicVidDirector": "Rodd Houston", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "7613132", "intMusicVidLikes": "77718", "intMusicVidDislikes": "2755", "intMusicVidFavorites": "0", "intMusicVidComments": "3963", "intTrackNumber": "3", "intLoved": "0", "intScore": "10", "intScoreVotes": "3", "intTotalListeners": "92865", "intTotalPlays": "346584", "strMusicBrainzID": "360a21a5-68e9-4f34-a4f6-fb306f870c82", "strMusicBrainzAlbumID": "d74f72d8-d7e1-3106-8fd1-749d96b975e8", "strMusicBrainzArtistID": "3bdcd49d-212e-4f4f-877a-eac1e4a2bddc", "strLocked": "Unlocked"}]}