{"track": [{"idTrack": "32780534", "idAlbum": "2114807", "idArtist": "111828", "idLyric": "271689", "idIMVDB": null, "strTrack": "Behind These Hazel Eyes", "strAlbum": "Breakaway", "strArtist": "Kelly Clarkson", "strArtistAlternate": null, "intCD": null, "intDuration": "198880", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Behind These Hazel Eyes\" is a song recorded by American singer Kelly Clarkson for her second studio album, Breakaway (2004). It was written by Clarkson with the song's producers Max Martin and Dr. Luke. The song was released on April 12, 2005 as the second single from the album. Clarkson considered \"Behind These Hazel Eyes\" as one of her favorite songs and she once intended to name Breakaway after the song. \"Behind These Hazel Eyes\" is an uptempo pop rock song that incorporates crunchy guitars which are pulsated with driving beats and anthemic choruses; it narrates Clarkson's broken relationship with her ex-boyfriend.\n\n\"Behind These Hazel Eyes\" received generally positive reviews from critics, who considered the song as a decent follow-up to Clarkson's previous single \"Since U Been Gone.\" Critics also lauded Clarkson's vocal ability which simmers alongside the steroid-charged musical backdrop that is fun, fast and furious. Commercially, \"Behind These Hazel Eyes\" was successful in the United States; it peaked at number six on the Billboard Hot 100. It also became Clarkson's first song to top the Adult Pop Songs chart. It was certified platinum from Recording Industry Association of America (RIAA) for selling over one million digital downloads. Elsewhere, the song charted inside the top ten in Austria, Netherlands, New Zealand and the United Kingdom.\n\nThe song's accompanying music video was directed by Joseph Kahn and produced by Danyi Deats-Barrett. The concept of the video was conceived by Clarkson and depicts her as a bride who experiences some dream-like hints that her husband-to-be is having an affair with a brunette ceremony attendee. The music video premiered online at MTV and it also received heavy rotation on Total Request Live. The song was performed live by Clarkson at numerous venues, including the Breakaway World Tour (2006) and the All I Ever Wanted Tour (2009).", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vxswxv1383078154.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=yipoOY56MbM", "strMusicVidDirector": "Joseph Kahn", "strMusicVidCompany": "SuperMega", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "23424938", "intMusicVidLikes": "99190", "intMusicVidDislikes": "1137", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "3", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "482529", "intTotalPlays": "2808317", "strMusicBrainzID": "5205cff6-b2f2-4319-be54-a2b1edc00ee3", "strMusicBrainzAlbumID": "0d0ddce6-a611-3dc0-923c-60ac3da72ad8", "strMusicBrainzArtistID": "d339efbb-77b9-4147-ba9e-59f2f24550b2", "strLocked": "Unlocked"}]}