{"track": [{"idTrack": "32757480", "idAlbum": "2112938", "idArtist": "111486", "idLyric": "203141", "idIMVDB": "0", "strTrack": "Boulevard of Broken Dreams", "strAlbum": "American Idiot", "strArtist": "Green Day", "strArtistAlternate": null, "intCD": null, "intDuration": "261000", "strGenre": "Punk Rock", "strMood": "Excitable", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Boulevard of Broken Dreams\" is a song by American punk rock band Green Day, recorded for their seventh studio album American Idiot (2004). Reprise Records released \"Boulevard of Broken Dreams\" as the second single from American Idiot. The song's lyrics were written by lead singer Billie Joe Armstrong, and composed by the band. Production was handled by Rob Cavallo and Green Day. \"Boulevard of Broken Dreams\" remains one of Green Day's signature songs.\n\nThe song speaks from the point of view of American Idiot's main character, Jesus of Suburbia, and is a moderate midtempo song characterized by somber and bleak lyrics. This is in contrast to the previous track on the album, \"Holiday\", which illustrates Jesus of Suburbia's high of being in The City. MTV's Green Day Makes a Video described \"Holiday\" as a party, and \"Boulevard of Broken Dreams\" as the subsequent hangover.\n\nThe song was ranked the number one on Rolling Stone's Reader's Choice: Singles of the Decade list in 2009 and number 65 on the 100 Best Songs of the Decade list in the same year. It has sold over 2 million copies in the United States as of 2010. The single peaked at #2 on the Billboard Hot 100, making it Green Day's most successful song in the United States. The song was the ninth-highest-selling single of the 2000–2009 decade with worldwide sales exceeding 5 million copies. \"Boulevard of Broken Dreams\" won the Grammy Award for Record of the Year.\n\n\"Boulevard of Broken Dreams\" was written during a respite from pre-production on what would become the band's seventh album, American Idiot. Hoping to clear his head and develop new ideas for songs, Green Day frontman Billie Joe Armstrong traveled to New York City alone for a few weeks, renting a small loft in the East Village of Manhattan. He spent much of this time taking long walks and participating in jam sessions in the basement of Hi-Fi, a bar in Manhattan. He began socializing with songwriters Ryan Adams and Jesse Malin.\n\nArmstrong wrote the song about his time in New York City, about \"feeling alone\" and trying to take power from that fact. Armstrong felt the song fit nicely with the album's storyline, which is about \"going away and getting the hell out, while at the same time fighting their own inner demons.\" The song's title is from a James Dean poster in which he is walking through New York with an overcoat on.\n\n\"Boulevard of Broken Dreams\" is set in common time and composed in the key of F minor, like \"Holiday\", its prelude. The opening features an electric guitar with tremolo playing the verse progression, which is a i–III–VII–IV progression (Fm–A♭–E♭–B♭). The song's distinct tremolo effect on the opening guitar was achieved by digitally manipulating the recording in ProTools. It was difficult to produce, as it needed to remain in sync with the song's tempo. Armstrong added tracks of acoustic guitar-playing to augment his electric guitar rhythms and Cool's drumming. Billie Joe's vocals begin, accompanied by acoustic guitar. The bass and drums enter after the first two lines. The pre chorus features a memorable lead guitar melody before seguing into the distorted chorus. The chorus contains a VI–III–VII–i power chord progression (D♭5–A♭5–E♭5–Fm 5), ending on a C5 power chord vamp. The solo following the second chorus follows the verse progression while the outro follows a heavily distorted i–VI–VII–iv power chord progression (Fm–D♭–E♭–B♭5–A♭–C).\n\nThe award-winning music video for \"Boulevard of Broken Dreams\" was directed by Samuel Bayer. The music videos for \"Holiday\" and \"Boulevard of Broken Dreams\" were filmed with a single, continuous storyline—the video for \"Boulevard of Broken Dreams\" picks up where \"Holiday\" has left off, with the last few seconds of \"Holiday\" audible at the start of the \"Boulevard of Broken Dreams\" video. The video depicts the band members after their car has stalled in the desert, and they begin a melancholy walk down a dusty road. Scenes are interspersed with film footage, taken from around Los Angeles, of homeless people and other miserable sights. The video also features performance footage of the band playing the song in an abandoned warehouse.\n\nThe video features a 1968 green Mercury Monterey convertible that was modified for filming in the \"Holiday\" and \"Boulevard of Broken Dreams\" videos. The car features a hood ornament in the shape of the hand and heart grenade image from the American Idiot album cover, which was also used in the video for \"Holiday\". But the \"iron fist\" was actually used in the video for \"Walking Contradiction\", when the band members meet at a car towards the end of the video. The band's name is also on the front of the hood in silver letters. The band rode this car to the 2005 MTV Video Music Awards ceremony. As shown in an MTV Making the Video special, Bayer used unorthodox techniques to achieve the aged look of the \"Boulevard of Broken Dreams\" video, including using rear projection (as opposed to green screen) and physical damaging the negative: scratching the film with razor blades, pouring coffee on it, and smudging cigarettes on it.\n\nThe video won six awards at the MTV Video Music Awards in 2005, most notably for Video of the Year. It also won Best Group Video, Best Rock Video, Best Direction, Best Editing, and Best Cinematography.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/tvxstt1484319360.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=Soa3gO7tL-c", "strMusicVidDirector": "Samuel Bayer", "strMusicVidCompany": "Black Dog Films", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "115154697", "intMusicVidLikes": "853596", "intMusicVidDislikes": "13851", "intMusicVidFavorites": "0", "intMusicVidComments": "44314", "intTrackNumber": "4", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "1168667", "intTotalPlays": "8121147", "strMusicBrainzID": "0ba72f0d-70ae-4655-94d9-c1069b5abcfb", "strMusicBrainzAlbumID": "de9bf827-a9b0-348b-a7c9-556c03c3fb07", "strMusicBrainzArtistID": "084308bd-1654-436f-ba03-df6697104e19", "strLocked": "Unlocked"}]}