{"track": [{"idTrack": "32926040", "idAlbum": "2126355", "idArtist": "113724", "idLyric": "0", "idIMVDB": "0", "strTrack": "Hate It or Love It", "strAlbum": "The Documentary", "strArtist": "Game", "strArtistAlternate": "The Game", "intCD": null, "intDuration": "206400", "strGenre": "Hip-Hop", "strMood": "...", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Hate It or Love It\" is a single by American rapper and West Coast hip hop artist The Game, featuring vocals from 50 Cent. It was released as the third official single from The Game's debut studio album The Documentary (2005). The song features production from duo Cool & Dre, with additional production from Dr. Dre. The song features a music sample of \"Rubber Band\" by The Trammps from their debut album The Legendary Zing Album (1975). \"Hate It or Love It\" achieved commercial success worldwide. The track peaked within the top 10 in multiple countries, including the United Kingdom, Ireland, Netherlands and New Zealand. The single was commercially successful in the United States, peaking at #2 on the Billboard Hot 100 for five consecutive weeks, becoming The Game's second top-five single on the chart as a lead artist and 50 Cent's eighth overall top-ten hit.\n\nThe song was blocked from the number one position on the Billboard Hot 100 by The Game's former G-Unit member-turnt-rival, 50 Cent (who was also featured in this song), with his hit single, \"Candy Shop\", (featuring G-Unit Records' first female artist Olivia). \"Hate It or Love It\" reached the number one spot on the Hot R&B/Hip-Hop Songs, making it yet again another top five hit on the chart alongside \"How We Do\" which also featured 50 Cent. At the 2006 48th Annual Grammy Awards the song was nominated for two Grammy Awards, including Grammy Award for Best Rap Song and Grammy Award for Best Rap Performance by a Duo or Group but lost in both categories to Kanye West's \"Diamonds from Sierra Leone\" and The Black Eyed Peas' \"Don't Phunk with My Heart\", respectively. Music critics praised the song as some of The Game's best work to date, as well for the nature of the song.\n\nThe song first began to be conceived during the middle period of the recording process for The Documentary, in early 2004, during a recording process in which The Game would frequently fly to recording locations in New York City to work with 50 Cent: He would be given beats to hear along the way, to help inspire him artistically. When he initially heard the production that would later become \"Hate It or Love It\", he did not display much interest, as he was \"in a different mind frame\" — artistically, he was conceiving more \"hard hitting\" records. However, on the flight home later that day, he took more of an interest and began to write the first components of the song.\n\nThe chorus is sung and written by 50 Cent, who helped with the rest of the writing process and recording for the song, along with The Game, at his mansion in Connecticut. The song was even suggested for 50 Cent's album The Massacre (2005), due to 50 Cent's large artistic input: When The Game arrived at the mansion on the day of recording, 50 Cent presented him with several already part-completed records, with variously placed verses and choruses. The Game wrote his final verse first and worked backward: He apparently did this to avoid tiredness affecting his later verses. After 50 Cent heard the final version of the song after the recording process had finished, he was very excited by its potential and felt the song would have to be one of the album's singles. It was later released as the album's third, after \"Westside Story\" and \"How We Do\", both of which also featured 50 Cent.\n\nThe aforementioned original production for \"Hate It or Love It\" first surfaced on a compilation CD, put together by Cool & Dre (who had been in contact with The Game since early 2002) released unofficially to the local rap community. After G-Unit Records producer Sha Money XL received a copy of this disc, he requested a meeting with the duo, feeling that the song had much potential to be a hit. After Dr. Dre heard the original production, he made sonic alterations and, according to Aftermath Entertainment A&R Mike Lynn, \"made it sound like a record\", a process he carried out on all of the other tracks on The Documentary. When Interscope Records chairman Jimmy Iovine later requested to hear the original production, he admitted could not tell the difference: Cool & Dre later praised the quality of Dr. Dre's mix, stating that \"Dre brought it to life...  I think is his best quality... his ear for instrument placement is amazing\".", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uwsqrv1484235591.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=BuMBmK5uksg", "strMusicVidDirector": "The Saline Project", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "104274755", "intMusicVidLikes": "321160", "intMusicVidDislikes": "10384", "intMusicVidFavorites": "0", "intMusicVidComments": "30677", "intTrackNumber": "4", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "e608c965-ee42-47c0-b17c-7e36c0799fac", "strMusicBrainzAlbumID": "59e16e18-b446-3ccf-a67f-ca447f610ed9", "strMusicBrainzArtistID": "07cc14fb-4784-4a25-804b-2686ed5ef52c", "strLocked": "Unlocked"}]}