{"track": [{"idTrack": "32780533", "idAlbum": "2114807", "idArtist": "111828", "idLyric": "271694", "idIMVDB": null, "strTrack": "Since U Been Gone", "strAlbum": "Breakaway", "strArtist": "Kelly Clarkson", "strArtistAlternate": null, "intCD": null, "intDuration": "188893", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Since U Been Gone\" is a song recorded by American singer Kelly Clarkson from her second studio album, Breakaway (2004). The song, which was written and produced by \"Max\" Martin Sandberg and Lukasz \"Dr. Luke\" Gottwald, was released on November 16, 2004 by RCA Records as the lead single from the album. It is an uptempo pop rock, pop punk, and power pop song that infuses electronic sound with a mixture of soft and loud alternative-rock sound. Martin originally wrote \"Since U Been Gone\" with Pink in mind but she turned it down. It was then given to Hilary Duff but she rejected the song because she could not reach its higher notes. The song was finally given to Clarkson after Clive Davis convinced the writers to give it to her. Clarkson decided to add heavier guitars and harder drums to the song after noticing that the demo had an obvious pop sound. \"Since U Been Gone\" is the last track that Clarkson recorded for Breakaway. Lyrically, the song is written from a woman's point of view where she expresses her sense of relief with the end of her troubled relationship.\n\n\"Since U Been Gone\" garnered positive reviews from music critics who considered the song to be the highlight of Breakaway. Critics also felt that it was one of the best pop songs in the last decade. \"Since U Been Gone\" was a commercial success. In the United States, the song peaked at number two on the Billboard Hot 100. It topped the US Pop 100 for six consecutive weeks and the US Pop Songs for seven consecutive weeks respectively. It was certified platinum by the Recording Industry Association of America (RIAA) for shipments of over one million copies sold. \"Since U Been Gone\" was also a worldwide success, peaking in the top five in Austria, Australia, Ireland, the Netherlands and the United Kingdom. It also peaked in the top ten in Norway, Germany and Switzerland.\n\nClarkson performed \"Since U Been Gone\" at the 2005 MTV Video Music Awards and at the 2006 BRIT Awards. It was included on the set-list of Clarkson's My December Tour, All I Ever Wanted Tour and Stronger Tour. The song's accompanying music video was directed by Alex Da Rakoff which shows Clarkson ruining her ex-boyfriend's apartment. The music video was nominated for three awards in the 2005 MTV Music Awards, winning two out of the three awards namely Best Female Video and Best Pop Video. At the 48th Grammy Awards, the song won the award for Best Female Pop Vocal Performance. \"Since U Been Gone\" was covered by many artists notably the American rock band A Day to Remember, indie rocker Ted Leo as well as the Canadian indie rock band, Tokyo Police Club.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xwtqwy1383077831.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=R7UrFYvl5TE", "strMusicVidDirector": "Alex DeRakoff", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/sttspx1383083481.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/tvqpys1383083624.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/wwsxtv1383083633.jpg", "intMusicVidViews": "25252718", "intMusicVidLikes": "104328", "intMusicVidDislikes": "2197", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "2", "intScore": "9.83333", "intScoreVotes": "6", "intTotalListeners": "688197", "intTotalPlays": "3868920", "strMusicBrainzID": "1675df7d-f337-4b4a-8ee6-70122723cbcc", "strMusicBrainzAlbumID": "0d0ddce6-a611-3dc0-923c-60ac3da72ad8", "strMusicBrainzArtistID": "d339efbb-77b9-4147-ba9e-59f2f24550b2", "strLocked": "Unlocked"}]}