{"track": [{"idTrack": "32726715", "idAlbum": "2109893", "idArtist": "111260", "idLyric": "317224", "idIMVDB": "0", "strTrack": "We Belong Together", "strAlbum": "The Emancipation of Mimi", "strArtist": "Mariah Carey", "strArtistAlternate": null, "intCD": null, "intDuration": "201000", "strGenre": "R&B", "strMood": "In Love", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"We Belong Together\" is a song by American singer Mariah Carey from her tenth studio album, The Emancipation of Mimi (2005). The song was released on March 29, 2005, through Island Records, as the second single from the album. \"We Belong Together\" was written by Carey, Jermaine Dupri, Manuel Seal, and Johntá Austin, and produced by the former three. As the song samples lyrics from Bobby Womack's \"If You Think You're Lonely Now\" (1981) and the Deele's \"Two Occasions\" (1987), several other songwriters are credited. \"We Belong Together\" is built on a simple piano arrangement with an understated backbeat. The lyrics chronicle a woman's desperation for her former lover to return.\n\nFollowing her decline in popularity between 2001 and 2005, critics dubbed the song her musical comeback, as many had considered her career over. \"We Belong Together\" earned her several music industry awards and nominations throughout 2005–06. The song broke chart records in the United States and became Carey's sixteenth topper on the US Billboard Hot 100. After staying at number one for fourteen non-consecutive weeks, it was placed as the second longest running number one song in US chart history, behind Carey's own \"One Sweet Day,\" collaboration with Boyz II Men (1995). Billboard listed it as the \"song of the decade\" and the ninth most popular song of all time. Additionally, it broke several airplay records, gathering both the largest one-day and one-week audiences in history. \"We Belong Together\" also topped the charts in Australia and reached the top two in Canada, New Zealand, and the United Kingdom.\n\nThe song's music video was filmed as a two-part story with \"It's Like That\", which featured Carey at her bachelorette party. The video for \"We Belong Together\" is a continuation focusing on Carey's wedding to an older and powerful man and ends with the singer eloping with her ex-lover. Rumors arose of the video's connection to her 1993 marriage to Tommy Mottola. Carey performed the song on several award shows and television appearances around the world, namely 2005 MTV Movie Awards, MTV Video Music Awards, Macy's Fourth of July Parade, The Oprah Winfrey Show and the 48th Grammy Awards. In Europe the song was performed at the Live 8 charity concert, the Fashion Rocks in Monaco, and the German Bambi Awards. Carey performed the song on both her Adventures of Mimi and Angels Advocate Tours.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rqwqtq1486133908.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=0habxsuXW4g", "strMusicVidDirector": "Brett Ratner", "strMusicVidCompany": "HSI Productions", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "210953362", "intMusicVidLikes": "585368", "intMusicVidDislikes": "23230", "intMusicVidFavorites": "0", "intMusicVidComments": "37958", "intTrackNumber": "2", "intLoved": "2", "intScore": "10", "intScoreVotes": "6", "intTotalListeners": "473397", "intTotalPlays": "3280071", "strMusicBrainzID": "1dfdf2b6-a5c5-463a-a8a6-3d70cb661793", "strMusicBrainzAlbumID": "2391debf-38aa-3a90-888e-51f857131e98", "strMusicBrainzArtistID": "494e8d09-f85b-4543-892f-a5096aed1cd4", "strLocked": "Unlocked"}]}