{"track": [{"idTrack": "32986268", "idAlbum": "2131346", "idArtist": "114465", "idLyric": "0", "idIMVDB": "0", "strTrack": "Children", "strAlbum": "Dreamland", "strArtist": "Robert Miles", "strArtistAlternate": null, "intCD": null, "intDuration": "379373", "strGenre": "Electronic", "strMood": "...", "strStyle": "Electronic", "strTheme": "...", "strDescriptionEN": "\"Children\" is a song by Italian trance composer Robert Miles. It was first released in Italy in January 1995 as part of the EP Soundtracks on Joe Vanelli's DBX label, but it did not chart. Vanelli brought the track to a nightclub in Miami where it was heard by Simon Berry of Platipus Records. Berry worked with Vanelli and James Barton (of Liverpool's Cream nightclub) to release the song in November 1995 as the lead single from his album Dreamland. The song is Miles' most successful single, being certified Gold and Platinum in several countries and it reached number one in more than 12 countries.\n\nMiles has stated two motives for the writing of \"Children\". One was as a response to photographs of child war victims his father had brought home from a humanitarian mission in the former Yugoslavia; the other, inspired by his career as a DJ, was to create a track to end DJ sets, intended to calm rave attendants prior to their driving home as a means to reduce car accident deaths.\n\n\"Children\" is one of the pioneering tracks of dream house, a genre of electronic dance music characterized by dream-like piano melodies, and a steady four-on-the-floor bass drum. The creation of dream house was a response to social pressures in Italy during the early 1990s: the growth of rave culture among young adults, and the ensuing popularity of nightclub attendance, had created a weekly trend of deaths due to car accidents as clubbers drove across the country overnight, falling asleep at the wheel from strenuous dancing as well as alcohol and drug use. In mid-1996, deaths due to this phenomenon, called strage del sabato sera (Saturday night slaughter) in Italy, were being estimated at around 2000 since the start of the decade. The move by DJs such as Miles to play slower, calming music to conclude a night's set, as a means to counteract the fast-paced, repetitive tracks that preceded, was met with approval by authorities and parents of car crash victims.\n\nCritic Boris Barabanov claims similarity between \"Children\" and Garik Sukachov's song \"Napoi menia vodoi\", and admits song \"Napoi menia vodoi\" was written before \"Children\". Russian singer Garik Sukachov explained that he gave consent on using his melody by Italian counterparties.\n\nBillboard ascribes the final stage of the song's promotion to the airing of its music video on music television networks such as MTV Europe and Germany's VIVA. Two videos were produced, the first being the one Billboard discusses: black-and-white footage of a small girl riding in a car through a diverse range of landscape which was directed by Matt Amos. The locations are London (Piccadilly Circus and Trafalgar Square), Paris (The Eiffel Tower can be seen), Geneva (place du Molard, rue Coutance) and countryside in Switzerland (Robert Miles's home country), and France and Italy near the Mont-Blanc Tunnel.\n\nThe second video, filmed in colour, alternates between images of Miles DJing at a nightclub rave and images of children at play, thereby touching upon both of the themes of the song.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/svruws1484225545.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=CC5ca6Hsb2Q", "strMusicVidDirector": "Elizabeth Bailey", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "33909424", "intMusicVidLikes": "181417", "intMusicVidDislikes": "3666", "intMusicVidFavorites": "0", "intMusicVidComments": "10192", "intTrackNumber": "9", "intLoved": "1", "intScore": "9.6", "intScoreVotes": "5", "intTotalListeners": "257415", "intTotalPlays": "1190879", "strMusicBrainzID": "0034a299-3756-4aa5-b4d9-5c9d46136f2b", "strMusicBrainzAlbumID": "8c605cec-ace8-3950-bfc9-875a4a88a285", "strMusicBrainzArtistID": "e83144dd-bb95-49fe-b1dd-00bab25cca9e", "strLocked": "Unlocked"}]}