{"track": [{"idTrack": "32759908", "idAlbum": "2113128", "idArtist": "111517", "idLyric": "364539", "idIMVDB": "0", "strTrack": "Just a Girl", "strAlbum": "Tragic Kingdom", "strArtist": "No Doubt", "strArtistAlternate": null, "intCD": null, "intDuration": "209093", "strGenre": "Pop", "strMood": "In Love", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Just a Girl\" is a song by the American rock band No Doubt. The song was released in 1995 as the album's lead single and helped the band break into mainstream music, peaking at number 23 on the U.S. Billboard Hot 100.\n\nUpon release in the UK in 1996 the song only reached number 38. However, after the massive success of \"Don't Speak\" the song was re-released and managed a peak of number 3.\n\n\"Just a Girl\" was first aired on the Californian radio show Ska Parade. It was also featured in the movie Clueless and the opening credits of Romy and Michele's High School Reunion.\n\nAfter primary songwriter Eric Stefani left No Doubt in 1994, the rest of the band took on the role of songwriters for the band, which dramatically changed the band's musical style. Tragic Kingdom was the first album on which the band had written most of the material and singer Gwen Stefani had written the lyrics, and there were claims that the band had \"sold out\" - dropped their own style to pick up a more popular one in order to make more money. Tom Dumont explained the change of style in an interview with Backstage Online:\n\n“\tThis album was our first attempt . It was Gwen's first time really writing all the lyrics herself so to me, it went the opposite from selling out, we have done something that is even more personal. In the past, Eric was writing songs about his life and having Gwen sing them. Now we have Gwen singing and writing about her own experiences. It makes it more natural. She's a singer, she should sing about herself or sing what she wants to sing. I think that is the main reason why our musical style has changed.\t”\nThe song itself is written about Gwen Stefani's exasperation over female stereotypes, portraying women as weak and in need of a man to look after them. This is evident from lyrics such as \"Don't you think I know / Exactly where I stand? / This world is forcing me / To hold your hand.\" She explained her inspiration in an interview for BAM Magazine:\n\n“\tI wrote that because my dad got mad at me for going to Tony 's house and driving home late at night. I mean, c'mon, I'm, like, going on 30 here! I wouldn't trade , but I really don't think guys understand what a burden it can be sometimes.\n\nThe video begins with the band members loading their silver car with recording equipment in front of the Stefani household. Gwen Stefani stands in front of a damaged red car and sings. They drive away, with Tom Dumont, Gwen Stefani and Tony Kanal sitting in the backseats. The band arrive at a building where Stefani enters the ladies' bathroom, carrying a boombox, and the rest of the band enters the gents', carrying speakers, instruments and electrical equipment. The ladies' bathroom is clean, brightly decorated and well furnished with flowers, fruit and two female assistants. The gents' bathroom is dark, dirty and bare-walled. The men set up and play their equipment in the gents' while Stefani sings in ladies'. Various men and women enter their respective bathrooms; the men use the urinals and the women check their make-up, before dancing with the band. Eventually, the men take to lifting each other through the ceiling to get into the other bathroom and the video ends with everyone dancing together in the ladies'.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=PHzOOQfhPFg", "strMusicVidDirector": "Mark Kohr", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "35452451", "intMusicVidLikes": "113766", "intMusicVidDislikes": "3689", "intMusicVidFavorites": "0", "intMusicVidComments": "7220", "intTrackNumber": "3", "intLoved": "1", "intScore": "9.16667", "intScoreVotes": "6", "intTotalListeners": "619321", "intTotalPlays": "3001237", "strMusicBrainzID": "693e1e1e-04b8-441f-bcaa-5c0c33acdff2", "strMusicBrainzAlbumID": "04b0b075-bed7-388b-b44b-cf34077ad96c", "strMusicBrainzArtistID": "fbd2a255-1d57-4d31-ac11-65b671c19958", "strLocked": "Unlocked"}]}