{"track": [{"idTrack": "34024871", "idAlbum": "2216614", "idArtist": "117906", "idLyric": "250414", "idIMVDB": "0", "strTrack": "One of Us", "strAlbum": "Relish", "strArtist": "Joan Osborne", "strArtistAlternate": null, "intCD": null, "intDuration": "323733", "strGenre": "", "strMood": "...", "strStyle": "...", "strTheme": null, "strDescriptionEN": "\"One of Us\" is a song written by Eric Bazilian (of The Hooters) and originally released by Joan Osborne. Released in March 1995 on the album Relish and produced by Rick Chertoff, it became a Top 40 hit in November of that year. The song is the theme song for the American television series Joan of Arcadia. The song was nominated for three Grammys and peaked at number four on the Billboard Hot 100.\n\nIn an interview, Bazilian said, \"I wrote  one night — the quickest song I ever wrote — to impress a girl. Which worked, because we're married and have two kids. But we were in the middle of writing Joan's album, which was a group effort with Rick Chertoff and Joan and Rob and I, and I did a demo of 'One of Us,' this wacky little demo which I ended up putting as a hidden track on the CD of my first solo record, and I played  for them. And it really hadn't even occurred to me that it was something that Joan might do, but Rick, in his wisdom, asked Joan if she thought she could sing it. And I think it was better that he asked it that way rather than 'Do you want to sing it?' Because the answer to that might not have been yes. But she definitely said she could sing it, and we did a little live demo of a guitar and her singing it. And when I got into my car and popped the cassette in, I started practicing the Grammy speech that I should've gotten to give.\"\n\nThe song deals with various aspects of belief in God by asking questions inviting the listener to consider how they might relate to God, such as \"Would you call  to his face?\" or \"Would you want to see  if seeing meant that you would have to believe in things like heaven and in Jesus and the saints and all the prophets?\"\n\nThe album version starts off with the first four lines of a recording titled \"The Aeroplane Ride\", made on October 27, 1937 by American folklorist Alan Lomax and his wife Elizabeth for the Archive of American Folk Song at the Library of Congress, of Mrs. Nell Hampton of Salyersville, Kentucky singing a variation of the 1928 John S. McConnell hymn \"Heavenly Aeroplane\".\n\nDirected by Mark Seliger and Fred Woodward, the video was mainly shot on Coney Island, with various attractions like rollercoasters, ferris wheels and the New York Aquarium shown, interchanged with the vintage-looking shots in sepia and Joan singing in front of the camera.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "Mark Seliger", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": "0", "intMusicVidComments": "0", "intTrackNumber": "6", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "379918", "intTotalPlays": "1952140", "strMusicBrainzID": "6b614dbc-248b-42e7-b93b-9512268b3ce4", "strMusicBrainzAlbumID": "6c9c1c47-e34a-3eab-9ea5-1ce8cd875b41", "strMusicBrainzArtistID": "746916c9-fd36-44e6-823d-03185e596f58", "strLocked": "Unlocked"}]}