{"track": [{"idTrack": "32768625", "idAlbum": "2113855", "idArtist": "111626", "idLyric": "0", "idIMVDB": "2147483647", "strTrack": "Boyfriend", "strAlbum": "Believe", "strArtist": "Justin Bieber", "strArtistAlternate": null, "intCD": null, "intDuration": "172000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Boyfriend\" is a song by Justin Bieber from his third studio album Believe (2012). Bieber explained that the track would surprise people in different ways, since it is a musical departure from his previous material. A snippet of \"Boyfriend\" was previewed on The Ellen DeGeneres Show on March 1, 2012. The song was announced as a single on the same day, and was released on March 23, 2012. The cover art was revealed on March 19, 2012.\n\nMusically, \"Boyfriend\" is a R&B influenced song that features pop beats reminiscent of American record producer Pharrell Williams and boy band 'N Sync. The instrumentation is kept in a lower sound to highlight Bieber's vocals. However, critics dismissed the lyrics as immature and silly. \"Boyfriend\" was a commercial success, debuting at number two on the Billboard Hot 100 after selling a total of 521,000 digital units of the single. The song is the second-highest-ever debut digital sales week in the United States (after Taylor Swift's \"We Are Never Ever Getting Back Together\" which sold 623,000 in its first week), and has also charted at number 9 on the Pop Songs component chart. It also debuted at number one in Canada and number two in the United Kingdom.\n\nIsland Records initially commissioned a music video to be directed by Colin Tilley; however, the video was later scrapped and re-shot with Director X. Released on May 3, 2012, the video broke the VEVO record for having the most views in a 24-hour period with 8.00 million, later bested by One Direction's \"Live While We're Young\" (8.24 million). As part of promotion for the song, Bieber performed \"Boyfriend\" in a number of live appearances, including at the second season finale of The Voice, and at the 2012 Billboard Music Awards. The rapping duo Ying Yang Twins also released a remixed version of the track with new verses added. Another remix of \"Boyfriend\" features 2 Chainz, Mac Miller and Asher Roth.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/sypyqw1359093792.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=4GuqB1BQVr4", "strMusicVidDirector": "Director X", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "454585643", "intMusicVidLikes": "1992634", "intMusicVidDislikes": "729354", "intMusicVidFavorites": "0", "intMusicVidComments": "670355", "intTrackNumber": "2", "intLoved": "1", "intScore": "10", "intScoreVotes": "3", "intTotalListeners": "312136", "intTotalPlays": "2208586", "strMusicBrainzID": "3891874d-82cd-4ca6-bbbb-984b4f9b881d", "strMusicBrainzAlbumID": "df46f245-7f62-4982-9d2c-e83d7be91cbf", "strMusicBrainzArtistID": "e0140a67-e4d1-4f13-8a01-364355bee46e", "strLocked": "Unlocked"}]}