{"track": [{"idTrack": "32882209", "idAlbum": "2122843", "idArtist": "112627", "idLyric": "0", "idIMVDB": null, "strTrack": "Call Me Maybe", "strAlbum": "Kiss", "strArtist": "Carly Rae Jepsen", "strArtistAlternate": null, "intCD": null, "intDuration": "193000", "strGenre": "Pop", "strMood": "Excitable", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Call Me Maybe\" is a song recorded by Canadian singer-songwriter Carly Rae Jepsen for her EP Curiosity (2012) and appearing on her international debut album, Kiss. The song was written by Jepsen and Tavish Crowe as a folk song, but its genre was modified to pop following the production by Josh Ramsay. It was released as the lead single from the EP on 20 September 2011, through 604 Records. Jepsen was signed to Schoolboy Records, releasing her single in the United States through the label, as the first single from Kiss. Musically, \"Call Me Maybe\" is an upbeat teen pop track that draws influences from dance-pop and disco. Lyrically, the track alludes to the inconvenience that a love at first sight brings to a girl who hopes for a call back from a crush.\n\nThe song received generally positive reviews from contemporary critics, who praised its composition and clever lyrical content. \"Call Me Maybe\" has attained commercial success worldwide, reaching number one in Australia, Czech Republic, Denmark, Finland, France, Hungary, Ireland, Luxembourg, New Zealand, Poland, Slovakia, Switzerland, the United Kingdom and the United States, while peaking inside the top three in Austria, Belgium (Flanders & Wallonia), Germany, Israel, Japan, Netherlands, Norway, and Sweden. After reaching the top position in Canada, Jepsen became only the fifth Canadian artist to do so in her home country since 2007. In the United States, the track reached number one on the Billboard Hot 100 and the Pop Songs chart. The song is the first number one by a Canadian female artist on the Billboard Hot 100 chart since 2007's \"Girlfriend\" by Avril Lavigne. With worldwide sales of over 10 million copies, \"Call Me Maybe\" is one of the best-selling digital singles of all time.\n\nAn accompanying music video was directed by Ben Knechtel. In it, Jepsen seeks the attention of an attractive boy next door who is revealed at the close of the story to be attracted to a male band member. As part of promotion for the song, the singer has performed the track on The Ellen DeGeneres Show, where she made her US television debut, and at the 2012 Billboard Music Awards. \"Call Me Maybe\" has been covered by several artists, including Katy Perry, Kelly Clarkson, Dan Deacon, Fun, Big Time Rush, The Chipettes, R5, Lil' Wayne, Enter Shikari, Ben Howard, Nickelback, Cody Simpson, The Saturdays, Glee and parodied by Cookie Monster and some of the news staff of National Public Radio. It was also covered on the season premiere episode, \"The New Rachel\", of the fourth season of Glee. The song used in in other television shows, Castle, Jane by Design, Degrassi: The Next Generation, and 90210.\n\n\"Call Me Maybe\" was nominated for two Grammy Awards, for Song of the Year and Best Pop Solo Performance at the 55th Annual ceremony, which will be held on 10 February 2013. On 11 December 2012, \"Call Me Maybe\" was named Song of the Year of 2012 by MTV. In its 2012 Year-End issue, Billboard Magazine ranked this song #2 in the Hot 100 Songs, Digital Songs, and Canadian Hot 100 Songs charts, in each case behind \"Somebody That I Used to Know\", by Gotye featuring Kimbra. The song was also ranked number one by the Village Voice's annual Pazz and Jop poll, which compiles the votes of music critics from all over the United States. The song was the best-selling single worldwide in 2012, selling 10 million copies in that year alone, and best-selling single in iTunes Store in 2012.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vsspry1359183885.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=fWNaR-rxAic", "strMusicVidDirector": "Ben Knechtel", "strMusicVidCompany": "Twin Engine Films", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/sxsytq1418393847.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/xpsxqq1418393854.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/srppxs1418393860.jpg", "intMusicVidViews": "1497857046", "intMusicVidLikes": "8450716", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "633886", "intTrackNumber": "3", "intLoved": "4", "intScore": "9.625", "intScoreVotes": "8", "intTotalListeners": "793480", "intTotalPlays": "7573959", "strMusicBrainzID": "00a6443c-6a0e-4618-9509-4476256ee313", "strMusicBrainzAlbumID": "e7ce6cac-d26e-470c-b8a1-97ecc07354df", "strMusicBrainzArtistID": "09887aa7-226e-4ecc-9a0c-02d2ae5777e1", "strLocked": "Unlocked"}]}