{"track": [{"idTrack": "32917736", "idAlbum": "2125730", "idArtist": "113610", "idLyric": "0", "idIMVDB": null, "strTrack": "Gangnam Style", "strAlbum": "PSY 6 (Six Rules), Part 1", "strArtist": "PSY", "strArtistAlternate": "싸이", "intCD": null, "intDuration": "222000", "strGenre": "K-Pop", "strMood": "Weird", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Gangnam Style\" is the 18th K-pop single by the South Korean musician PSY. The song was released in July 2012 as the lead single of his sixth studio album PSY 6 (Six Rules), Part 1, and debuted at number one on South Korea's Gaon Chart. On December 21, 2012, \"Gangnam Style\" became the first YouTube video to reach a billion views. As of April 1, 2013, the music video has been viewed over 1.5 billion times on YouTube, and it is the site's most watched video after surpassing Justin Bieber's single \"Baby.\"\nThe phrase \"Gangnam Style\" is a Korean neologism that refers to a lifestyle associated with the Gangnam District of Seoul. The song and its accompanying music video went viral in August 2012 and have influenced popular culture worldwide since then. \"Gangnam Style\" received mixed to positive reviews, with praise going to its catchy beat and PSY's amusing dance moves (which themselves have become a phenomenon) in the music video and during live performances in various locations around the world. In September 2012, \"Gangnam Style\" was recognized by Guinness World Records as the most \"liked\" video on YouTube. It subsequently won Best Video at the MTV Europe Music Awards held later that year. It became a source of parodies and reaction videos by many different individuals, groups and organizations while also inspiring dance mobs in Paris, Rome, and Milan, with tens of thousands of participants each. On New Year's Eve 2012, more than one million people witnessed a live \"Gangnam Style\" performance in Times Square, New York City, featuring PSY and rapper MC Hammer; as well as in front of the Brandenburg Gate in Berlin.\nBy the end of 2012, the song had topped the music charts of more than 30 countries including Australia, Canada, France, Germany, Italy, Russia, Spain, and the United Kingdom. Although its reception in Japan remained lukewarm, \"Gangnam Style\" topped China's Baidu 500 download list and was labelled by state media as having a \"divine melody.\"\nAs the song continued to rapidly gain popularity and ubiquity, its signature dance moves were attempted by many notable political leaders such as the British Prime Minister David Cameron, U.S. President Barack Obama, and United Nations Secretary-General Ban Ki-Moon, who hailed it as a \"force for world peace\". Its influence on political activism was exemplified by the short film Gangnam for Freedom, produced by the British sculptor Anish Kapoor to advocate the freedom of expression with the support of various human rights organisations such as Index on Censorship and Amnesty International. According to the United Nations' news division, PSY has become an \"international sensation\" through his song \"Gangnam Style\". On April 6, 2013 the video on YouTube reached 1.5 billion views. This was written by Ajeet Sunil.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qpqvrp1418301033.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=9bZkp7q19f0", "strMusicVidDirector": " PSY", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/rqwsss1418385962.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/vwxrsw1418386025.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/rqvpqu1418386074.jpg", "intMusicVidViews": "4395283963", "intMusicVidLikes": "24244641", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "5310003", "intTrackNumber": "3", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "882ce25d-51b9-4fe5-bbdf-16e661df0822", "strMusicBrainzAlbumID": "67024b14-3328-411e-8f1c-d651eda82f58", "strMusicBrainzArtistID": "f99b7d67-4e63-4678-aa66-4c6ac0f7d24a", "strLocked": "Unlocked"}]}