{"track": [{"idTrack": "32982824", "idAlbum": "2131087", "idArtist": "114410", "idLyric": "0", "idIMVDB": null, "strTrack": "Give Your Heart A Break", "strAlbum": "Unbroken", "strArtist": "Demi Lovato", "strArtistAlternate": null, "intCD": null, "intDuration": "205606", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Give Your Heart a Break\" is a song performed by American recording artist Demi Lovato, released as the second and final single for her third studio album, Unbroken (2011). The track was written and produced by American songwriters Josh Alexander and Billy Steinberg. Musically, it is a dance-pop ballad that comprises instruments like the drums, violin and strings; the latter two, according to music critics, are reminiscent of those used in Coldplay's \"Viva la Vida\" (Viva la Vida or Death and All His Friends, 2008). Hollywood Records serviced the song to mainstream radios on January 23, 2012 in the United States. Lyrically, the song chronicles the protagonist's attempt to win over her lover who has been hurt in a previous relationship.\n\n\"Give Your Heart a Break\" received critical acclaim from contemporary music critics, praising the production as well as Lovato's vocals. The single debuted at #72 on the Billboard Hot 100, and has peaked at #16 on the chart, as well as reaching #1 on Billboard Pop Songs chart. The song has debuted at 22 in New Zealand and has so far peaked at #9, marking the first time Lovato has had two top 10 singles from one album in that country. The music video for the song features Lovato attempting to persuade her lover that she is the right one for him and will not break his heart like his past girlfriends, creating a collage of photographs taken during the video that when put together create a photo of the two in each other's embrace. Lovato has promoted the song through several stage performances, including her performance at the Z100 Jingle Ball concert. The song has been her biggest radio hit to date, reaching #1 on the U.S. Top 40 charts. The song has sold over 1,600,000 digital copies and was officially certified Platinum in the United States.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/vvqusx1359258357.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=1zfzka5VwRc", "strMusicVidDirector": "Justin Francis", "strMusicVidCompany": "Hello!", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "168769136", "intMusicVidLikes": "908450", "intMusicVidDislikes": "21763", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "10", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "265781", "intTotalPlays": "2875451", "strMusicBrainzID": "5373eb11-76f9-4a29-b2e3-38604d4ed6d7", "strMusicBrainzAlbumID": "1c43f3cb-e590-47e3-a974-b6e92145ef1c", "strMusicBrainzArtistID": "faf4cefb-036c-4c88-b93a-5b03dd0a0e6b", "strLocked": "Unlocked"}]}