{"track": [{"idTrack": "32760368", "idAlbum": "2113166", "idArtist": "111522", "idLyric": "0", "idIMVDB": "0", "strTrack": "One More Night", "strAlbum": "Overexposed", "strArtist": "Maroon 5", "strArtistAlternate": null, "intCD": null, "intDuration": "0", "strGenre": "Pop-Rock", "strMood": "Gentle", "strStyle": "Rock/Pop", "strTheme": "In Love", "strDescriptionEN": "\"One More Night\" is a song performed by American pop rock band Maroon 5. The song was released on June 19, 2012, as the second single from their fourth studio album Overexposed (2012). It was written by Adam Levine, Shellback, Max Martin and Savan Kotecha, while production was handled by Shellback and Martin. It is a pop song with a strong influence of reggae. Lyrically, it talks about not getting along with someone and hoping he only stays with her just \"one more night\". It is built upon the idea of the quintessential push and pull between what the heart, mind and body want, which are usually opposing things.\n\nThe song received mostly favorable reviews from music critics. Most of them complimented the reggae influence on the track, Levine's vocals and labeled it a \"summer catchy song\". However, some critics perceived a lack of identity and criticized the song's melody. The song debuted at number 42 on the Billboard Hot 100, while it debuted at number 27 on the Canadian Hot 100 chart. It has peaked at number 1 on the Hot 100 and number 2 on the Canadian Hot 100 chart. It currently is Maroon 5's most successful single on the Billboard Hot 100, spending 9 consecutive weeks at #1. The song has also been a success on the Australian Singles Chart, reaching number 2 and topping the New Zealand Singles Chart and the South Korean Gaon International Chart.\n\nA music video directed by Peter Berg was released on June 25, 2012. In the video, Levine becomes a boxer working to support his girlfriend and baby. As the singer spends time training for a big fight, he struggles to stay close to his girlfriend while raising their child together. Though he appears determined, his significant other seems troubled by his bloody profession and financial stability for their daughter, and leaves him in the end. The band performed the song for the first time on the Today Show concert series on June 29, 2012, also performing the track on the Late Show with David Letterman and on their Overexposed Tour (2012).", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/sstxvp1359153302.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=fwK7ggA3-bU", "strMusicVidDirector": "Peter Berg", "strMusicVidCompany": "A&M/Octone Records", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "741291764", "intMusicVidLikes": "2522272", "intMusicVidDislikes": "85195", "intMusicVidFavorites": "0", "intMusicVidComments": "109321", "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": "512790", "intTotalPlays": "4177443", "strMusicBrainzID": "7c1fce2d-5f5b-4a5b-8287-d3452ae3677f", "strMusicBrainzAlbumID": "ed3c55b6-e49d-4d4e-a338-62b823b1e2d4", "strMusicBrainzArtistID": "0ab49580-c84f-44d4-875f-d83760ea2cfe", "strLocked": "Unlocked"}]}