{"track": [{"idTrack": "32832384", "idAlbum": "2119013", "idArtist": "112524", "idLyric": "300260", "idIMVDB": "0", "strTrack": "Party Rock Anthem", "strAlbum": "Sorry for Party Rocking", "strArtist": "LMFAO", "strArtistAlternate": null, "intCD": null, "intDuration": "262146", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Rock/Pop", "strTheme": "Party", "strDescriptionEN": "\"Party Rock Anthem\" is a song performed by American electro recording duo LMFAO, featuring British singer Lauren Bennett and GoonRock. It was released as the first single from their second album Sorry for Party Rocking in 2011. It interpolates lyrics from Rick Ross' song \"Hustlin\". The single has gone to number one in Australia, Belgium, Brazil, Canada, Denmark, France, Germany, Ireland, New Zealand, Switzerland, the United Kingdom and the United States. It also reached the top five in Norway and Italy. Certified 11x Platinum, it is the second biggest-selling single of all time in Australia, behind only Elton John's \"Candle in the Wind 1997\".\n\nThe song spent eleven weeks at number one in New Zealand and ten weeks in Australia. It is the longest-running number one single in New Zealand since Smashproof's hit single \"Brother\" in 2009, selling over 45,000 copies there, whereas in Australia, it is the longest-running number-one single since \"I Wish I Was a Punk Rocker (With Flowers in My Hair)\" by Sandi Thom in 2006 and the best-selling single of 2011.\n\n\"Party Rock Anthem\" is a mostly electronic composition. It topped the 7 million downloads mark in the United States in July 2012, becoming the second fastest song in digital history to reach this plateau (in 68 weeks) just behind Adele's \"Rolling in the Deep\" which achieved it in 67 weeks, and the third-biggest selling digital single since Nielsen SoundScan began tracking digital sales in 2003. It reached number one on the Billboard Hot 100 and remained there for six straight weeks. The song spent 68 weeks on the chart, becoming the third most total weeks on Billboard Hot 100 history. It has also sold 7,463,000 copies in the US as of January 2013, and over one million copies in the UK. Worldwide, it was the third best-selling digital single of 2011 with sales of 9.7 million copies. The song won for Favorite Song at the 2012 Kids' Choice Awards. Being featured in the 2012 film 21 Jump Street, it won the MTV Movie Award for Best Music.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rtvxpt1359319896.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=KQ6zr6kCPj8", "strMusicVidDirector": "Mickey Finnegan", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/tqwtrr1418387142.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/qqpqst1418387150.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/vuquqs1418387157.jpg", "intMusicVidViews": "1769393664", "intMusicVidLikes": "7706552", "intMusicVidDislikes": "399659", "intMusicVidFavorites": "0", "intMusicVidComments": "585185", "intTrackNumber": "3", "intLoved": "4", "intScore": "10", "intScoreVotes": "6", "intTotalListeners": "556798", "intTotalPlays": "3364489", "strMusicBrainzID": "7c5b6609-0e04-4ea4-a871-513301db8c9a", "strMusicBrainzAlbumID": "3be839a3-1d35-4846-aa64-9d1532648799", "strMusicBrainzArtistID": "ed5d9086-e8cd-473a-b96c-d81ad6c98f0d", "strLocked": "Unlocked"}]}