{"track": [{"idTrack": "32849947", "idAlbum": "2120401", "idArtist": "111827", "idLyric": "270293", "idIMVDB": "0", "strTrack": "Part of Me", "strAlbum": "Teenage Dream", "strArtist": "Katy Perry", "strArtistAlternate": "Katy Hudson", "intCD": null, "intDuration": "216000", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Part of Me\" is a song by American recording artist Katy Perry, released as the lead single from Teenage Dream: The Complete Confection, the re-release edition of her second studio album, Teenage Dream. It was written by Perry and Bonnie McKee, with production and additional writing by Dr. Luke, Max Martin and Cirkut. The song was not included on the original edition of Teenage Dream because Perry felt that it did not fit the composition of the album. A demo of the song leaked online in late 2010, amid speculation that the lyrics were directed to the singer's ex-boyfriend Travis McCoy. \"Part of Me\" was re-worked and officially released on February 13, 2012, through Capitol Records with artwork by photographer Mary Ellen Matthews.\n\nThe production draws inspiration from several genres, including house music, dance-pop, pop rock and power pop; reviewers compared it to Jessie J's 2011 single \"Domino\", and Perry's 2010 singles \"Firework\" and \"California Gurls\". Its lyrics describe a female protagonist who declares herself as un-breakable and strong following a dramatic break-up. Contemporary music critics praised the song's production and gave it mixed-to-positive reviews, although some criticized Perry's vocals. Critics and media alike theorized that the lyrics addressed Perry's divorce from Russell Brand, although Perry denied this and stated that it was written in early 2010.\n\n\"Part of Me\" was a commercial success. It was the twentieth song to debut at number one on the Billboard Hot 100, Perry's seventh number-one single on the chart, and her ninth consecutive number-one single on the Billboard Hot Dance Club Songs chart. The single debuted at number one in the United Kingdom and Canada, and has been certified Platinum in the United States, Australia and New Zealand. Marketing campaigns for Adidas and The Sims 3: Showtime have featured it, and Lindsey Pavao performed the song on Season 2 of The Voice.\n\nAn accompanying music video was filmed at the United States Marine Corps' Camp Pendleton in Oceanside, California. The video depicts Perry enlisting in the marines following a heartbreak. It garnered generally positive reviews for Perry's \"Girl Power\" message, but drew criticism from feminist author Naomi Wolf, who denounced it as military propaganda. Perry debuted the first televised performance of song on at the 54th Grammy Awards. Perry has performed the song on several television programs, including the ECHO Awards, the 2012 Kids' Choice Awards, and American Idol.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/urqutu1359422333.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=uuwfgXD8qV8", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "799470134", "intMusicVidLikes": "3337116", "intMusicVidDislikes": "167529", "intMusicVidFavorites": "0", "intMusicVidComments": "217527", "intTrackNumber": "14", "intLoved": "1", "intScore": null, "intScoreVotes": null, "intTotalListeners": "358496", "intTotalPlays": "3414846", "strMusicBrainzID": "eca3290c-253d-458a-a5f2-f11dd1221648", "strMusicBrainzAlbumID": "e6f683c9-fc85-412c-a352-d6e411fc2603", "strMusicBrainzArtistID": "122d63fc-8671-43e4-9752-34e846d62a9c", "strLocked": "Unlocked"}]}