{"track": [{"idTrack": "33008919", "idAlbum": "2133217", "idArtist": "112086", "idLyric": "0", "idIMVDB": null, "strTrack": "Pound The Alarm", "strAlbum": "Pink Friday: Roman Reloaded", "strArtist": "Nicki Minaj", "strArtistAlternate": "Onika Tanya Maraj", "intCD": "2", "intDuration": "205000", "strGenre": "Hip-Hop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Pound the Alarm\" is a song by Trinidadian recording artist Nicki Minaj, taken from her second studio album Pink Friday: Roman Reloaded. The song was written by RedOne, Carl Falk, Rami Yacoub, Bilal Hajji and Achraf Jannusi, with co-writing credits from Minaj, and production was handled by RedOne, Falk and Yacoub and was released as the fourth single, but second international single on June 12, 2012 by Young Money. The song was actually not to be released as a single, as Minaj posted a poll on her website asking fans to choose the next single. \"Va Va Voom\" originally won the poll, with \"Whip It\" second and \"Pound the Alarm\" as third. However, due to the amount of airplay requests, Minaj scrapped \"Va Va Voom\" and went ahead with \"Pound the Alarm\".\n\nMusically, \"Pound the Alarm\" is an Eurodance and house-oriented song. The song talks about having a good time, and partying all night (as well as going to festivals/carnivals, as the music video portrays), however it does feature a verse with Minaj warning her lover. \"Pound the Alarm\" received mixed reviews from music critics, with many believing it would be a potential hit commercially and was catchy, while some claimed it was too similar to the album's lead single, \"Starships\". The song was a commercial success, entering the top ten in countries including Finland, New Zealand, Ireland, Canada, Australia and the United Kingdom. The song also had commercial success on the Billboard Hot 100, peaking inside the top twenty and inside the top three on the US Hot Dance Club Songs chart.\n\nThe accompanying music video was shot in her native birth country, Trinidad and Tobago, where it featured Minaj performing at a national Trinidad and Tobago Carnival. It features many performances from native citizens in the video, including dancing and her in front of her relatives at the end of the video. The music video received positive reviews, many enjoying the fun atmosphere. The song was also featured on her Pink Friday: Reloaded Tour.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/yrvyqs1359508886.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=vdrqA93sW-8", "strMusicVidDirector": "Benny Boom", "strMusicVidCompany": "London Alley", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "131501181", "intMusicVidLikes": "511222", "intMusicVidDislikes": "61845", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "11", "intLoved": "1", "intScore": null, "intScoreVotes": null, "intTotalListeners": "257370", "intTotalPlays": "2178285", "strMusicBrainzID": "adf1afd0-79ce-4489-a0f9-5eed751ba260", "strMusicBrainzAlbumID": "78a4ac64-298f-45ec-ac69-832a68830a6a", "strMusicBrainzArtistID": "1036b808-f58c-4a3e-b461-a2c4492ecf1b", "strLocked": "Unlocked"}]}