{"track": [{"idTrack": "32801558", "idAlbum": "2116584", "idArtist": "112167", "idLyric": "0", "idIMVDB": "0", "strTrack": "Somebody That I Used to Know", "strAlbum": "Making Mirrors", "strArtist": "Gotye", "strArtistAlternate": null, "intCD": null, "intDuration": "244973", "strGenre": "Indie", "strMood": "Enlightened", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Somebody That I Used to Know\" is a song written and recorded by Belgian-Australian singer-songwriter Gotye, featuring New Zealand singer/guitarist Kimbra. The song was released in Australia and New Zealand by Eleven Music on 5 July 2011 as the second single from Gotye's third studio album, Making Mirrors (2011). It was later released by Universal Music in December 2011 in the United Kingdom, and in January 2012 in the United States and Ireland. \"Somebody That I Used to Know\" was written and recorded by Gotye at his parent's house on the Mornington Peninsula in Victoria and is lyrically related to the experiences he has had with relationships.\n\n\"Somebody That I Used to Know\" is a mid-tempo, indie pop, ballad song. It samples Luiz Bonfá's song \"Seville\" from his 1967 album Luiz Bonfa Plays Great Songs. The song received positive reception critics, who noted the similarities between the song and works by Sting and American folk band Bon Iver. The song won the Triple J Hottest 100 poll at the end of 2011, as well as ARIA Awards for song of the year and best video, while Kimbra was voted best female artist and Gotye was named best male artist and producer of the year.\n\nCommercially, \"Somebody That I Used to Know\" became Gotye's most successful and signature song. It topped the US, UK, Australian as well as 23 other national charts, and reached the top 10 in more than 30 countries around the world. The song has sold more than 13 million copies worldwide, becoming one of the best-selling digital singles of all time. It was also placed at the top of a number of year-end charts by Billboard (including the Hot 100) and other record chart companies around the world.\n\n\"Somebody That I Used to Know\" has been performed several times live on shows such as The Voice, American Idol and Saturday Night Live. It was covered by Canadian indie rock group Walk off the Earth using a single guitar played simultaneously by all five band members. The original single's accompanying music video was directed by Natasha Pincus. The video premiered on 30 July 2011 and shows Gotye and Kimbra naked against a white backdrop, and while they sing, a pattern of paint gradually covers his skin and the backdrop via stop motion animation.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xuwupw1359353700.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=8UVNT4wvIGY", "strMusicVidDirector": "Natasha Pincus", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/qprqyw1418648141.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/svtrwv1418648152.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/uyvxxt1418648160.jpg", "intMusicVidViews": "1373317481", "intMusicVidLikes": "7588201", "intMusicVidDislikes": "371186", "intMusicVidFavorites": "0", "intMusicVidComments": "592882", "intTrackNumber": "3", "intLoved": "3", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "1053640", "intTotalPlays": "12545766", "strMusicBrainzID": "bdfa2757-958c-4c08-b7bd-a9d24b701882", "strMusicBrainzAlbumID": "8c68c586-358f-46c0-85e3-77d2ea9650be", "strMusicBrainzArtistID": "6f6fd596-76e0-4b82-aa37-f558ac2d337b", "strLocked": "Unlocked"}]}