{"track": [{"idTrack": "33008918", "idAlbum": "2133217", "idArtist": "112086", "idLyric": "0", "idIMVDB": "0", "strTrack": "Starships", "strAlbum": "Pink Friday: Roman Reloaded", "strArtist": "Nicki Minaj", "strArtistAlternate": "Onika Tanya Maraj", "intCD": "2", "intDuration": "210000", "strGenre": "Hip-Hop", "strMood": "Excitable", "strStyle": "Urban/R&B", "strTheme": "...", "strDescriptionEN": "\"Starships\" is a song by American recording artist and songwriter Nicki Minaj, released as the lead single of her second studio album Pink Friday: Roman Reloaded (2012). It was written by Minaj herself, along with Nadir Khayat, Carl Falk, Rami Yacoub and Wayne Hector, while production was handled by RedOne, Yacoub and Falk. With the success of her previous studio album Pink Friday, Minaj along with Brian \"Birdman\" Williams announced to Billboard that Minaj was aiming for a first quarter release in 2012. With this, \"Starships\" would have been released as the lead single. However, before this, Minaj released promotional singles from the album first. It was then announced that her song \"Va Va Voom\" would be released as the lead single, and just as the release date was near, it was scrapped in favor of \"Starships\".\n\n\"Starships\" received generally favorable reviews from music critics, along with negative remarks, with many critics complimenting the songs composition and found it catchy. Critics also found the song's production solid, but believed it was unoriginal and didn't find Minaj's path towards pop music satisfying. However, commercially, the song is recognized as Minaj's most successful charting single to date, peaking at number one in countries including Belgium (both Wallonia and Flanders), France, Germany, Hungary, Norway and the United Kingdom. The song has also peaked inside the top ten in more than 25 countries worldwide. The song also remains her most certified single to date. The song also made US Billboard history, debuting in the US top ten and then spending a total of 21 consecutive weeks in the top ten.\n\nMinaj has performed the song live in a number of appearances, and is the encore performance on the Pink Friday: Reloaded Tour. The corresponding music video was shot Oahu Island, Hawaii. Directed by Anthony Mandler, the song features Nicki on a beach in a bikini, and near the end of the video, it shows her and a \"party-esque\" dancing to the song and performing. The music video was critically acclaimed from music critics, many praising the kaleidoscope effects in the video and the fun, carefree style. However, some critics noticed its postponed release, because the video for her single \"Beez in the Trap\" was released before \"Starships\" was. With all the success, the song has also sparked controversy surrounding a pulled live performance.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/xwsvry1359508826.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=SeIJmciN8mo", "strMusicVidDirector": "Anthony Mandler", "strMusicVidCompany": "LET Films", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "367834219", "intMusicVidLikes": "1894108", "intMusicVidDislikes": "199431", "intMusicVidFavorites": "0", "intMusicVidComments": "208700", "intTrackNumber": "10", "intLoved": "1", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "574038", "intTotalPlays": "4886740", "strMusicBrainzID": "43d3d2d1-0579-41cb-ba8c-d30e28db4e3c", "strMusicBrainzAlbumID": "78a4ac64-298f-45ec-ac69-832a68830a6a", "strMusicBrainzArtistID": "1036b808-f58c-4a3e-b461-a2c4492ecf1b", "strLocked": "Unlocked"}]}