{"track": [{"idTrack": "33157538", "idAlbum": "2145208", "idArtist": "111828", "idLyric": "0", "idIMVDB": "0", "strTrack": "Stronger (What Doesn't Kill You)", "strAlbum": "Greatest Hits Chapter One", "strArtist": "Kelly Clarkson", "strArtistAlternate": null, "intCD": null, "intDuration": "222000", "strGenre": "Pop", "strMood": "Happy", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Stronger (What Doesn't Kill You)\" is a song by American recording artist Kelly Clarkson and the titular song from her fifth studio album, Stronger (2011). Originally titled as \"What Doesn't Kill You (Stronger)\", the song served as the album's second single on January 17, 2012 through RCA Records. Written by Jörgen Elofsson, Ali Tamposi, and David Gamson, with additional writing and production by Greg Kurstin, \"Stronger\" is an uptempo song which draws from the genres of pop rock, dance-pop and electropop. Its lyrical content mainly explores themes of empowerment and recovery following a heartbreak, with the chorus inspired by a Friedrich Nietzsche quotation: \"That which does not kill us makes us stronger.\"\n\nIn the United States, \"Stronger\" became her third song to top the Billboard Hot 100 chart for three non-consecutive weeks, surpassing \"A Moment Like This\" (2002) and \"My Life Would Suck Without You\" (2009) as her longest-running number one single on the chart. It also topped fifteen other Billboard charts, including Adult Pop Songs, Adult Contemporary, Hot Dance Club Songs, and Pop Songs charts, more than any other song Clarkson has ever released. Internationally, \"Stronger\" topped the national charts of Poland and Slovakia and attained a top-ten position in over fifteen countries around the world, eventually selling over five million copies worldwide, becoming one of the best-selling singles of all time. Its success helped its parent album to sustain commercial longevity for over a year. \"Stronger\" merited consideration for several industry awards—including three Grammy Award nominations, and a World Music Award nomination.\n\nThe song's accompanying music video was filmed by Shane Drake, which incorporates the theme of a global flash mob dance, featuring submitted videos of people dancing to the song. The music video garnered positive reception from critics who felt that its overall impact was exuberant. It earned Clarkson a nomination for a MuchMusic Video Award. With its continued success, she performed \"Stronger\" on several live award shows and television appearances around the world, debuting it during the first season of the The X Factor (U.S.) and performing it on the 37th season of Saturday Night Live, the 2012 MuchMusic Video Awards, and the 2012 American Music Awards. Clarkson also included the song in the set list of her Stronger Tour and on the encore set of her 2012 Summer Tour with The Fray.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=Xn676-fLq7I", "strMusicVidDirector": "Shane Drake", "strMusicVidCompany": "Flamingo Films", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "220183248", "intMusicVidLikes": "1070118", "intMusicVidDislikes": "23882", "intMusicVidFavorites": "0", "intMusicVidComments": "69324", "intTrackNumber": "4", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": "342404", "intTotalPlays": "2056157", "strMusicBrainzID": "bd816a37-026b-435a-bbea-a10c684f428e", "strMusicBrainzAlbumID": "fb956ee2-7d00-4480-b941-7b56bb0813c6", "strMusicBrainzArtistID": "d339efbb-77b9-4147-ba9e-59f2f24550b2", "strLocked": "Unlocked"}]}