{"track": [{"idTrack": "32756252", "idAlbum": "2112843", "idArtist": "111472", "idLyric": "0", "idIMVDB": null, "strTrack": "Titanium", "strAlbum": "Nothing but the Beat", "strArtist": "David Guetta", "strArtistAlternate": null, "intCD": null, "intDuration": "245120", "strGenre": "House", "strMood": "Happy", "strStyle": "Electronic", "strTheme": "...", "strDescriptionEN": "\"Titanium\" is a song recorded by French DJ and music producer David Guetta, featuring vocals by Australian recording artist Sia. Taken from the former's fifth studio album, Nothing but the Beat, the song was written by Sia Furler, Guetta, Giorgio Tuinfort and Afrojack. Production was also handled by Guetta, Tuinfort and Afrojack. \"Titanium\" was initially released for digital download on August 8, 2011, as the first of four promotional singles from the album. It was later released as the album's fourth single in December 2011. The song originally featured the vocals of American recording artist Mary J. Blige, whose version of the song leaked online in July 2011. Originally, Katy Perry was offered to feature on the song but turned it down.\n\n\"Titanium\" is a ballad which draws from the genres of pop, house and urban-dance. The song's lyrics are about inner strength. Sia's vocals on \"Titanium\" received comparisons to those by Fergie and the song was also musically compared to Coldplay's work. Critics were positive towards the song and noted it as one of the standout tracks from Nothing but the Beat. \"Titanium\" attained top 10 positions in several major music markets, including Australia, Austria, Denmark, Finland, France, Germany, Hungary, Ireland, Italy, The Netherlands, New Zealand, Norway, Spain, Sweden, Switzerland and the United States. In the United Kingdom, it peaked at number one, becoming Guetta's fifth number-one single on the chart and Sia's first.\n\nThe song's accompanying music video, directed by David Wilson, premiered on December 21, 2011. It does not feature appearances by Guetta or Sia.\n\n\"It's a blockbuster narrative of an apparently ordinary boy (played by Super 8's Ryan Lee) who goes on the run after accidentally exposing his destructive supernatural powers while at school.\" (David Knight, Promonews)\n\nAlong with other songs, \"Titanium\" was pulled from radio stations in the US after the Sandy Hook Elementary School shooting.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uqvvxs1359347943.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "https://www.youtube.com/watch?v=JRfuAukYTKg", "strMusicVidDirector": "David Wilson", "strMusicVidCompany": "Iconoclast", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "1782036987", "intMusicVidLikes": "8785625", "intMusicVidDislikes": null, "intMusicVidFavorites": "0", "intMusicVidComments": "300721", "intTrackNumber": "12", "intLoved": "1", "intScore": "10", "intScoreVotes": "2", "intTotalListeners": "139491", "intTotalPlays": "1220593", "strMusicBrainzID": "0069c0f7-9274-4b4b-a10e-110b90a4bcc0", "strMusicBrainzAlbumID": "a2709bdb-e16e-4f71-b1aa-cc68119fb782", "strMusicBrainzArtistID": "302bd7b9-d012-4360-897a-93b00c855680", "strLocked": "Unlocked"}]}