{"track": [{"idTrack": "32814273", "idAlbum": "2117560", "idArtist": "112316", "idLyric": "0", "idIMVDB": null, "strTrack": "Turn Up the Music", "strAlbum": "Fortune", "strArtist": "Chris Brown", "strArtistAlternate": null, "intCD": null, "intDuration": "0", "strGenre": "R&B", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Turn Up the Music\" is a song by American recording artist Chris Brown. It was written by Alexander \"Fuego\" Palmer, Brown, Damon Thomas, Harvey Mason, Jr., Michael \"Mike J\" Jimenez and Terence Cole, while production was handled by Fuego and The Underdogs. \"Turn Up the Music\" was sent to contemporary hit radio playlists in the United States on February 7, 2012, as the lead single from Brown's fifth studio album Fortune (2012). It was released for digital download on February 10, 2012. \"Turn Up the Music\" is an uptempo song which draws from the genres of electronic dance, house and dance-pop. Instrumentation consists of pulsating beats, synthesizers, a \"throbbing bass\" and percussion. According to Mason, Jr., the song's inspiration came from visualizing Brown as an artist, \"how he dances and how he performs, and giving him something to match that energy.\"\n\n\"Turn Up the Music\" garnered positive reviews from music critics, who complimented its production and compared the song to Brown's previous singles \"Forever\" (2008) and \"Yeah 3x\" (2010), for its similar musical direction. Critics also noted its similarities to the work of LMFAO and David Guetta. \"Turn Up the Music\" achieved commercial success worldwide, becoming Brown's first number one single on the UK Singles Chart, and his eleventh top ten single on the US Billboard Hot 100 chart. The song also reached the top ten in Australia and New Zealand, and the top twenty in Canada, Hungary, Ireland and Slovakia. It was certified double platinum by the Australian Recording Industry Association (ARIA), and gold by the Recording Industry Association of New Zealand (RIANZ).\n\nThe accompanying music video for \"Turn Up the Music\" was directed by Godfrey Taberez and Brown, and filmed in Los Angeles, California. It features Brown at a party filled with masked people, where he performs heavily-choreographed dance routines. The video garnered positive reception from critics, for its series of dance sequences which were compared to Michael Jackson. It won Best Male Video and Best Choreography at the 2012 MTV Video Music Awards, and earned Taberez and Brown a nomination for Video Director of the Year at the 2012 BET Awards. Brown promoted the song with live performances on televised shows and at awards ceremonies, including Dancing with the Stars, Today, the 2012 NBA All-Star Game halftime show, the 54th Grammy Awards, the 2012 Billboard Music Awards and the BET Awards. He also included the song in his set list at Supafest Australia. The official remix of \"Turn Up the Music\" premiered online on February 20, 2012, and features Brown's former girlfriend Rihanna.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/qpxvwy1359097135.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=eQWG8BVeryU", "strMusicVidDirector": "Chris Brown", "strMusicVidCompany": "Riveting Entertainment", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "143778936", "intMusicVidLikes": "530489", "intMusicVidDislikes": "21288", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": "258659", "intTotalPlays": "1424677", "strMusicBrainzID": "49b095be-50f1-434f-b1f1-28dc40c5657f", "strMusicBrainzAlbumID": "8f0ef3d8-5ea1-468a-87ae-b45dc06124bc", "strMusicBrainzArtistID": "c234fa42-e6a6-443e-937e-2f4b073538a3", "strLocked": "Unlocked"}]}