{"track": [{"idTrack": "32801522", "idAlbum": "2116581", "idArtist": "112165", "idLyric": "0", "idIMVDB": null, "strTrack": "Want U Back", "strAlbum": "Sticks + Stones", "strArtist": "Cher Lloyd", "strArtistAlternate": null, "intCD": null, "intDuration": "215080", "strGenre": "Rap", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Want U Back\" is a song by British singer Cher Lloyd, taken from her debut studio album Sticks + Stones. It was released on 19 February 2012 as the third single and on 22 May 2012 as her debut U.S. single taken from the album. The UK single version of the song features guest vocals from The X Factor USA contestant Brian \"Astro\" Bradley, while the Calvin Broadus and original album version without Bradley's vocals were released in the United States. It was written by Shellback and Savan Kotecha and it was produced by Shellback. Musically, \"Want U Back\" is a dance-pop song, with elements of bubblegum and synthpop while the lyrics are about a girl who gets jealous (though she denies it) when she sees that her ex-boyfriend has apparently moved on to another girl, and even though she was the one who dumped him in the first place, the girl wants to get back together with him.\nThe song received widespread critical acclaim from most music critics, who praised her sassy attitude on the song and labelled it \"infectious\". Other critics, however, found her use of aggressive grunting somewhat disturbing, ruining an \"otherwise mediocre\" song. There are two videos for the song: the UK version and the US version. Both videos feature Lloyd traipsing through old photographs with her former beau and some with his new girlfriend and wreaking havoc on the happy couple. The song has reached number 3 on the New Zealand Singles Chart, number 18 on the Irish Singles Chart and number 12 on the UK Singles Chart. In the United States, the song has reached number 9 on the Pop Songs chart and number 12 on the Billboard Hot 100, the first top 40 hit on United States. It remains Lloyd's biggest hit both worldwide and in the United States to date. This song was later covered by the Kidz Bop kids for the CD Kidz Bop 23.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=inwAc-ZBpx0", "strMusicVidDirector": "", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "52788365", "intMusicVidLikes": "292237", "intMusicVidDislikes": "14592", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "225879", "intTotalPlays": "1481349", "strMusicBrainzID": "2fe2272f-133c-499e-8108-c25068b1b54d", "strMusicBrainzAlbumID": "2c16cbb2-667c-4a00-8c5f-7795ef91f6cf", "strMusicBrainzArtistID": "48fbfb0b-92ee-45eb-99c2-0bde4c05962e", "strLocked": "Unlocked"}]}