{"track": [{"idTrack": "32842499", "idAlbum": "2119826", "idArtist": "112628", "idLyric": "0", "idIMVDB": null, "strTrack": "We Are Young", "strAlbum": "Some Nights", "strArtist": "fun.", "strArtistAlternate": "fun", "intCD": null, "intDuration": "250000", "strGenre": "Alternative Rock", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"We Are Young\" is a song recorded by American band Fun for their second studio album Some Nights (2012). It was released on September 20, 2011 as the lead single from Some Nights. Musically, \"We Are Young\" is a power ballad that incorporates the genres of indie pop, alternative rock, and power pop. The song received generally positive reviews from music critics, with many noting the song as a breakthrough for the indie genre and praising the song's catchiness. \"We Are Young\" has attained commercial success worldwide, reaching number one in several countries.\n\nThe track initially only gained attention from online media although it did receive its first commercial radio airplay on WDHA-FM during the October 2, 2011 edition of Anything Anything with Rich Russo , but was soon covered by the television show Glee. With the Glee version having success on the charts, the song was licensed for use in a Chevrolet Sonic commercial that aired during Super Bowl XLVI. The single song propelled the band into mainstream success, topping the digital charts in February 2012 and becoming a crossover hit, peaking at number one on the Billboard Hot 100 through airplay on contemporary hit radio stations, topping the chart for six weeks straight. It is also the first song to log seven weeks of 300,000 or more in digital sales, a record that was previously held by Eminem's \"Love the Way You Lie\" (2010). \"We Are Young\" has been certified five-times platinum by the Recording Industry Association of America, and is both Fun and Monáe's first charting single on the Hot 100, as well as their first number-one single. The song also topped the Hot 100 Airplay chart with 120 million impressions in seven weeks, becoming the first group since Destiny's Child's \"Survivor\" (2001) to do so.\n\nAn accompanying music video was directed by Marc Klasfeld at David Sukonick Concert Hall in Los Angeles. It features the group performing on a stage at a bar where a riot breaks out. As part of promotion for the song, it was performed at the 2011 Coachella Valley Music and Arts Festival, the American late night television show Conan, and was used as the opening song at the 2012 MTV Movie Awards. The song is featured in the music video game, Rock Band Blitz. The song has also garnered the band nominations for Song of the Year, Record of the Year and Best Pop Duo/Group Performance at the 55th Grammy Awards to be presented on February 10, 2013.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rywrsr1359100095.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=Sv6dMFF_yts", "strMusicVidDirector": null, "strMusicVidCompany": null, "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "287035282", "intMusicVidLikes": "1168891", "intMusicVidDislikes": "32609", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "3", "intLoved": "1", "intScore": "10", "intScoreVotes": "1", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "9f7bac6a-0231-4fc3-b277-2a4c000ee606", "strMusicBrainzAlbumID": "a969cc3c-2ab3-4799-acb1-50e1325cb290", "strMusicBrainzArtistID": "136c4166-85b3-4994-aa04-59857c434199", "strLocked": "Unlocked"}]}