{"track": [{"idTrack": "32734764", "idAlbum": "2110672", "idArtist": "111305", "idLyric": "0", "idIMVDB": null, "strTrack": "We Found Love", "strAlbum": "Talk That Talk", "strArtist": "Rihanna", "strArtistAlternate": "Robyn Rihanna Fenty", "intCD": null, "intDuration": "216000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"We Found Love\" is a song by Barbadian recording artist Rihanna, from her sixth studio album Talk That Talk (2011). The song features Scottish producer/singer Calvin Harris. \"We Found Love\" was released as the lead single from the album and premiered on September 22, 2011, in the United Kingdom on the Capital FM radio station and was made available to download on the same day. The track is a dance-pop and electro house song, with elements of techno and Europop. It is backed by repetitive synthesizers, alarm bells, and a keyboard. The song's lyrics speak of a couple who finds love in a hopeless place.\n\n\"We Found Love\" was met with mixed to positive reviews from music critics, who praised the song's composition and Rihanna's vocal performance, however, some critics felt that the lyrical content was sparse and came second to Harris' production. \"We Found Love\" was a huge commercial success. In the United States, the song topped the Billboard Hot 100 for ten non-consecutive weeks, becoming the longest running number one single of 2011 and surpassing \"Umbrella\" as her longest running number one single. It became Rihanna's eleventh song to top the Hot 100, placing her in third place amongst female recording artists amassing the most number one singles. \"We Found Love\" topped the charts in twenty countries including Ireland, New Zealand, Switzerland and the United Kingdom. It also attained top five positions in Australia, the Netherlands and Spain, and peaked in the top ten of charts in twenty-nine countries worldwide. It has sold more than 5.2 million copies worldwide, becoming one of the best-selling singles of all time.\n\nThe song's accompanying music video, directed by Melina Matsoukas, depicts the singer as a drug abusing thrill seeker in a relationship that quickly spirals downward into addiction and violence. The video received a mixed response from critics, as they noted that it profoundly alludes to ex-boyfriend Chris Brown's assault on Rihanna, two years prior. It attracted criticism from political commentators, who questioned the video for its suggestive sexual nature. The song has been performed on both the UK and US versions of The X Factor, as well as at the 54th Grammy Awards and the 2012 BRIT Awards. Many artists have covered the song including British alternative rock band Coldplay and singer Jessie J at BBC Radio 1's Live Lounge. Both Flo Rida and R3hab made a remix of the song.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/uruqqu1477265608.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=tg00YEETFzg", "strMusicVidDirector": "Melina Matsoukas", "strMusicVidCompany": "Prettybird", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/tyyrqu1419257349.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/uvqvqx1419257358.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/qtysxs1419257366.jpg", "intMusicVidViews": "408904407", "intMusicVidLikes": "1108516", "intMusicVidDislikes": "66252", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "3", "intLoved": "3", "intScore": "10", "intScoreVotes": "2", "intTotalListeners": null, "intTotalPlays": null, "strMusicBrainzID": "11294597-b4ac-4717-8e95-f99d665c1ece", "strMusicBrainzAlbumID": "15818ec5-bf34-47de-a4e5-260f98828d64", "strMusicBrainzArtistID": "73e5e69d-3554-40d8-8516-00cb38737a1c", "strLocked": "Unlocked"}]}