{"track": [{"idTrack": "32853239", "idAlbum": "2120660", "idArtist": "112782", "idLyric": "0", "idIMVDB": "0", "strTrack": "What Makes You Beautiful", "strAlbum": "Up All Night", "strArtist": "One Direction", "strArtistAlternate": null, "intCD": null, "intDuration": "198000", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"What Makes You Beautiful\" is a song performed by English-Irish boy band One Direction. It served as their debut single and lead single from their debut studio album Up All Night (2011). Written by Rami Yacoub, Carl Falk and Savan Kotecha and produced by Yacoub and Falk, it was released by Syco Records on 11 September 2011. After recording the song at Cosmos Studios and Kinglet Studios in Stockholm, Sweden, the band felt relieved to have a song that they were happy to release as their first single. The track is an uptempo song which interpolates pop genres teen pop, power pop and pop rock. It features a prominent guitar-based chorus and riff, and the middle eight consists of an \"oh na na na\" hook.\nThe song was generally complimented by contemporary music critics, many of whom highlighted its appeal to the teenage audience and pop sensibility. It made its UK Singles Chart debut at number one, after setting a Sony Music Entertainment pre-order record and selling 153,965 copies in its first week. The single also topped the Irish and Scottish Singles Charts, and reached the top ten on the Australian and New Zealand Singles Charts, Flemish Ultratop 50, Canadian Hot 100, Japan Hot 100 and the United States Billboard Hot 100. It peaked at number 4 on the Billboard Hot 100 and as of July 2012, had sold over 3 million copies in the US. With over 5 million copies sold worldwide, the track is among the best-selling singles of all time. Additionally, \"What Makes You Beautiful\" is the best-selling song by a boy band in digital history.\n\nThe single's accompanying music video was directed by John Urbano and premiered on 19 August 2011, and depicts One Direction spending time on a Malibu, California beach. The video garnered the group three MTV Video Music Awards on 6 September 2012, including Best Pop Video. One Direction performed the song live on televised shows, at awards ceremonies, and during their worldwide Up All Night Tour. Artists including Boyce Avenue, Parade, Rita Ora and Josh Groban have covered \"What Makes You Beautiful\", and it was performed on an episode of Glee titled \"Prom-asaurus\". \"What Makes You Beautiful\" won the BRIT Award for Best British Single at the 2012 ceremony.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/wsxxut1359241746.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=QJO3ROT-A4E", "strMusicVidDirector": "John Urbano", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/wvvwvp1418397903.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/wxpqsv1418397911.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/rwwusy1418397919.jpg", "intMusicVidViews": "1121845630", "intMusicVidLikes": "6762104", "intMusicVidDislikes": "439801", "intMusicVidFavorites": "0", "intMusicVidComments": "1012193", "intTrackNumber": "1", "intLoved": "2", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "476043", "intTotalPlays": "4155030", "strMusicBrainzID": "178b8aa3-72ea-4a5d-aa10-cdc1c7d13af9", "strMusicBrainzAlbumID": "efba7763-a237-4bba-85e7-ba94f59f8c2c", "strMusicBrainzArtistID": "1a425bbd-cca4-4b2c-aeb7-71cb176c828a", "strLocked": "Unlocked"}]}