{"track": [{"idTrack": "32734763", "idAlbum": "2110672", "idArtist": "111305", "idLyric": "0", "idIMVDB": null, "strTrack": "Where Have You Been", "strAlbum": "Talk That Talk", "strArtist": "Rihanna", "strArtistAlternate": "Robyn Rihanna Fenty", "intCD": null, "intDuration": "243000", "strGenre": "Pop", "strMood": null, "strStyle": null, "strTheme": null, "strDescriptionEN": "\"Where Have You Been\" is a song by Barbadian recording artist Rihanna, from her sixth studio album Talk That Talk (2011) serving as the fifth single. The song was written by Ester Dean, Lukasz \"Dr. Luke\" Gottwald, Henry \"Cirkut\" Walter, Geoff Mack, and Calvin Harris. Harris also produced the track alongside Dr. Luke and Cirkut. \"Where Have You Been\" was released as the third international single from the album on May 21, 2012. The track is a dance-pop and techno house song that draws influence from trance, R&B and hip hop. It is backed by \"hard, chilly synths\" and contains a Electro-inspired breakdown sequence. The song's lyrics speak of a woman who is searching for a partner who will please her.\n\n\"Where Have You Been\" was met with positive reviews from most music critics, who likened the song to Talk That Talk's lead single, \"We Found Love\". The track performed well on major international charts. In the United States, \"Where Have You Been\" reached number five on the Billboard Hot 100, marking Rihanna's twenty-second top ten single on the chart. It also peaked at number one on both the US Hot Dance Club Songs and UK Dance Chart, and at number three on the US Pop Songs chart. In addition, it attained top five positions in the Czech Republic, Denmark, France, Israel, New Zealand and the United Kingdom, while peaking in the top ten of charts in twenty countries worldwide including Australia, Belgium and Norway.\n\nThe song's accompanying music video, directed by Dave Meyers depicts the singer in an assortment of costumes and locations, referencing the song's lyrics. Rihanna is seen as a semi-naked water reptilian, in an Egyptian desert, an African themed hut, and channeling Hindu god Shiva with multiple limbs. The video received a positive response from critics, who praised Rihanna's new approach to deeper choreography. Rihanna has performed the song on both Saturday Night Live and the finale of the eleventh season of American Idol. It has been nominated for Best Pop Solo Performance at the 55th Grammy Awards, which will be held on 10th February 2013.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rwuxpx1359241936.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=HBxt_v0WF6Y", "strMusicVidDirector": "Dave Meyers", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/quwuvx1419258258.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/wxrvvr1419258265.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/urpyqs1419258272.jpg", "intMusicVidViews": "281548488", "intMusicVidLikes": "974369", "intMusicVidDislikes": "49221", "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "2", "intLoved": "0", "intScore": "7.5", "intScoreVotes": "2", "intTotalListeners": "467596", "intTotalPlays": "4659465", "strMusicBrainzID": "3d409b8b-7161-4787-8c89-ccee7b232d5d", "strMusicBrainzAlbumID": "15818ec5-bf34-47de-a4e5-260f98828d64", "strMusicBrainzArtistID": "73e5e69d-3554-40d8-8516-00cb38737a1c", "strLocked": "Unlocked"}]}