{"track": [{"idTrack": "32849948", "idAlbum": "2120401", "idArtist": "111827", "idLyric": "0", "idIMVDB": "0", "strTrack": "Wide Awake", "strAlbum": "Teenage Dream", "strArtist": "Katy Perry", "strArtistAlternate": "Katy Hudson", "intCD": null, "intDuration": "220000", "strGenre": "Pop", "strMood": "Cheerful", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"Wide Awake\" is a song by American recording artist Katy Perry, from the album Teenage Dream: The Complete Confection (2012). The song was written by Perry, Bonnie McKee, Dr. Luke, Max Martin and Cirkut, and was produced by Dr. Luke and Cirkut. The song was specifically written for Perry's film Katy Perry: Part of Me, and plays during the end credits. \"Wide Awake\" was released on May 22, 2012 by Capitol Records as the second single from the re-release and overall as the eighth and final single from the album.\n\nA power ballad, \"Wide Awake\" utilizes electronic and dance-pop within its composition, and is lyrically reminiscent of the reality of a break up and moving past it. \"Wide Awake\" was written as part of promotion for her 2012 3D documentary-concert film, Katy Perry: Part of Me. The song was well received by critics, many noting its production and Perry's maturity. \"Wide Awake\" reached number one in multiple countries, including Canada, New Zealand, and Poland, while peaking in the top ten position in Australia, Ireland, Lebanon, Mexico, Scotland, United Kingdom, and Venezuela.\n\n\"Wide Awake\" became her tenth consecutive number-one single on the Billboard Hot Dance Club Songs chart and her ninth number-one single on the Billboard Mainstream Top 40 (Pop Songs) chart, tying her with Rihanna as the artists with the most number one singles on the chart. The song peaked at number two on the Billboard Hot 100, becoming Perry's eleventh top-ten hit single in the United States, following all seven of the previous singles from Teenage Dream and three out of four singles from her debut album One of the Boys.\n\nAn accompanying music video, directed by Tony T. Datis, was premiered on June 18, 2012. A trailer, directed by Lance Drake, was released on June 12, 2012. It features a fairy tale-plot, where a young girl looks through a story book that features the previous Teenage Dream era singles, each one as a chapter in the book, along with teasers about the fairy tale elements of the official video, which serves as the eighth and final chapter of the book. Perry performed \"Wide Awake\" at the 2012 MuchMusic Video Awards and at the 2012 Billboard Music Awards, where it featured Perry floating over the stage with a white ribbon.\n\nIt has been nominated for Best Pop Solo Performance at the 55th Annual Grammy Awards, which will be held on 10th February 2013. It is also on the shortlist of 75 songs eligible for nomination in the Best Original Song category at the 85th Academy Awards.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": "https://www.theaudiodb.com/images/media/track/thumb/rvyyux1359093423.jpg", "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "http://www.youtube.com/watch?v=k0BWlvnBmIE", "strMusicVidDirector": "Tony Datis", "strMusicVidCompany": "", "strMusicVidScreen1": "https://www.theaudiodb.com/images/media/track/mvidscreen/sqxprs1364484878.jpg", "strMusicVidScreen2": "https://www.theaudiodb.com/images/media/track/mvidscreen/txvyqq1364484948.jpg", "strMusicVidScreen3": "https://www.theaudiodb.com/images/media/track/mvidscreen/uvqusu1364484898.jpg", "intMusicVidViews": "913523620", "intMusicVidLikes": "3355260", "intMusicVidDislikes": "185645", "intMusicVidFavorites": "0", "intMusicVidComments": "228843", "intTrackNumber": "15", "intLoved": "2", "intScore": null, "intScoreVotes": null, "intTotalListeners": "356004", "intTotalPlays": "3130860", "strMusicBrainzID": "2c2b2fff-b527-4cfd-90ae-41647a7d2d35", "strMusicBrainzAlbumID": "e6f683c9-fc85-412c-a352-d6e411fc2603", "strMusicBrainzArtistID": "122d63fc-8671-43e4-9752-34e846d62a9c", "strLocked": "Unlocked"}]}