{"track": [{"idTrack": "33753369", "idAlbum": "2194021", "idArtist": "111969", "idLyric": "436023", "idIMVDB": "247775845352", "strTrack": "I Want You", "strAlbum": "Truly Madly Completely", "strArtist": "Savage Garden", "strArtistAlternate": null, "intCD": null, "intDuration": "233893", "strGenre": "Pop-Rock", "strMood": "Gritty", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"I Want You\" is a song by Australian pop duo Savage Garden. It was originally released in Australia on 27 May 1996 as the lead single from their eponymous debut album, Savage Garden (1997). The single reached number one in Canada for two weeks and peaked at number four in Australia and on the US Billboard Hot 100. Much of the song's chart success in the US was the result of Rosie O'Donnell playing the song on several episodes of The Rosie O'Donnell Show. The single also peaked at number nine in Iceland and at 11 on the UK Singles Chart. In November 1998, the single was re-released in the United Kingdom following the success of \"Truly Madly Deeply\" and \"To the Moon and Back\". This release peaked at number 12.\n\nAt the APRA Music Awards of 1998 it won Most Performed Australian Work Overseas. In January 2018, as part of Triple M's \"Ozzest 100\", the 'most Australian' songs of all time, the album version of the song was ranked number 87.\n\nTwo music videos were released for the song. Both videos present Darren Hayes with long black hair.\n\nThe first video is a low-budget version released in 1996 for Australian markets. It showed the band performing in a room full of disco lights and Darren Hayes singing on the back of a moving vehicle.\n\nThe second video was filmed on a high budget and premiered in 1997 for international markets in conjunction with the single's worldwide and American releases. Directed by Nigel Dick, it features the band in a stylised futuristic warehouse and recording studio. It was filmed on 11 February 1997 at the Harbor Generating Station in Long Beach, California. The international version was featured on the band's compilation Truly Madly Completely: The Best of Savage Garden (2005), while the Australian version was not available until the release of the compilation The Singles (2015).\n\nIn a 2022 interview with News Corp, Darren Hayes said he only recently discovered the reason he was filmed in a metal head brace for the video was “because the lead singer looks gay when he moves.” Hayes added, “They were just going to tell me it was an ‘artistic decision’. I’m still fucking angry about that.\"", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": null, "strMusicVid": "", "strMusicVidDirector": "Nigel Dick", "strMusicVidCompany": "", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": null, "intMusicVidLikes": null, "intMusicVidDislikes": null, "intMusicVidFavorites": null, "intMusicVidComments": null, "intTrackNumber": "1", "intLoved": "0", "intScore": "10", "intScoreVotes": "4", "intTotalListeners": "231457", "intTotalPlays": "1149133", "strMusicBrainzID": "a9ba4266-c684-486f-9567-434cda8d8108", "strMusicBrainzAlbumID": "94c05bd0-f2bb-32ad-8230-68b9775ce421", "strMusicBrainzArtistID": "a871fd87-50f7-4032-b06d-da56779edcce", "strLocked": "Unlocked"}]}