{"track": [{"idTrack": "32726973", "idAlbum": "2109913", "idArtist": "111261", "idLyric": "86259", "idIMVDB": "0", "strTrack": "It's All Coming Back to Me Now", "strAlbum": "Falling Into You", "strArtist": "Céline Dion", "strArtistAlternate": "Celine Dion", "intCD": null, "intDuration": "457226", "strGenre": "Pop", "strMood": "In Love", "strStyle": "Rock/Pop", "strTheme": "...", "strDescriptionEN": "\"It's All Coming Back to Me Now\" is a power ballad written by Jim Steinman. According to Steinman, the song was inspired by Wuthering Heights, and was an attempt to write \"the most passionate, romantic song\" he could ever create. The Sunday Times posits that \"Steinman protects his songs as if they were his children\". Meat Loaf had wanted to record \"It's All Coming Back...\" for years, but Steinman saw it as a \"woman's song.\" Steinman won a court movement preventing Meat Loaf from recording it. Girl group Pandora's Box went on to record it and it was subsequently made famous through a cover by Celine Dion, which upset Meat Loaf because he was going to use it for a planned album with the working title Bat Out of Hell III. Alternately, Meat Loaf has said the song was intended for Bat Out of Hell II and given to the singer in 1986, but that they both decided to use \"I'd Do Anything for Love (But I Won't Do That)\" for Bat II, and save this song for Bat III.\n\nThe song has had three major releases. The first version appeared on the concept album Original Sin, recorded by Pandora's Box. It was then recorded by Celine Dion for her album Falling into You, and her version was a commercial hit, reaching No. 2 in the U.S. Billboard Hot 100 and No. 3 in the UK Singles Chart. Meat Loaf recorded it as a duet with Norwegian singer Marion Raven for Bat III and released it as a single in 2006.\n\nA music video was produced for each of the three versions; death is a recurring theme in all of these videos, fitting in with the suggestion in Virgin's press release for Original Sin that \"in Steinman's songs, the dead come to life and the living are doomed to die.\" This is particularly evident when the dead characters seem to be resurrected in the memories of the main vocalist. Although in the case of Celine Dion's video, the theme is less about the living being doomed and more about a lost love.", "strDescriptionDE": null, "strDescriptionFR": null, "strDescriptionCN": null, "strDescriptionIT": null, "strDescriptionJP": null, "strDescriptionRU": null, "strDescriptionES": null, "strDescriptionPT": null, "strDescriptionSE": null, "strDescriptionNL": null, "strDescriptionHU": null, "strDescriptionNO": null, "strDescriptionIL": null, "strDescriptionPL": null, "strTrackThumb": null, "strTrack3DCase": null, "strTrackLyrics": "", "strMusicVid": "", "strMusicVidDirector": "Nigel Dick", "strMusicVidCompany": "Squeak Pictures", "strMusicVidScreen1": null, "strMusicVidScreen2": null, "strMusicVidScreen3": null, "intMusicVidViews": "0", "intMusicVidLikes": "0", "intMusicVidDislikes": "0", "intMusicVidFavorites": "0", "intMusicVidComments": "0", "intTrackNumber": "1", "intLoved": "1", "intScore": "10", "intScoreVotes": "5", "intTotalListeners": "156853", "intTotalPlays": "773103", "strMusicBrainzID": "0d0a2d8f-43de-44c4-a559-57b278f52348", "strMusicBrainzAlbumID": "7c89982d-e6a6-3811-828d-5462a69f0ddf", "strMusicBrainzArtistID": "847e8a0c-cc20-4213-9e16-975515c2a926", "strLocked": "Unlocked"}]}